// 歌曲資料
const songs = [
  {
    id: "song1",
    title: "稻香",
    creators: ["周杰倫 Jay Chou"],
    lyrics: `對這個世界如果你有太多的抱怨
跌倒了就不敢繼續往前走
為什麼人要這麼的脆弱 墮落
請你打開電視看看
多少人為生命在努力勇敢的走下去
我們是不是該知足
珍惜一切 就算沒有擁有

還記得你說家是唯一的城堡
隨著稻香河流繼續奔跑
微微笑 小時候的夢我知道
不要哭讓螢火蟲帶著你逃跑
鄉間的歌謠永遠的依靠
回家吧 回到最初的美好

不要這麼容易就想放棄 就像我說的
追不到的夢想 換個夢不就得了
為自己的人生鮮艷上色
先把愛塗上喜歡的顏色

笑一個吧 功成名就不是目的
讓自己快樂快樂這才叫做意義
童年的紙飛機 現在終於飛回我手裡
所謂的那快樂 赤腳在田裡追蜻蜓追到累了
偷摘水果被蜜蜂給叮到怕了 誰在偷笑呢
我靠著稻草人吹著風唱著歌睡著了
哦 哦 午後吉他在蟲鳴中更清脆
哦 哦 陽光灑在路上就不怕心碎
珍惜一切 就算沒有擁有

還記得你說家是唯一的城堡
隨著稻香河流繼續奔跑
微微笑 小時候的夢我知道
不要哭讓螢火蟲帶著你逃跑
鄉間的歌謠永遠的依靠
回家吧 回到最初的美好

還記得你說家是唯一的城堡
隨著稻香河流繼續奔跑
微微笑 小時候的夢我知道
不要哭讓螢火蟲帶著你逃跑
鄉間的歌謠永遠的依靠
回家吧 回到最初的美好`,
    release_date: "2008-10-15",
    albums: "摩羯座",
    image: "images/Capricorn_(album)_cover2.jpg",
    lyricist: ["周杰倫 Jay Chou"],
    composer: ["周杰倫 Jay Chou"],
    original_artist: [],
    language: "中文",
    genre: "流行",
    rating: ""
  },
  {
    id: "song2",
    title: "晴天",
    creators: ["周杰倫 Jay Chou"],
    lyrics: `故事的小黃花 從出生那年就飄著
童年的盪鞦韆 隨記憶一直晃到現在

ㄖㄨㄟ ㄙㄡ ㄙㄡ ㄒ一 ㄉㄛ ㄒ一 ㄌㄚ
ㄙㄡ ㄌㄚ ㄒ一 ㄒ一 ㄒ一 ㄒ一 ㄌㄚ ㄒ一 ㄌㄚ ㄙㄡ

吹著前奏望著天空 我想起花瓣試著掉落

為妳翹課的那一天 花落的那一天
教室的那一間 我怎麼看不見
消失的下雨天 我好想再淋一遍
沒想到失去的勇氣我還留著
好想再問一遍 妳會等待還是離開

颳風這天 我試過握著妳手
但偏偏 雨漸漸 大到我看妳不見
還要多久 我才能在妳身邊
等到放晴的那天 也許我會比較好一點

從前從前 有個人愛妳很久
但偏偏 風漸漸 把距離吹得好遠
好不容易 又能再多愛一天
但故事的最後妳好像還是說了拜拜

為妳翹課的那一天 花落的那一天
教室的那一間 我怎麼看不見
消失的下雨天 我好想再淋一遍
沒想到失去的勇氣我還留著
好想再問一遍 妳會等待還是離開

颳風這天 我試過握著妳手
但偏偏 雨漸漸 大到我看妳不見
還要多久 我才能在妳身邊
等到放晴的那天 也許我會比較好一點

從前從前 有個人愛妳很久
但偏偏 風漸漸 把距離吹得好遠
好不容易 又能再多愛一天
但故事的最後妳好像還是說了拜拜
颳風這天 我試過握著妳手 但偏偏 雨漸漸 大到我看妳不見
還要多久 我才能夠在妳身邊 等到放晴的那天 也許我會比較好一點
從前從前 有個人愛妳很久 但偏偏 雨漸漸 把距離吹得好遠
好不容易 又能再多愛一天 但故事的最後妳好像還是說了拜`,
    release_date: "2008-10-15",
    albums: "葉惠美",
    image: "images/Jay_2003_ablum_cover.jpg",
    lyricist: ["周杰倫 Jay Chou"],
    composer: ["周杰倫 Jay Chou"],
    original_artist: [],
    language: "中文",
    genre: "流行",
    rating: ""
  },
  {
    id: "song3",
    title: "你，好不好？",
    creators: ["Eric周興哲"],
    lyrics: `是不是還那麼愛遲到?
熬夜工作又睡不好
等你完成你的目標
要戒掉逞強的嗜好
都怪我把自尊放太高
沒有把你照顧好
驕傲是脆弱的外表
最怕我的心你不要
能不能繼續對我哭 對我笑 對我好?
繼續讓我為你想 為你瘋 陪你老
你好不好? 好想知道
別急著把回憶都丟掉
我只需要你在身邊陪我吵 陪我鬧
用好的我把過去壞的我都換掉
好想聽到你堅決說愛我
可惜回不去那一秒 你好不好?
天知道我快要受不了
後悔鑽進心裡燒
擁抱再多一次就好
你要的我都做得到
能不能繼續對我哭 對我笑 對我好?
繼續讓我為你想 為你瘋 陪你老
給你的好還要不要?
答案我卻不敢揭曉
我只需要你在身邊 陪我吵 陪我鬧
別用離開教我 失去的人最重要
別說 你曾經愛過我
讓我們回到那一秒 你好不好?
能不能繼續對我哭 對我笑 對我好?
繼續讓我為你想 為你瘋 陪你老
你好不好? 我好想知道
別急著把我的愛丟掉
我只需要你在身邊 陪我吵 陪我鬧
別用離開教我 失去的人最重要
別說 你曾經愛過我
讓我們回到那一秒 你好不好?`,
    release_date: "2016-08-05",
    albums: "愛，教會我們的事",
    image: "images/500x500.jpg",
    lyricist: ["Eric周興哲", "吳易緯"],
    composer: ["Eric周興哲"],
    original_artist: [],
    language: "中文",
    genre: "流行",
    rating: ""
  },
  {
    id: "song1761398510028",
    title: "眼底星空",
    creators: ["李聖傑"],
    lyricist: ["十方"],
    composer: ["李聖傑", "蔡伯南"],
    albums: "關於你的歌",
    release_date: "2006-06-16",
    lyrics: `妳好喜歡看我眼睛 妳說是宇宙的縮影
只要沒有分離 天氣晴 能看見星星
我努力愛妳寵妳調整自己

我是鄰居還是伴侶 時間帶來殘忍結局
在愛情的隔壁住友情 界線太銳利
對不起 就一刀切開所有親密

眼底星空 流星開始墜落
每一滴眼淚說著妳要好好走
轉過身跌入黑洞
看著天長地久變兩種漂泊
男人流淚比流血加倍心痛

眼底星空 流星跌落手中
我緊緊握著抬頭向上天祈求
願妳先找到溫柔
有人包紮傷口也擋住寂寞
謝謝妳陪我陪愛 聽雨追風

用三年去維繫感情
用三秒鐘結束關係
剩回憶能回去能溫習能把妳抱緊
就算愛燒成灰燼揚起變烏雲

眼底星空 流星開始墜落
每一滴眼淚說著妳要好好走
轉過身跌入黑洞
看著天長地久變兩種漂泊
男人流淚比流血加倍心痛

眼底星空 流星跌落手中
我緊緊握著抬頭向上天祈求
願妳先找到溫柔
有人包紮傷口也擋住寂寞
謝謝妳陪我陪愛 聽雨追風

眼底星空 流星跌落手中
我緊緊握著抬頭向上天祈求
願妳先找到溫柔
有人包紮傷口也擋住寂寞
謝謝妳陪我陪愛 聽雨追風
謝謝他給你給愛另一個星空`,
    image: "images/1761398510024-372984475.jpg",
    original_artist: [],
    language: "中文",
    genre: "流行",
    rating: ""
  },
  {
    id: "song1761400415583",
    title: "醉赤壁",
    creators: ["林俊傑"],
    lyricist: ["方文山"],
    composer: ["林俊傑"],
    albums: "JJ陸",
    release_date: "2016-01-08",
    lyrics: `落葉堆積了好幾層 而我踩過青春 聽見 前世誰在淚語紛紛
一次緣分結一次繩 我今生還在等 一世 就只能有一次的認真

確認過眼神 我遇上對的人 我揮劍轉身而鮮血如紅唇
前朝記憶渡紅塵 傷人的不是刀刃 是 妳轉世而來的魂
確認過眼神 我遇上對的人 我策馬出征 馬蹄聲如淚奔

青石板上的月光照進這山城
我一路的跟 妳輪迴聲 我對妳用情極深


洛陽城旁的老樹根 像回憶般延伸 妳問 經過是誰的心跳聲
我拿醇酒一罈飲恨 妳那千年眼神 是我 醉醉墜入赤壁的 傷痕

確認過眼神 我遇上對的人 我揮劍轉身而鮮血如紅唇
前朝記憶渡紅塵 傷人的不是刀刃 是妳轉世而來的魂
確認過眼神 我遇上對的人 我策馬出征 馬蹄聲如淚奔

青石板上的月光照進這山城
我一路的跟 妳輪迴聲 我對妳用情極深

確認過眼神 我遇上對的人 我策馬出征 馬蹄聲如淚奔
青石板上的月光照進這山城
我一路的跟 妳輪迴聲 我對妳用情極深
我一路的跟 妳輪迴聲 我對妳用情極深`,
    image: "images/1761400415580-759445574.jpg",
    original_artist: [],
    language: "中文",
    genre: "流行",
    rating: ""
  },
  {
    id: "song1761403952320",
    title: "年少的我們永遠輕狂",
    creators: ["Crispy脆樂團"],
    lyricist: ["盧羿安", "丁律妏"],
    composer: ["盧羿安", "丁律妏"],
    albums: "願你愛自己，像我愛你一樣",
    release_date: "2024-04-12",
    lyrics: `別害怕
我願意用青春來交換
別說話
我不會放任淚水留下
你美麗臉龐

年少的我們永遠輕狂
年少的我們遍體鱗傷
年少的我們不曾遺忘 啊

我還記得 奮不顧身的自己
也還記得 奮不顧身的你
如果時間 偷走年少的回憶
讓我記得你 身邊的你
萬分感激 至少還有你

別逞強
你還是會感覺到 痛吧
別說謊
如果傷口 是愛的偽裝
就讓我受傷

年少的我們永遠輕狂
年少的我們遍體鱗傷
年少的我們不曾遺忘
最傻的願望

我還記得 奮不顧身的自己
也還記得 奮不顧身的你
如果時間 偷走年少的回憶
讓我記得你 身邊的你
萬分感激 至少還有你 Woah

年少的我們愛過恨過 不怕痛
堅強的少年哭著笑著 愛作夢
用盡 一 生 用盡 一 生

年少的我們永遠輕狂
年少的我們遍體鱗傷
年少的我們 不懂遺忘
是最美的悲傷

我忘記了 奮不顧身的自己
也忘記了 奮不顧身的你
如果生命 終究不留下痕跡
慢慢被忘記 也不可惜
是因為你 是因為相遇
萬分感激 曾經是我和你

年少的我們永遠輕狂

年少的我們永遠輕狂`,
    image: "images/1761403952317-158559985.jpeg",
    original_artist: [],
    language: "中文",
    genre: "獨立音樂",
    rating: ""
  },
  {
    id: "song1761404603805",
    title: "星星",
    creators: ["公館青少年 GGteens"],
    lyricist: ["廖于任"],
    composer: ["廖于任"],
    albums: "我其實一點都不酷",
    release_date: "2023-05-12",
    lyrics: `這段劇情 不知是第幾次你
還不想放棄 的哭泣
我很愛你 但我不知道要怎麼面對你
看你失去 不知怎麼為你打氣

看天上的星星不停的閃爍
卻不知道他們每顆叫做什麼
身陷迷霧之中
擔心著以後
一次次失足也一遍遍跌落
好像已經忘了成功是什麼
但路還很長也還好久
辛苦但也要 撐過

（看天上的星星 是否能是我）

看天上的星星不停的閃爍
卻不知道他們每顆叫做什麼
撐過迷霧之後
也要繼續走

想要被記住在這星空的河流
卻也知道路還很長也還好久
不需想太多 也不需什麼
繼續向前就足夠

（也很足夠了）
（就繼續往前了）
（都會過去的）`,
    image: "images/1761404603802-752593418.jpg",
    original_artist: [],
    language: "中文",
    genre: "獨立音樂",
    rating: ""
  },
  {
    id: "song1761405050233",
    title: "團長",
    creators: ["芒果醬"],
    lyricist: ["郭佐治"],
    composer: ["郭佐治"],
    albums: "新·寶島少年？",
    release_date: "2022-06-30",
    lyrics: `六月三十日 沒雲沒雨 安靜的暗暝
花的香味 親像你猶原踮我身邊
咱相愛的心 要對抗全世界的决定
為何事到如今 只剩海湧的傷心

忘記你 忘記你
今夜就別再哭泣
為何相愛的人 沒有相愛的勇氣
啊⋯ 如果可以 願我沒遇見你

忘記你 忘記你
今夜就別再哭泣
為何相愛的人 沒有相愛的勇氣
啊⋯ 如果可以 願我沒遇見你

天公伯啊 你敢知阮相愛的心情
你敢知影 阮今夜的孤單
天公伯啊 你敢知阮愛到很心痛
思念的歌 也越唱越軟汫

忘記你 忘記你
今夜就別再哭泣
為何相愛的人 沒有相愛的勇氣

啊⋯ 如果可以願我沒遇見你

六月三十日
沒雲沒雨
安靜的暗暝`,
    image: "images/1761405050230-345540963.jpg",
    original_artist: [],
    language: "中文",
    genre: "獨立音樂",
    rating: ""
  },
  {
    id: "song1761409071147",
    title: "但 Damn",
    creators: ["草東沒有派對"],
    lyricist: ["草東沒有派對"],
    composer: ["草東沒有派對"],
    albums: "瓦合",
    release_date: "2023-05-20",
    lyrics: `你說你不想在這裡 我也不想在這裡
但天黑的太快想走早就來不及
喔 我愛你 可惜關係變成沒關係
問題是沒問題
於是我們繼續

拿著筆想寫點東西
以為是武器能伸張正義
沒人理也沒關係
至少我還有你
至少我還有
你說你不想在這裡 我也不想在這裡
但天黑的太快想走早就來不及
喔我愛你 可惜關係變成沒關係
問題是沒問題
於是我們繼續

喔 我愛你 那些問題我都沒關係
但你離開了這裡
於是我們不再年輕`,
    image: "images/1761409071145-377159670.jpg",
    original_artist: [],
    language: "中文",
    genre: ["獨立音樂", "搖滾"],
    rating: ""
  },
  {
    id: "song1761410241243",
    title: "レオ",
    creators: ["優里"],
    lyricist: ["優里"],
    composer: ["優里"],
    albums: "壱",
    release_date: "2022-01-12",
    lyrics: `ショーケースの中過ごしていた
syo- ke-su no naka sugoshi te i ta
在玻璃櫥櫃中度過

誰もかれもが過ぎ去っていた
dare mo ka re mo ga sugi satte i ta
無論是誰都從我眼前經過

怖かったんだ　あの日君に
kowakatta n da     a no hi kimi ni
感到害怕不已　直到那天

連れられるまでは
tsure ra re ru ma de wa
被你帶去為止


僕と同じの小さな手
boku to onaji no chiisana te
跟我一樣小小的手

転げまわり　くすぐりあう僕ら
koroge ma wa ri     ku su gu ri a u boku ra
滾來滾去　互相搔癢的我們

こんなに君の事好きになってた
ko n na ni kimi no koto suki ni natte ta
變得如此地喜歡著你


どんな時でも傍に居て
do n na toki de mo soba ni ite
「無論何時都待在我的身旁吧」

君が言うなら　ああ
kimi ga iu na ra     a a
如果你這麼說的話　啊啊


名前はレオ　名前呼んでよ
namae wa reo     namae yonde yo
我的名字是雷歐　呼喊我的名字吧

君がつけてくれた名前だから
kimi ga tsu ke te ku re ta namae da ka ra
因為這是你為我取的名字啊

嬉しい時も悲しい時も
ureshi i toki mo kanashi i toki mo
開心時也好悲傷時也罷

傍に居ると決めた大事な人
soba ni iru to kime ta daiji na hito
你是我決定了會待在身旁的重要之人


君が大きくなるほどに
kimi ga ooki ku na ru ho do ni
你長得越大

僕との時間は減るが道理
boku to no jikan wa heru ga douri
與我的時間便會減少　這是理所當然

遠くに君の友達同士
tooku ni kimi no tomodachi doushi
你的朋友存在於遠方

仕方がないよなぁ
shikata ga na i yo naa
無可奈何對吧


最近つけるその香水
saikin tsu ke ru so no kousui
最近擦上的那瓶香水

鼻の利く僕にとっては辛いや
hana no kiku boku ni totte wa tsurai ya
對鼻子很靈的我來說很難受啊

今日も帰りは遅くなるんだろうか
kyou mo kaeri wa osoku na ru n da ro u ka
今天也會晚回來對吧


君が居ない部屋　夢を見る
kimi ga inai heya     yume wo miru
在你不在的房間裡　做夢

あの日のこと　また
a no hi no ko to     ma ta
那一天的事情　再次


名前はレオ　名前呼んでよ
namae wa reo     namae yonde yo
我的名字是雷歐　呼喊我的名字吧

君がつけてくれた名前だから
kimi ga tsu ke te ku re ta namae da ka ra
因為這是你為我取的名字啊

寂しいけれど　悲しいけれど
sabishi i ke re do     kanashi i ke re do
雖然感到寂寞　雖然感到悲傷

傍に居ると決めた大事な人
soba ni iru to kime ta daiji na hito
但你是我決定了會待在身旁的重要之人


君が誰かと暮らすことを
kimi ga dare ka to kurasu ko to wo
在回來的夜晚裡撫摸著我

伝えに帰ってきた夜に
tsutae ni kaette ki ta yoru ni
並告訴了我

撫でてくれたね　きっとお別れだね
nade te ku re ta ne     kitto owakare da ne
你和誰一起生活　這一定就是別離對吧

最後にさ　会えたから
saigo ni sa     ae ta ka ra
因為能在最後　相見呢

ねぇ幸せだよ
nee shiawase da yo
吶我好幸福啊


名前はレオ　名前呼んでよ
namae wa reo     namae yonde yo
我的名字是雷歐　呼喊我的名字吧

君がつけてくれた名前だから
kimi ga tsu ke te ku re ta namae da ka ra
因為這是你為我取的名字啊

もう泣かないでよ　名前呼んでよ
mo u nakanai de yo     namae yonde yo
請不要再哭泣了　呼喊我的名字吧

あの日より大きな手で撫でてくれた
a no hi yo ri ooki na te de nade te ku re ta
你用比那一天還要巨大的手撫摸了我


名前はレオ　名前呼んでよ
namae wa reo     namae yonde yo
我的名字是雷歐　呼喊我的名字吧

君がくれた名前で良かったよ
kimi ga ku re ta namae de yokatta yo
你給我的名字真是太好了

忘れないでよ　それでいいんだよ
wasure na i de yo     so re de i i n da yo
請不要忘了　這樣就好了

新しい誰かにまた名前つけて
atarashi i dare ka ni ma ta namae tsu ke te
再次為新的某人取上名字

中文翻譯：月勳`,
    image: "images/1761410241240-46984163.jpeg",
    original_artist: [],
    language: "日文",
    genre: "流行",
    rating: ""
  },
  {
    id: "song1761410751908",
    title: "ドライフラワー",
    creators: ["優里"],
    lyricist: ["優里"],
    composer: ["優里"],
    albums: "壱",
    release_date: "2020-10-25",
    language: "日文",
    genre: "流行",
    lyrics: `多分、私じゃなくていいね
tabun, watashi jya na ku te i i ne
我想、如果不是我的話就好了呢

余裕のない二人だったし
yoyuu no na i futari datta shi
我們的感情是如此地緊張

気付けば喧嘩ばっかりしてさ
kizuke ba kenka bakka ri shi te sa
當我們回過神時也只是一直在吵著架

ごめんね
go men ne
對不起


ずっと話そうと思ってた
zutto hanasou to omotte ta
長期以來我一直想說出口

きっと私たち合わないね
kitto watashi ta chi awana i ne
我們一定很合不來呢

二人きりしかいない部屋でさ
futari ki ri shi ka i na i heya de sa
你一直在只有我們兩個人的房間裡

貴方ばかり話していたよね
anata ba ka ri hanashi te i ta yo ne
侃侃而談呢


もしいつか何処かで会えたら
mo shi i tsu ka doko ka de ae ta ra
如果有一天我在其他地方見到你

今日の事を笑ってくれるかな
kyou no koto wo waratte ku re ru ka na
你是否會笑談著今天發生的事情呢

理由もちゃんと話せないけれど
riyuu mo cyan to hanase na i ke re do
雖然我無法告訴你具體的原因

貴方が眠った後に泣くのは嫌
anata ga nemutta ato ni naku no wa iya
但我討厭在你入睡後哭泣啊


声も顔も不器用なとこも
koe mo kao mo bukiyou na to ko mo
你的聲音、臉、笨拙的地方

全部全部　嫌いじゃないの
zenbu zenbu     kirai jya na i no
我並不是　什麼都討厭啊

ドライフラワーみたい
dorai furawa- mi ta i
就像乾燥花一樣

君との日々もきっときっときっときっと
kimi to no hibi mo kitto kitto kitto kitto
我相信我和你在一起的日子也一定一定一定一定會

色褪せる
iro ase ru
慢慢褪色


多分、君じゃなくてよかった
tabun, kimi jya na ku te yo katta
我想、如果不是你的話就好了呢

もう泣かされることもないし
mo u nakasare ru ko to mo na i shi
這樣我也不會被你弄到哭泣了

「私ばかり」なんて言葉も
"watashi ba ka ri" na n te kotoba mo
就連「都是我」之類的話

なくなった
na ku natta
都會消失不見


あんなに悲しい別れでも
a n na ni kanashi i wakare de mo
即使是如此悲傷的告別

時間がたてば忘れてく
jikan ga ta te ba wasure te ku
隨著時間流逝　我便會逐漸遺忘

新しい人と並ぶ君は
atarashi i hito to narabu kimi wa
與新的人並肩站在一起的你

ちゃんとうまくやれているのかな
cyan to u ma ku ya re te i ru no ka na
是否能夠好好地處在一起呢


もう顔も見たくないからさ
mo u kao mo mi ta ku na i ka ra sa
我已經不想再看見你了啊

変に連絡してこないでほしい
hen ni renraku shi te ko na i de ho shi i
也希望你不要再奇怪地聯繫我

都合がいいのは変わってないんだね
tsugou ga i i no wa kawatte na i n da ne
你只有自私這一點是不會改變的吧

でも無視できずにまた少し返事
de mo mushi de ki zu ni ma ta sukoshi henji
但是我卻無法忽略　又再次回覆了一下


声も顔も不器用なとこも
koe mo kao mo bukiyou na to ko mo
你的聲音、臉、笨拙的地方

多分今も　嫌いじゃないの
tabun ima mo     kirai jya na i no
或許我現在　仍然不討厭你啊

ドライフラワーみたく
dorai furawa- mi ta ku
就像乾燥花一樣

時間が経てば
jikan ga tate ba
隨著時間流逝

きっときっときっときっと色褪せる
kitto kitto kitto kitto iro ase ru
就一定一定一定一定會慢慢褪色


月灯りに魔物が揺れる
tsuki akari ni mamono ga yure ru
妖魔鬼怪在月光下搖擺

きっと私もどうかしてる
kitto watashi mo do u ka shi te ru
我一定也發瘋了吧

暗闇に色彩が浮かぶ
kura yami ni shikisai ga ukabu
色彩在黑暗裡浮現而出


赤黄藍色が胸の奥
aka ki ai iro ga mune no oku
紅黃藍色在內心深處

ずっと貴方の名前を呼ぶ
zutto anata no namae wo yobu
一直呼喊著你的名字

好きという気持ち
suki to i u kimochi
名叫「喜歡」的心情

また香る
ma ta kaoru
再次散發著香氣


声も顔も不器用なとこも
koe mo kao mo bukiyou na to ko mo
你的聲音、臉、笨拙的地方

全部全部　大嫌いだよ
zenbu zenbu     daikirai da yo
我超級討厭　這所有一切

まだ枯れない花を
ma da kare na i hana wo
我再次給你戴上了

君に添えてさ
kimi ni soe te sa
還未凋謝的花

ずっとずっとずっとずっと
zutto zutto zutto zutto
請你一直一直一直一直

抱えてよ
kakae te yo
緊抱在懷裡

中文翻譯：月勳`,
    image: "images/1761410751906-450198204.jpeg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761410948394",
    title: "安平之光",
    creators: ["イルカポリス 海豚刑警"],
    lyricist: ["伍悅"],
    composer: ["伍悅"],
    albums: "豚愛特攻隊",
    release_date: "2019-06-19",
    language: "中文",
    genre: "獨立",
    lyrics: `獻給整個悲天憫⼈的台北
烏煙瘴氣的
想⾒到的⼈都不在這裡
不在這裡 我在這裡

在沒有你的城市聽你的聲⾳
你的味道在我腦袋搖晃呼吸
世界不再以比較級的⽅式運作
風吹著就能想像⼀起沿著海岸線
你的氣息 ⾃由的散去

騎在安平的郊區 沒有時間和意義
⼀直走 ⼀直走 直到星星墜落
唱著深夜folk song
我們活在
過去未來⼀起運送過來的同⼀個腦袋
不必花多餘的⼒氣感受
穿著雨衣滂沱的海邊

來不及就說聲再⾒
此刻的靈魂喧囂再也看不清界線
卑鄙的社會已經再也不⽤去⾯對
敬我們製造出來的那混亂空間
天⾊已經...

騎在安平的郊區 沒有時間和意義
⼀直走 ⼀直走 直到星星墜落
唱著深夜folk song
我們活在
過去未來⼀起運送過來的同⼀個腦袋

沒有駕照唱著歌的黃⾦海岸邊
會讓夏天消逝的不知不覺
現在就從頭忘記 那些渾渾噩噩的過去
世界不必再轉動 你就是我的soul train
夕陽⼀把交給所有時間換舊

不必花多餘的⼒氣感受
穿著雨衣滂沱的海邊`,
    image: "images/1761410948391-644646746.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761495770027",
    title: "突然好想你",
    creators: ["五月天"],
    lyricist: ["阿信"],
    composer: ["阿信"],
    albums: "後青春期的詩",
    release_date: "2008-10-23",
    language: "中文",
    genre: "流行",
    lyrics: `最怕空氣突然安靜 最怕朋友突然的關心
最怕回憶 突然翻滾絞痛著不平息 最怕突然 聽到你的消息
想念如果會有聲音 不願那是悲傷的哭泣
事到如今 終於讓自己屬於我自己 只剩眼淚 還騙不過自己

突然好想你 你會在哪裡 過得快樂或委屈
突然好想你 突然鋒利的回憶 突然模糊的眼睛

我們像一首最美麗的歌曲 變成兩部悲傷的電影
為什麼你 帶我走過最難忘的旅行 然後留下 最痛的紀念品

我們 那麼甜那麼美那麼相信 那麼瘋那麼熱烈的曾經
為何我們還是要奔向各自的幸福和遺憾中老去

突然好想你 你會在哪裡 過得快樂或委屈
突然好想你 突然鋒利的回憶 突然模糊的眼睛

最怕空氣突然安靜 最怕朋友突然的關心
最怕回憶 突然翻滾絞痛著不平息 最怕突然 聽到你的消息

最怕此生 已經決心自己過沒有你 卻又突然 聽到你的消息`,
    image: "images/1761495769429-702589751.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761497627494",
    title: "太陽與地球",
    creators: ["盧廣仲"],
    lyricist: ["黄俊荣", "吳易緯"],
    composer: ["黄俊荣", "林倛玉"],
    albums: "HeartBreakFast 傷心早餐店",
    release_date: "2025-09-17",
    language: "中文",
    genre: "流行",
    lyrics: `想 守護你所有
回應你 包容的溫柔
想用盡一生 陪在你左右 是我
曙光和暮暉的 夢
短暫如煙火 在懷裡墜落
奔向了星空 到不了心中
有什麼理由 必須要我放手

誰要 我們的心 遙遠得像 太陽與地球
怎會 走到最後 你愛著我 卻不屬於我
誰要 時間奔走 只能照耀 再不能觸碰
最靠近的我們 怎麼 繞著 繞著 就錯過

在 偌大銀河中
沒想過 像流星交錯
該怎麼原諒 讓你哭的人 是我
抱歉沒有機會 說
最渴望的夢 是你在等我
轟烈在星空 消散在心中
最難忘的人 是永恆地錯過

誰要 我們的心 遙遠得像 太陽與地球
怎麼 走到最後 你愛著我 卻不屬於我
誰要 時間奔走 只能照耀 再不能觸碰
最靠近的我們 怎麼 繞著 繞著 各自走

人總要狠狠痛過 才懂我要什麼
捨不得 你不再快樂
如果悲傷 請你留給我
原來 我們的心 頑固地像 太陽與地球
以為 徹底分開 徹底放手 不曾離開過
我們 只是錯過 誰都沒錯 都努力愛過
最遙遠的我們 別回頭 往幸福 一直走`,
    image: "images/1761497627493-592594290.jpg",
    original_artist: ["黃俊榮"],
    rating: ""
  },
  {
    id: "song1761544590825",
    title: "不要在一起",
    creators: ["盧廣仲"],
    lyricist: ["吳鎮安"],
    composer: ["吳鎮安"],
    albums: "HeartBreakFast 傷心早餐店",
    release_date: "2025-09-17",
    language: "中文",
    genre: "流行",
    lyrics: `睜開眼 怎麼又是十二點
打開手機原來昨晚聊了一整夜
看著那句未讀的晚安泡著咖啡
天啊到底為什麼還沒有回

差一點 好像就近在眼前
怎麼怎麼就是不想跨過那條線
每晚夢裡都不知道排練過幾遍
擔心這些 都是自我催眠

能不能不要在一起 讓我繼續想著你
維持這樣的關係 就算只能待在家裡 我也願意

能不能不要在一起 就怕會壞了這關係
我可以忍著這次情緒 等著下一次天晴
一起看星星

差一點 好像就近在眼前
怎麼怎麼就是不想跨過那條線
每晚夢裡都不知道排練過幾遍
你出現 又不想去面對

去面對 被你拒絕的世界
一直小心作答的考卷 會不會在這一題瓦解
去面對 真不想錯過又等三年
每一天 都有那 一瞬間 偷偷發出訊息又收回

能不能不要在一起 讓我繼續想著你
維持這樣的關係 就算只能待在家裡 我也願意

能不能不要在一起 就怕會壞了這關係
我可以忍著這次情緒 等著下一次天晴
一起看星星

要不要不要不要不 跟我在一起
要不要不要不要不 跟我在一起
要不要不要不要不 跟我在一起

要不就跟我在一起 讓我繼續想著你
維持這樣的關係 再等著 下一次天晴 一起看星星`,
    image: "images/1761544590823-412649225.jpg",
    original_artist: ["吳鎮安"],
    rating: ""
  },
  {
    id: "song1761565779906",
    title: "偷偷愛",
    creators: ["美秀集團"],
    lyricist: ["修齊"],
    composer: ["修齊"],
    albums: "美秀集團同名專輯",
    release_date: "2024-09-30",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `天空有時會 想起那一年的倦
隨風兒消遣 彷彿不曾掉眼淚
捲起的歲月 潮濕卻很香甜
將你無聲吹遠

你的航班沒有延後 而我如期地錯過
飛航模式把訊息清空 遁入白晝
我入秋 你在春天的南半球
倘若弄丢了鄉愁
你說家的輪廓 依舊混濁 一如我害怕漂泊
我開口卻只能吐出沉默

看著你 我武裝情感你無法猜透
偷偷愛 用友情包覆著我的怯懦
幻想著 你有天會對我心動
你的一顰一笑 一舉一動 能否給我

或許再念舊 也只能遷就
隨時間淹沒 記憶剝落了臉孔
退後的脆弱 罪咎與墜落
執著的最後 回頭沒有誰對誰錯
你一無反顧奔向陌生的世界
選擇今天的你拋下我顧後而瞻前
你的微笑還是遙遠

看著你 我武裝情感你無法猜透
偷偷愛 用友情包覆著我的怯懦
幻想著 你有天會對我心動
而你牽著的手 是對是錯 或是遷就
看著你 無話不說卻也不能再多
偷偷愛 再苦笑著把自己給騙過
幻想著 你有天會對我心動
你的一顰一笑 一舉一動 能否給我

看著你 我武裝情感你無法猜透
偷偷愛 用友情包覆著我的怯懦
幻想著 你有天會對我心動
而你牽著的手 是對是錯 或是遷就
看著你 無話不說卻也不能再多
偷偷愛 再苦笑著把自己給騙過
幻想著 你有天會對我心動
你的一顰一笑 一舉一動 能否給我`,
    image: "images/1761565779681-471437153.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761566727270",
    title: "愛情的大壞蛋",
    creators: ["美秀集團"],
    lyricist: ["修齊"],
    composer: ["修齊"],
    albums: "美秀集團同名專輯",
    release_date: "2024-09-30",
    language: "中文",
    genre: "流行",
    lyrics: `我在情歌的尾奏 落在琴聲的最後
活該今生的罪疚 默哀硬撐著淚流
想要夢見你 重建你 容顏已走遠
在不真實的空間裡好好再愛一遍

或許這就是所謂心痛
或許我不曾真的心痛
或許這次我認真了 這次是真的愛了

就當作我是愛情的大壞蛋 不需要你原諒我
背後為你流的淚 就當我自作自受
就因為我是愛情的大壞蛋 愛情的小偷
請忘記我 讓我寂寞

今晚沒夢見你 是因為睡不著
情節像爛電影 而我不是主角
看著剪影出竅 你走遠聽不到
我只能抽著菸 兜著圈 收著淚 又一遍畫夜
我會把你的故事折成紙鶴
讓他飛到銀河
不再唱為你寫的歌 反正你不會聽了
我是真的不愛了

就當作我是愛情的大壞蛋 不需要你原諒我
背後為你流的淚 就當我自作自受
就因為我是愛情的大壞蛋 愛情的小偷
請忘記我 讓我寂寞

我在情歌的尾奏 落在琴聲的最後
活該今生的罪疚 默哀硬撐著淚流
想要夢見你 重建你 容顏已走遠
在不真實的空間裡好好再愛一遍

今晚我摧毀了最美的未曾愛過
儘管我卑微的淚水徹夜碎成敗破
就當我沒愛過 就當我沒愛過
我不配你愛我 我不配你愛我

我會把你的故事折成紙鶴
讓他飛到銀河
就當我沒愛過 就當我沒愛過
我不配你愛我 我不配你愛我`,
    image: "images/1761566727091-289871404.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761566893381",
    title: "我懷念的",
    creators: ["孫燕姿"],
    lyricist: ["姚若龍"],
    composer: ["李偲菘"],
    albums: "逆光",
    release_date: "2007-03-22",
    language: "中文",
    genre: "流行",
    lyrics: `我問為什麼 那女孩傳簡訊給我
而你為什麼 不解釋低著頭沉默
我該相信你很愛我 不願意敷衍我
還是明白你已不想挽回什麼

想問為什麼 我不再是你的快樂
可是為什麼 卻苦笑說我都懂了
自尊常常將人拖著 把愛都走曲折
假裝了解是怕 真相太赤裸裸
狼狽比失去難受

我懷念的 是無話不說
我懷念的 是一起作夢
我懷念的 是爭吵以後還是想要愛你的衝動
我記得那年生日 也記得那一首歌
記得那片星空 最緊的右手 最暖的胸口
誰記得 誰忘了

想問為什麼 我不再是你的快樂
可是為什麼 卻苦笑說我都懂了
自尊常常將人拖著 把愛都走曲折
假裝了解是怕 真相太赤裸裸
狼狽比失去難受

我懷念的 是無話不說
我懷念的 是一起作夢
我懷念的 是爭吵以後還是想要愛你的衝動
我記得那年生日 也記得那一首歌
記得那片星空 最緊的右手 最暖的胸口
誰忘了

我懷念的 是無言感動
我懷念的 是絕對熾熱
我懷念的 是你很激動求我原諒抱得我都痛
我記得你在背後 也記得我顫抖著
記得感覺洶湧 最美的煙火 最長的相擁

誰愛得太自由
誰過頭太遠了
誰要走我的心
誰忘了那就是承諾
誰自顧自地走
誰忘了看著我
誰讓愛變沉重
誰忘了要給你溫柔

(我懷念的)

我還有想要愛你的衝動
我記得那年生日 也記得那一首歌
記得那片星空 最緊的右手 最暖的胸口

我放手 我讓座 假灑脫
誰懂我多麼不捨得
太愛了 所以我
沒有哭 沒有說`,
    image: "images/1761566893258-815064893.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761567286778",
    title: "ベテルギウス",
    creators: ["優里"],
    lyricist: ["優里"],
    composer: ["優里"],
    albums: "ベテルギウス",
    release_date: "2021-11-04",
    language: "日文",
    genre: "流行",
    lyrics: `空(そら)にある何(なに)かを見(み)つめてたら
sora ni a ru nani ka wo mi tsu me te ta ra
當仰望著天空裡的存在

それは星(ほし)だって君(きみ)がおしえてくれた
so re wa hoshi da t te kimi ga o shi e te ku re ta
你就會告訴我那是星星

まるでそれは僕(ぼく)らみたいに　寄(よ)り添(そ)ってる
ma ru de so re wa baku ra mi ta i ni   yo ri so t te ru
那就像是我們兩個一樣　相依相靠

それを泣(な)いたり笑(わら)ったり繋(つな)いでいく
so re wo na i ta ri wara t ta ri tsuna i de i ku
為此哭著笑著彼此聯繫在一起


何十回(なんじゅっかい)　何百回(なんびゃっかい)　ぶつかりあって
nan juu k kai   nan bya k kai   bu tsu ka ri a t te 
幾十次　幾百次的　相互撞擊著

何十年(なんじゅうねん)　何百年(なんびゃくねん)　昔(むかし)の光(ひかり)が
nan juu nen   nan byaku nen   mukashi no hikari ga
幾十年　幾百年的　過去發出的光芒

星(ほし)自身(じしん)も忘(わす)れたころに
hoshi jishin mo wasu re ta ko ro ni
在星星自己都忘記的那個時候

僕(ぼく)らに届(とど)いてる
boku ra ni todo i te ru
才傳遞到我們身邊


僕(ぼく)ら見(み)つけあって　手繰(たぐ)りあって
boku ra mi tsu ke a t te   tagu ri a t te
我們找到彼此　彼此拉近

同(おな)じ空(そら)　
ona ji sora
在同片天空下

輝(かがや)くのだって　二人(ふたり)だって
kagaya ku no da t te   futari da t te
是多麽閃耀　是兩個人

約束(やくそく)した
yakusoku shi ta
所做下的約定

遥(はる)か遠(とお)く終(お)わらないベテルギウス
haru ka too ku o wa ra na i beterugiusu
遙遠而沒有盡頭的參宿四

誰(だれ)かに繋(つな)ぐ魔法(まほう)
dare ka ni tsuna gu mahou
是與某個誰聯繫起的魔法

僕(ぼく)ら　肩(かた)並(なら)べ　手取(てと)り合(あ)って
boku ra   kata nara be   teto ri a t te
我們　肩併著肩　手牽著手

進(すす)んでく
susu n de ku
向前邁步前進

辛(つら)い時(とき)だって　泣(な)かないって
tsura i toki da t te   na ka na i t te
就算是痛苦的時候　也不會哭的

誓(ちか)っただろう
chika t ta da ro u
這麼約定過了

遥(はる)か遠(とお)く終(お)わらないベテルギウス
haru ka too ku o wa ra na i beterugiusu
遙遠而沒有盡頭的參宿四

君(きみ)にも見(み)えるだろう　祈(いの)りが
kimi ni mo mi e ru da ro u   ino ri ga
你也有看見的對吧　那祈願


記憶(きおく)を辿(たど)るたび　蘇(よみがえ)るよ
kioku wo tado ru ta bi   yomiga e ru yo
要是試著回憶　就會想起

君(きみ)がいつだってそこに居(い)てくれること
kimi ga i tsu da t te so ko ni i te ku re ru ko to
你不管什麼時候都會待在那裡不會離開

まるでそれは星(ほし)の光(ひかり)と　同(おな)じように
ma ru de so re wa hoshi no hikari to   ona ji yo u ni
那樣就彷彿是星星的光一樣

今日(きょう)に泣(な)いたり笑(わら)ったり繋(つな)いでいく
kyou ni na i ta ri wara t ta ri tsuna i de i ku
在今天哭著笑著彼此聯繫在一起


何十回(なんじゅっかい)　何百回(なんびゃっかい)　ぶつかりあって
nan juu k kai   nan bya k kai   bu tsu ka ri a t te 
幾十次　幾百次的　相互撞擊著

何十年(なんじゅうねん)　何百年(なんびゃくねん)　昔(むかし)の光(ひかり)が
nan juu nen   nan byaku nen   mukashi no hikari ga
幾十年　幾百年的　過去發出的光芒

僕(ぼく)自身(じしん)も忘(わす)れたころに
boku jishin mo wasu re ta ko ro ni
在我們自己都忘掉的時候

僕(ぼく)らを照(て)らしてる
boku ra wo te ra shi te ru
照亮我們


僕(ぼく)ら見(み)つけあって　手繰(たぐ)りあって
boku ra mi tsu ke a t te   tagu ri a t te
我們找到彼此　彼此拉近

同(おな)じ空(そら)　
ona ji sora
在同片天空下

輝(かがや)くのだって　二人(ふたり)だって
kagaya ku no da t te   futari da t te
是多麽閃耀　是兩個人

約束(やくそく)した
yakusoku shi ta
所做下的約定

遥(はる)か遠(とお)く終(お)わらないベテルギウス
haru ka too ku o wa ra na i beterugiusu
遙遠而沒有盡頭的參宿四

誰(だれ)かに繋(つな)ぐ魔法(まほう)
dare ka ni tsuna gu mahou
是與某個誰聯繫起的魔法


どこまで　いつまで　生(い)きられるか
do ko ma de   i tsu ma de   i ki ra re ru ka
能到哪裡　能到何時　活在世界上呢

君(きみ)が不安(ふあん)になるたびに強(つよ)がるんだ
kimi ga fuan ni na ru tabi ni tsuyo ga ru n da
當你感到不安的時候就會故作堅強

大丈夫(だいじょうぶ)　僕(ぼく)が横(よこ)にいるよ
daijoubu   boku ga yoko ni i ru yo
沒事啊　有我在你身邊

見(み)えない線(せん)を繋(つな)ごう
mi e na i sen wo tsuna go u
聯繫起看不見的線吧


僕(ぼく)ら見(み)つけあって　手繰(たぐ)りあって
boku ra mi tsu ke a t te   tagu ri a t te
我們找到彼此　彼此拉近

同(おな)じ空(そら)　
ona ji sora
在同片天空下

輝(かがや)くのだって　二人(ふたり)だって
kagaya ku no da t te   futari da t te
是多麽閃耀　是兩個人

約束(やくそく)した
yakusoku shi ta
所做下的約定

遥(はる)か遠(とお)く終(お)わらないベテルギウス
haru ka too ku o wa ra na i beterugiusu
遙遠而沒有盡頭的參宿四

誰(だれ)かに繋(つな)ぐ魔法(まほう)
dare ka ni tsuna gu mahou
是與某個誰聯繫起的魔法


僕(ぼく)ら　肩(かた)並(なら)べ　手取(てと)り合(あ)って
boku ra   kata nara be   teto ri a t te
我們　肩併著肩　手牽著手

進(すす)んでく
susu n de ku
向前邁步前進

辛(つら)い時(とき)だって　二人(ふたり)だって
tsura i toki da t te   futari da t te
就算是痛苦的時候　也是兩個人

誓(ちか)っただろう
chika t ta da ro u
這麼約定過了

遥(はる)か遠(とお)く終(お)わらないベテルギウス
haru ka too ku o wa ra na i beterugiusu
遙遠而沒有盡頭的參宿四

君(きみ)にも見(み)えるだろう　祈(いの)りが
kimi ni mo mi e ru da ro u   ino ri ga
你也有看見的對吧　那祈願


空(そら)にある何(なに)かを見(み)つめてたら
sora ni a ru nani ka wo mi tsu me te ta ra
當仰望著天空裡的存在時

それは星(ほし)だって君(きみ)がおしえてくれた
so re wa hoshi da t te kimi ga o shi e te ku re ta
你告訴我那些是星星啊

中文翻譯：凜玥`,
    image: "images/1761567286685-621469619.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761567896370",
    title: "愛我別走",
    creators: ["張震嶽"],
    lyricist: ["張震嶽"],
    composer: ["張震嶽"],
    albums: "秘密基地",
    release_date: "1988-12-11",
    language: "中文",
    genre: "流行",
    lyrics: `我到了這個時候還是一樣
夜裡的寂寞容易叫人悲傷
我不敢想的太多 因為我一個人
迎面而來的月光拉長身影
漫無目的地走在冷冷的街
我沒有妳的消息 因為我在想妳

愛我別走 如果妳說 妳不愛我
不要聽見妳真的說出口
再給我一點溫柔
愛我別走 如果妳說 妳不愛我
不要聽見妳真的說出口
再給我一點溫柔

我到了這個時候還是一樣
夜裡的寂寞容易叫人悲傷
我不敢想的太多 因為我一個人
迎面而來的月光拉長身影
漫無目的地走在冷冷的街
我沒有妳的消息 因為我在想妳
愛我別走 如果妳說 妳不愛我
不要聽見妳真的說出口
再給我一點溫柔
愛我別走 如果妳說 妳不愛我
不要聽見妳真的說出口
再給我一點溫柔


愛我別走 如果妳說 妳不愛我
不要聽見妳真的說出口
再給我一點溫柔
愛我別走 如果妳說 妳不愛我
不要聽見妳真的說出口
再給我一點溫柔`,
    image: "images/1761567896369-16710674.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761568099952",
    title: "手心的薔薇",
    creators: ["林俊傑", "鄧紫棋"],
    lyricist: ["林怡鳳"],
    composer: ["林俊傑"],
    albums: "新地球",
    release_date: "2014-12-27",
    language: "中文",
    genre: "流行",
    lyrics: `妳眼眶超載的眼淚
乘客是絕望和心碎
我可以看見 妳忍住傷悲
那一雙愛笑眼睛不適合皺眉
你目光獨有的溫暖
是不會熄滅的明天
我可以感覺 你沒有說出口的安慰
遠比我失去的更加珍貴
手心的薔薇 刺傷而不自覺
妳值得被疼愛 你懂我的期待
絢爛後枯萎 經過幾個圓缺
有我在（有你在）
你埋藏的薔薇 妳動人的香味
是最好的你 陪我 盼我 接受世界
不完美 另一面 多美
指紋寫下所有遇見
妳留著心碎那一頁
驕傲的展現 妳真無所謂（無所謂）
偶爾放縱的淚像洶湧的海水
我學著一個人存在（I'm here）
關上燈比較不孤單（不讓你孤單）
你給的力量 讓我在夜裡安心入睡（別怕黑夜）
就算沒有人心疼我的淚（有個人心疼妳的淚）
手心的薔薇 刺傷而不自覺
妳值得被疼愛 你懂我的期待
絢爛後枯萎 經過幾個圓缺
有我在（有你在）喔
你埋藏的薔薇 妳動人的香味
是最好的你 陪我 盼我 接受世界
不完美 另一面 多美
手心的薔薇（喔）
是帶刺的紀念（喔）
整理好眼淚 I am here
陪我盼妳（陪你盼我）接受世界
太虛偽 太善變 不完美
天會黑 心會累 耶耶
有我在（有你在）什麼都 無畏
別害怕（握太緊） 放手（薔薇）
傷痕纍纍
這世界 有你 無畏`,
    image: "images/1761568099861-700068373.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761568531950",
    title: "一個人睡著",
    creators: ["盧廣仲"],
    lyricist: ["柏霖"],
    composer: ["柏霖", "江柏翰"],
    albums: "HeartBreakFast 傷心早餐店",
    release_date: "2025-09-17",
    language: "中文",
    genre: "流行",
    lyrics: `從手中退去的溫度
到眼神失去了愛慕
曾衝動挽留什麼
才發現是什麼
讓我們都沉默

每一個寫的旋律 都是告別
不斷的重複著同首 告別的情歌
獨自 唱著

分手那句話 當作祝福吧
也許曾經深愛他 才會有傷疤
從今以後只記住最美好的模樣
最後的擁抱 微笑散場

曾衝動挽留什麼
才發現是什麼
讓我們都沉默

每一個寫的旋律 都是告別
不斷的重複著同首 告別的情歌
獨自 唱著

分手那句話 當作祝福吧
也許曾經深愛他 才會有傷疤
從今以後只記住最美好的模樣
最後的擁抱 微笑散場

看我眼神 也許會知道
這一切還沒結束 未完的樣貌
也許有天 我會 習慣一個人睡著
傷心免不了 願我們都好 願我們都好

分手那句話 當作祝福吧
這一切還沒結束 未完的樣貌
也許有天 我會 習慣一個人睡著
傷心免不了 願我們都好`,
    image: "images/1761568531861-414869412.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761569938673",
    title: "Harmony of Stars",
    creators: ["QWER"],
    lyricist: ["김혜정", "이동혁"],
    composer: ["이동혁", "GESTURE", "Elum", "홍지혜", "이시연"],
    albums: "Harmony from Discord",
    release_date: "2023-10-18",
    language: "韓文",
    genre: "流行",
    lyrics: `조용하게 비춘 별 하나
默默亮起的一顆星星

인사를 건네는 듯해
像是在向我輕輕問候

긴 시간 속 매일 그 자리에
在漫長歲月中 日復一日守著原位

어쩌면 아득히 멀리
也許因為遙不可及

가 있기에 소중한 거라
才顯得格外珍貴

외면하고 있었던 나인데
而我卻一直假裝看不見

발걸음과 발걸음 사이
在每一步之間

쌓여만 간 망설임과 무리란 말
堆積著猶豫與「我是不是太勉強了」的念頭

네가 내 곁에 와주던
直到你出現在我身邊的

순간 전부 사라졌어
那一瞬間 一切都不見了

소란하게 내린 별의 빛
熙攘灑落的星光

그 틈 사이 사이로
從那縫隙間穿透而來

다시 투명히 비친 눈부신
再次清晰映出耀眼的

나만의 꿈의 조각들
專屬於我自己的夢想碎片

너와 함께라는 이유로
因為有你在身邊

운명을 믿어 난
我才願意相信命運

눈 앞에 펼쳐진 미랠 향해 인사를 해
向眼前展開的未來輕聲問候

빛나는 별처럼 (ah, ah, ah)
就像閃耀的星星那樣

빛나는 별처럼 (ah, ah, ah)
就像閃耀的星星那樣

난 아이처럼 혼자선 꼭
我像個孩子 獨自一人時

서투르고 헤매는 걸
總是笨拙又迷惘

잡은 두 손의 온기로
但你溫熱的雙手牽住了我

좀 더 멀리 데려가줘
帶我去那更遙遠的地方吧

소란하게 내린 별의 빛
熙攘灑落的星光

그 틈 사이 사이로
從那縫隙間穿透而來

다시 투명히 비친 눈부신
再次清晰映出耀眼的

나만의 꿈의 조각들
專屬於我自己的夢想碎片

너와 함께라는 이유로
因為有你在身邊

운명을 믿어 난
我才願意相信命運

눈 앞에 펼쳐진 미랠 향해 인사를 해
向眼前展開的未來輕聲問候

빛나는 별처럼
如同那閃閃發亮的星星

내 맘을 다 아는 듯이
你像是讀懂我心一般

지어주는 웃-음이
那溫柔笑容

푸른 새벽 같아서
宛如靜謐深藍的黎明

뭐든 가능할 것 같아
讓我覺得一切都變得可能

가장 빛나는 시작도
不論是最閃耀的開始

찬란해질 내일도
還是光芒萬丈的明天

이제 울지 않아
現在的我 不再流淚了

너와 나로 이어진 별자리
你與我連起的星座

우리만의 하모니
是只屬於我們的和聲

아주 길고 긴 시간 지나도
即使經過無比漫長的時間

반짝일 우릴 테니까
我們依然會閃耀不墜

까만 어둠이 또 온대도
即使黑暗再次降臨

두렵지 않아 난
我也不再害怕

놓치지 않도록 너의 손을 잡아줄게
我會緊緊牽著你的手 不讓你走散

빛나는 별처럼 (ah, ah, ah)
就像閃耀的星星那樣

빛나는 별처럼 (ah, ah, ah)
就像閃耀的星星那樣

빛나는 별처럼 (ah, ah, ah)
就像閃耀的星星那樣`,
    image: "images/1761569938483-591395772.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761573738599",
    title: "留一盞燈給漫漫長夜",
    creators: ["SoulFa 靈魂沙發"],
    lyricist: ["顏鵬軒"],
    composer: ["顏鵬軒"],
    albums: "Slumber Days",
    release_date: "2021-02-22",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `當 世界屏住呼吸
剩下你和自己
總是措手不及
那就任他佔據
你的一點理性
這才放聲哭泣

喔 對著自己說 那不過 是走過一段 難免腳步闌珊
看著你的眼睛
嚮往的風景
只要燈還未熄
一定找到你

當 陽光灑落一地
你卻試著撿起
那破碎的陰影
忘了呼吸
喔 對著自己說 那不過 是走過一段 難免腳步闌珊
看著你的眼睛
嚮往的風景
只要燈還未熄
一定找到你

這馬我為你唱一首歌
這馬你毋免閣再孤單
這馬我為你唱一首歌
這馬你毋免擱再孤單

看著你的眼睛
嚮往的風景
只要燈還未熄
一定找到你`,
    image: "images/1761573738596-125630052.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761573843673",
    title: "幸福的末班車",
    creators: ["TRASH"],
    lyricist: ["阿夜", "魁剛"],
    composer: ["阿夜", "魁剛"],
    albums: "幸福的末班車",
    release_date: "2024-09-13",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `從什麼時候開始
我們已經不再聯絡
滑著彼此的生活卻不再回應

曾為了什麼交錯
結果後來選擇不同
曾經相愛的人也淪為對立

縱使命中注定我們要分別
注定一顆心終究要被撕裂
沒有誰比誰抱歉
總是傷口結痂後又再龜裂
不甘心的在心中許下心願
只希望能回到那一站從前

好想要再次的和你一起
感受那種瘋狂的歡笑
痛哭之後被理解的擁抱
徹夜未眠唱著歌說垃圾話
這樣就能足以感到驕傲(感到驕傲)

若是會當閣予我一改機會
我欲佮你做伙袂閣再管浮華世間的一切
所有的願望早就已無所謂
因為一生只想和你一起
趕上幸福的末班車

有些話總是卡在喉嚨說不出口
彼此猜忌之後見面尷尬無處躲
築起一道名為想得太糟的高牆
還舉起著朝向自己腦袋的刀槍

總是傷口結痂後又再龜裂
不甘心的在心中許下心願
只希望能回到那一站從前

好想要再次的和你一起
感受那種瘋狂的歡笑
痛哭之後被理解的擁抱
徹夜未眠唱著歌說垃圾話
這樣就足以感到驕傲(感到驕傲)

若是會當閣予我一改機會
我欲佮你做伙袂閣再管浮華世間的一切
所有的願望早就已無所謂
因為一生只想和你一起
趕上幸福的末班車

好想要再次的和你一起
感受那種瘋狂的歡笑
痛哭之後被理解的擁抱
徹夜未眠唱著歌說垃圾話
這樣就足以感到驕傲(感到驕傲)

若是會當閣予我一改機會
我欲佮你做伙袂閣再管浮華世間的一切
所有的願望早就已無所謂
因為一生只想和你一起
趕上幸福的末班車
Everybody let’s go`,
    image: "images/1761573843670-943415105.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761573989905",
    title: "Love Song",
    creators: ["方大同"],
    lyricist: ["方大同"],
    composer: ["方大同"],
    albums: "未來",
    release_date: "2007-12-28",
    language: "中文",
    genre: "R&B",
    lyrics: `我寫了這首歌 是一首簡單的
不複雜也不難唱的那一種歌

這不是那種 只剩下那鋼琴的歌
也不是那種 不能只是朋友的歌
這不是那種 兩個人的故事寫在一本小說
那小說裏有誰會在花田裏犯了錯
這就是一首寫給你聽的一個

Love Song 一直想寫一首
Love Song 你給了我一首
Love Song 那DJ會播放
這也許會上榜
不過我只想寫出一首

Love Song 一直想寫一首
Love Song 你給了我一首
你就像那夏天的涼風
吹過我的面孔 情翔飛
在我心底 你就是我第一 想說愛你

我寫了這首歌 是一首簡單的
不複雜也不難唱的那一種歌

這不是那種 童話裏會遇見的歌
也不是那種 真真切切愛我的歌
這不是那種 兩個人的故事寫在一本小說
那小說裏有誰陪她看流星再降落
這就是一首寫給你聽的一個

Love Song 一直想寫一首
Love Song 你給了我一首
Love Song 那DJ會播放
這也許會上榜
不過我只想寫出一首

Love Song 一直想寫一首
Love Song 你給了我一首
你就像那夏天的涼風
吹過我的面孔 情翔飛
在我心底 你就是我第一 想說愛你

如果你是一幅畫
你會是最珍貴的一幅畫
如果那畫家是梵高的話
有何貴人前來有錢花 個個向你求嫁
梵高他說 你們都該回家

又或者你是Melody 就是最動聽
所有的人都會跟著你齊唱
就算在夜晚 你的星太亮
讓我忘了月亮代表我的…

Love Song 你給了我一首
Love Song 那DJ會播放
這也許會上榜
不過我只想寫出一首

Love Song 一直想寫一首
Love Song 你給了我一首
Love 你就像那夏天的涼風
吹過我的… 情翔飛
在我心底 你就是我第一`,
    image: "images/1761573989902-219877829.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761574071529",
    title: "我愛你",
    creators: ["盧廣仲"],
    lyricist: ["盧廣仲"],
    composer: ["盧廣仲"],
    albums: "100種生活",
    release_date: "2008-05-27",
    language: "中文",
    genre: "流行",
    lyrics: `曾 曾經在我眼前 卻又消失不見
這是今天的第六遍
電影裡的配樂 好像你的雙眼
我愛你 快回到 我身邊

好不好 好不好 好不好
答案沒有什麼好不好
不知道 不知道 不知道
不知道是什麼好預兆
好不好 好不好 好不好
答答答答答答答答答
不知道 不知道 不知道
不知道是什麼好預兆

太陽公公出來了 他對我呀笑呀笑
我愛你 你知不知道

曾經在我眼前 卻又消失不見
這是今天的第六遍
電影裡的配樂 好像你的雙眼
我愛你 快回到 我身邊

好不好 好不好 好不好
答答答答答答答答答
不知道 不知道 不知道
不知道是什麼好預兆

太陽公公出來了 他對我對對我對我
笑呀笑 我愛你 你知不知道

曾經在我眼前 卻又消失不見
這是今天的第六遍
電影裡的配樂 好像你的雙眼
我愛你 快回到 我身邊

太陽公公出來了 他對我呀笑呀笑
我愛你 你知不知道

曾經在我眼前 卻又消失不見
我不要比賽交白卷
電影裡的配樂 好像你的雙眼
我愛你 快回到 我愛你 快回到
我愛你 快回到 我身邊`,
    image: "images/1761574071525-305093232.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761574179188",
    title: "擱淺",
    creators: ["周杰倫 Jay Chou"],
    lyricist: ["宋健彰"],
    composer: ["周杰倫 Jay Chou"],
    albums: "七里香",
    release_date: "2004-08-23",
    language: "中文",
    genre: "流行",
    lyrics: `久未放晴的天空 依舊留著妳的笑容
哭過 卻無法掩埋歉疚
風箏在陰天擱淺 想念還在等待救援
我拉著線 復習妳給的溫柔
曝曬在一旁的寂寞 笑我給不起承諾
怎麼會怎麼會 妳竟原諒了我

我只能永遠讀著對白 讀著我給妳的傷害
我原諒不了我 就請妳當作我已不在
我睜開雙眼 看著空白 忘記妳對我的期待
讀完了依賴 我很快就離開


久未放晴的天空 依舊留著妳的笑容
哭過 卻無法掩埋歉疚
風箏在陰天擱淺 想念還在等待救援
我拉著線 復習妳給的溫柔
曝曬在一旁的寂寞 笑我給不起承諾
怎麼會怎麼會 妳竟原諒了我

我只能永遠讀著對白 讀著我給妳的傷害
我原諒不了我 就請妳當作我已不在
我睜開雙眼 看著空白 忘記妳對我的期待
讀完了依賴 我很快就
我只能永遠讀著對白 讀著我給妳的傷害
我原諒不了我 就請妳當作我已不在
我睜開雙眼 看著空白 忘記妳對我的期待
讀完了依賴 我很快就離開`,
    image: "images/1761574179185-980205482.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761575321719",
    title: "她說",
    creators: ["林俊傑"],
    lyricist: ["孫燕姿"],
    composer: ["林俊傑"],
    albums: "她說",
    release_date: "2010-10-28",
    language: "中文",
    genre: "流行",
    lyrics: `他靜悄悄地來過
他慢慢帶走沉默
只是最後的承諾
還是沒有帶走了寂寞

我們愛的沒有錯
只是美麗的獨秀太折磨
她說無所謂
只要能在夜裡 翻來覆去的時候有寄託

等不到天黑 煙火不會太完美
回憶燒成灰 還是等不到結尾
她曾說的無所謂 我怕一天一天被摧毀

等不到天黑 不敢凋謝的花蕾
綠葉在跟隨 放開刺痛的滋味
今後不再怕天明 我想只是害怕清醒

他靜悄悄地來過
他慢慢帶走沉默
只是最後的承諾
還是沒有帶走了寂寞

我們愛的沒有錯
只是美麗的獨秀太折磨
她說無所謂
只要能在夜裡 翻來覆去的時候有寄託

等不到天黑 煙火不會太完美
回憶燒成灰 還是等不到結尾
她曾說的無所謂 我怕一天一天被摧毀

等不到天黑 不敢凋謝的花蕾
綠葉在跟隨 放開刺痛的滋味
今後不再怕天明 我想只是害怕清醒

等不到天黑 煙火不會太完美
回憶燒成灰 還是等不到結尾
她曾說的無所謂 我怕一天一天被摧毀

等不到天黑 不敢凋謝的花蕾
綠葉在跟隨 放開刺痛的滋味
今後不再怕天明 我想只是害怕清醒

不怕天明 我想只是害怕清醒`,
    image: "images/1761575321715-583468607.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761575536931",
    title: "小紫aka給我錢",
    creators: ["芒果醬"],
    lyricist: ["郭佐治"],
    composer: ["郭佐治"],
    albums: "新・寶島少年？",
    release_date: "2022-06-30",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `把藝術都給殺了（殺了）
商品做起來了（來了）
追夢少年窮了跟著芒果醬就富了（富了）
把藝術都給殺了（殺了）
商品做起來了（來了）
追夢少年窮了跟著芒果醬就富了（富了）

慢慢我越長越大 也開始實現夢想
遇見了白雪公主 她說她叫做小紫

I call her honey honey
She calls me money money
長大後才發現 什麼都是錢

但我沒錢 我的理想會讓我餓死在路邊
我沒錢 我心愛的人說他要吃茹絲葵
我沒錢 所以我在這裡想要拜託各位
各位大哥大姐聽我講一句話

給我錢 好讓我能更快擁有這一切
給我錢 因為錢就是我的快樂泉源
她說她愛的真的不是錢
她只是愛更多生活體驗
只是那些體驗 剛好需要錢

拜託各位
給我錢 好讓我能更快享受這一切
給我錢 因為錢就是我的快樂泉源
把 愛 勇氣 希望 都賣了
能換來多少錢
小紫笑的妖豔
卻不在我身邊
拜託各位給我錢

I call her honey honey
She calls me money money
長大後才發現 什麼都是錢

但我沒錢 我的理想會讓我餓死在路邊
我沒錢 我心愛的人說他要吃茹絲葵
我沒錢 所以我在這裡想要拜託各位
各位大哥大姐聽我講一句話

給我錢 好讓我能更快擁有這一切
給我錢 因為錢就是我的快樂泉源
她說她愛的真的不是錢
她只是愛更多生活體驗
只是那些體驗 剛好需要錢

拜託各位
給我錢 好讓我能更快享受這一切
給我錢 因為錢就是我的快樂泉源
把 愛 勇氣 希望 都賣了
能換來多少錢
小紫笑的妖豔
卻不在我身邊
拜託各位給我給我給我...

給我錢錢錢！五月天！五月天！
給我錢錢錢！宇宙人！宇宙人！
給我錢錢錢！吿五人！吿五人！
拜託各位 拜託各位大哥大姐給我

給我錢錢錢！五月天！五月天！
給我錢錢錢！宇宙人！宇宙人！
給我錢錢錢！吿五人！吿五人！
拜託各位 拜託各位前輩給我錢！`,
    image: "images/1761575536928-306260670.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761575714112",
    title: "聽不到",
    creators: ["五月天"],
    lyricist: ["阿信"],
    composer: ["阿信"],
    albums: "知足 just my pride 最真傑作選",
    release_date: "2005-08-26",
    language: "中文",
    genre: "流行",
    lyrics: `夜 黑夜 寂寞的夜裡
氣 生氣 對自己生氣
軟弱的電話 又打給你

想 聽你 那邊的空氣
有 什麼 精采的話題
你還是溫柔 給我婉轉的距離

我的聲音在笑 淚在飆
電話那頭的你 可知道

世界若是那麼大
為何我要忘你 無處逃

我的聲音在笑 淚在飆
電話那頭的你 可知道

世界若是那麼小
為何我的真心 你聽不到



會 很會 偽裝我自己
你 不該 背我的秘密
沉重都給我 微笑給你

奔 狂奔 空曠的感情
走 暴走 暴走的傷心
透明的嘆息 最後還是我的秘密

我的聲音在笑 淚在飆
電話那頭的你 可知道

世界若是那麼大
為何我要忘你 無處逃

我的聲音在笑 淚在飆
電話那頭的你 可知道

世界若是那麼小
為何我的真心 你聽不到
你聽不到 你聽不到 喔～



聽不到 聽不到我的執著
撲通 撲通一直在跳

直到你有一天能夠明暸
我做得到 我做得到

我的聲音在笑 淚在飆
電話那頭的你 可知道

世界若是那麼大
為何我要忘你 無處逃

我的聲音在笑 淚在飆
電話那頭的你 可知道

世界若是那麼小
為何我的真心 你聽不到

你聽不到 你聽不到 喔～ 哦～
啦～～ 你聽不到 你聽不到 你聽不到`,
    image: "images/1761575714109-832438595.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761575963607",
    title: "萬千花蕊慈母悲哀",
    creators: ["珂拉琪"],
    lyricist: ["王家權"],
    composer: ["王家權"],
    albums: "MEmento·MORI",
    release_date: "2021-12-23",
    language: "台語",
    genre: "獨立音樂",
    lyrics: `下晡 一个人踮厝內
西北雨 沃澹窗外的衫
外口的人 猶未轉來
戇戇咧等
戇戇攑一支雨傘

為你 幾若擺睏袂去
全世界 揣袂著你的形影
凡勢 會當共你放捒
氣身惱命
我哪會攏無要無緊

踮遮規暝 看電火閃爍
我踮遮等待 拍無去的人
聽厝內的聲 聲聲佇咧吼
我踅來踅去 思念火燒房間

袂開的花
無欲轉來的人
美麗的你啊
想著你彼當時
攑懸你的旗仔
路邊的話
滿街路雨紛飛
時代的變卦
孤單的我一个人
問天也毋捌

手內啥物攏無
只賰我欲予你的愛
有血有肉的人
煞下落不明

共你的 記持啊
囥佇我的心內
騎你的 白馬啊
行你欲行的路
風吹來 花落塗
點一欉香祈求
（南無觀世音菩薩）

若準講你
算著這齣悲劇
你敢會看顧
紲落來伊頭前
彼逝歹行的路
夢中的我
看你沓沓仔行
牽你的亡魂
有一工咱做伙
轉去彼个所在

我 蔫去的愛（規路攏是）
佮你 恬去的心（你）
佇這烏暗時代（佇這烏暗時代）
是有緣無份（想欲講出）
寫袂了的批（的）
佮講袂煞的話（奈何）
(亻因) 開袂完的銃（開袂完的銃）
看人去樓空（火烌猶在）

雨 微微仔落
天 微微仔光
看你 微微仔笑
後世人再會`,
    image: "images/1761575963603-826952981.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761576346396",
    title: "T.B.H",
    creators: ["QWER"],
    lyricist: ["이동혁", "GESTURE", "김혜정", "Elum", "Magenta"],
    composer: ["이동혁", "홍훈기", "Elum", "GESTURE", "한아영"],
    albums: "MANITO",
    release_date: "2024-04-01",
    language: "韓文",
    genre: "流行",
    lyrics: `One! Two! Q! W! E! R!
One! Two! Q! W! E! R!

어떤 인사가 괜찮을까 천 번쯤 상상해 봤어
要用什麼樣的招呼才好呢，在腦中已模擬了千百次

근데 오늘도 천 번 하고 한 번 더 고민 중
就算今天已經來回苦惱了千遍，也還是想再多想一次

막상 네 앞에 서니 꽁꽁 얼어버렸다
當我真的站在你面前時，卻又傻住了

숨겨왔던 나의 맘 절반의 반도 주지를 못했어
隱藏在心底的真話，就連一半的一半都無法傳遞

아, 아, 아직은
啊、啊，還沒有

준비가 안됐다구요
還沒做好準備啊

소용돌이쳐 어지럽다구
陷入了漩渦之中，真的好頭痛啊

쏟아지는 맘을 멈출 수가 없을까?
難不成就無法停下這湧上心頭的情緒嗎？

너의 작은 인사 한마디에 요란해져서
只因你小小的問候就變得心神不寧

네 맘의 비밀번호 눌러 열고 싶지만
即使想要輸入密碼來打開你的心房

너를 고민고민해도 좋은 걸 어쩌니
可是無論如何苦惱就還是好喜歡你，怎麼辦呢

거울 앞에서 새벽까지 연습한 인사가
在鏡子前練習到天亮的問候方式

손을 들고 웃는 얼굴을 하고서 고개를 숙였다
將手舉高、揚起嘴角，卻還是低下了頭

아, 아, 아직도 준비가 안됐나 봐요
啊、啊，到現在也還沒準備好啊

소용돌이쳐 어지럽다구
陷入了漩渦之中，還是好苦惱啊

쏟아지는 맘을 멈출 수가 없을까?
難不成就無法停下這湧上心頭的情緒嗎？

너의 작은 인사 한마디에 요란해져서
只因你小小的問候就變得心神不寧

네 맘의 비밀번호 눌러 열고 싶지만
即使想要輸入密碼來打開你的心房

너를 고민고민해도 좋은 걸
可是無論如何苦惱就還是好喜歡你

이러지도 저러지도 못하는데
這樣也不是、那樣也不是

속이 왈칵 뒤집히고
亂糟糟的內心波濤洶湧著

이쯤 왔으면 눈치 챙겨야지
都這種時候了你也該看懂眼色了吧

날 봐달라구요
請多看我一眼吧

（좋아한다 너를 좋아한다 좋아해）
（好喜歡，真的好喜歡你啊，喜歡你）

너를 많이 많이 좋아한단 말이야
我是真的非常非常喜歡你啊

벅차오르다 못해 내 맘이 쿡쿡 아려와
激動不已的心都開始隱隱作痛

두 번은 말 못 해 너 지금 잘 들어봐
絕不會再說第二次，給我聽清楚了

매일 고민하고 연습했던 말
這句我每天都苦惱練習著的話語

좋아해
「我喜歡你」`,
    image: "images/1761576346393-629474637.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761576538306",
    title: "大海",
    creators: ["南西肯恩"],
    lyricist: ["陳弘育"],
    composer: ["陳弘育"],
    albums: "一個不屬於自己的地方",
    release_date: "2021-09-10",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `我走過你曾經帶我走過的小路上
還是最初的模樣
溼轆的泥濘中長出青綠色的枝芽
那是你最愛的那棵樹阿
你說 哭吧 哭吧
你說 哭啊 哭啊
你說 哭吧 想哭啊
就讓眼淚變成大海啊 跟我走吧
大海啊 為什麼你都不說話
大海啊 你安靜的太可怕 平靜的可怕
我不願看著你 臉上在微笑 內心卻在掙扎
跟我走啊 跟我走吧
跟我走吧 跟我一起走向大海啊
跟我走吧 一起走啊
跟我走吧 跟我走吧 跟我一起走向大海啊
你說 哭吧 哭吧
你說 哭啊 哭啊
你說 哭吧 想哭啊
就讓眼淚變成大海啊 跟我走啊
大海啊 為什麼你都不說話 你都不說話
大海啊 你安靜的太可怕 平靜的可怕
我不願看著你 臉上在微笑 內心卻在掙扎
跟我走啊 跟我走吧
跟我走吧 跟我一起走向大海啊
跟我走吧 一起走啊
跟我走吧 跟我走吧 跟我一起走向大海啊`,
    image: "images/1761576538304-396815668.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761576678292",
    title: "留給你的我從未",
    creators: ["甜約翰"],
    lyricist: ["吳倬安"],
    composer: ["吳浚瑋", "梁丹郡", "陳冠宇"],
    albums: "Dear",
    release_date: "2017-12-15",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `每過一天
叮嚀自己再勇敢一點
面對生活再堅決一些
努力走過漫漫長夜
才能讓你看見

其實我
也不是真的不了解
茫茫人海中的妥協
雨後也未必有晴天
但我腦海的畫面

你的眼神比想像中還要和煦深邃 (在你的面前)
提醒我會不會看起來開心得太狼狽
Hoo hoo 沈澱了 整片藍天
Hoo hoo woo daladada

留給你的心跳我從未
讓它冷卻任何一些
留給你的笑容我從未
讓它黯淡任何一些 daladada

你的眼神比想像中還要和煦深邃 (在你的面前)
提醒我會不會看起來開心得太狼狽
Hoo hoo 沈澱了 整片藍天
Hoo hoo woo

你的眼神比想像中還要和煦深邃 (在你的面前)
提醒我會不會看起來開心得太狼狽
Hoo hoo 沈澱了 整片藍天
Hoo hoo woo daladada`,
    image: "images/1761576678288-913854501.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761577216456",
    title: "你到底在選擇什麼",
    creators: ["公館青少年 GGteens"],
    lyricist: ["廖于任", "盧彥恩"],
    composer: ["廖于任", "盧彥恩"],
    albums: "你到底在選擇什麼",
    release_date: "2025-07-21",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `在等著誰先開口
言語間的玩笑和幽默
有你 周圍都變得普通不過

注意你的小動作
你說命中缺個我
但怎麼你朋友都不曾見過我

明明就
有些話都不必說
心電感應還不夠用
還是需要我再給你更多？

你怎麼還沒把心交給我
難道是早已經被誰偷走
那就 不要
給一堆機會讓我又深陷其中

或許我只是裝作還不懂
還不懂那些機會不是我
總想不透 要怎麼做你才能看向我

你到底在 選擇什麼
想和你去走一走
這次又搪塞什麼理由
或許 我們真的有太多不同

眼神裡的沒把握
考慮該為誰停留
為什麼只能等著機會轉向我

明明就
有些話都不必說
心電感應也沒有用
難道還要我再給你更多？

你怎麼還沒把心交給我
難道是早已經被誰偷走
那就 不要
給一堆機會讓我又深陷其中

或許我只是裝作還不懂
還不懂那些機會不是我
總想不透 要怎麼做你才能看向我
你到底在 選擇什麼

你怎麼還沒把心交給我
不想承認你從沒認真過
總看 不透
是因為真的心動 或只是寂寞

也許你只是裝作還不懂
不理會我們之間的所有
時間倒流 或許我們就會擦肩而過
你到底在 選擇什麼`,
    image: "images/1761577216451-288772802.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761577478386",
    title: "才二十三",
    creators: ["方大同"],
    lyricist: ["方大同"],
    composer: ["方大同"],
    albums: "才二十三",
    release_date: "2024-08-23",
    language: "中文",
    genre: "流行",
    lyrics: `時間 等不了人
生活中 一不留神
轉個眼秒殺了
隨秒針蒸發了

昨天變成了今天
過去變成了現在
未來剛才來
它從何而來

歲月 眨眼就過了
瞬間 就那樣默默的
上一次看 才二十三
現在的日子沒有那麼簡單

樹葉 又要撒落了
花兒 就快要復活了
回想以前 沒那麼累
現在的白髮 和皺紋匹配
也是一種美

青春 是一個夢
人生 如一陣春風
不經意的飄過
境界驀然遼闊

昨天變成了今天
過去變成了現在
未來剛才來
它從何而來

歲月 眨眼就過了
瞬間 就那樣默默的
上一次看 才二十三
現在的日子沒有那麼簡單

樹葉 又要撒落了
花兒 就快要復活了
回想以前 沒那麼累
現在的白髮 和皺紋匹配
也是一種美

放下那 曾經 留下那 痕跡
前方的你 別忘了自己
成長是 永遠 離別是 空懸
在千尋之外 我依然存在

歲月 眨眼就過了
瞬間 就那樣默默的
上一次看 才二十三
現在的日子...`,
    image: "images/1761577478384-938799410.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761577583216",
    title: "停靠",
    creators: ["胡凱兒"],
    lyricist: ["謝浩澤"],
    composer: ["謝浩澤"],
    albums: "昨天",
    release_date: "2018-12-05",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `記憶中的那條街 轉眼過了好多年
在心底偶然浮現 那些
試圖傾訴想念的字眼
我在 每段沿途風景裡面
期待哪天和匆忙的你遇見
當再也停不下眼淚 終於忍不住思念
當時間不再向前 停靠在那年秋天
希望你依然聽得見 曾許下的每個心願
擁抱每個明天 不管未來多遠
輾轉著不知不覺 青春又更遠了些
而少年始終 未曾如願
直到一切都成了雲煙
活在 往事裡看四季更迭
相信那一天 你依然會為誰不顧一切

當再也停不下眼淚 終於忍不住思念
當時間不再向前
當再也停不下眼淚 終於忍不住思念
當時間不再向前 停靠在那年秋天
希望你依然聽得見 曾許下的每個心願
擁抱每個明天 不管未來多遠`,
    image: "images/1761577583214-358197675.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761577758265",
    title: "晚餐歌",
    creators: ["tuki."],
    lyricist: ["tuki."],
    composer: ["tuki."],
    albums: "15",
    release_date: "2023-09-29",
    language: "日文",
    genre: "流行",
    lyrics: `君を泣かすから
kimiwo nakasu kara
因為會讓你哭泣

だから一緒には居れないな
dakara issho niwa irenai na
所以沒辦法在一起呢

君を泣かすから
kimiwo nakasu kara
因為會讓你哭泣

早く忘れて欲しいんだ
hayaku wasurete hoshinda
希望你能快點忘掉我啊

人間だからね
ningen dakara ne
正因為是人類啊

たまには違うものも食べたいね
tamaniwa chigau mono mo tabetai ne
偶而會想吃點不一樣的食物

君を泣かすから
kimiwo nakasu kara
因為會讓你哭泣

そう君を泣かすから
sou kimiwo nakasu kara
是啊 因為會讓你哭啊


でも味気ないんだよね
demo ajikenain dayone
但是有些無聊啊

会いたくなんだよね
aitaku nandayone
還是會想要見你啊

君以外会いたくないんだよね
kimi igai aitakunain dayone
不想見除了你之外的人啊

なんて勝手だね
nante katte dane
什麼的真是擅自呢

大体曖昧なんだよね
daitai aimai nandayone
大概都是曖昧的

愛の存在証明なんて
aino sonzai shoumei nante
愛情的存在證明什麼的

君が教えてくれないか
kimi ga oshiete kurenai ka
你能教會我嗎


何十回の夜を過ごしたって得られぬような
nanjukkai no yoru wo sugoshita tte erarenu youna
即使過了好幾十個夜晚也得不出般的

愛してるを並べてみて
aishiteru wo narabete mite
將「我愛你」試著列出來吧

何十回の夜を過ごしたって得られぬような
najukkai no yoru wo sugoshita tte erarenu youna
即使過了好幾十個夜晚也得不出般的

最高のフルコースを頂戴
saikou no furukoーsu wo choudai
請給我最棒的全餐吧


君を泣かすから　
kimiwo nakasu kara
因為會讓你哭泣

きっと一生は無理だよね
kitto isshou wa muri dayone
所以一定一輩子是不可能的啊

君を泣かすから　
kimiwo nakasu kara
因為會讓你哭泣

胸がとても痛くなんだ　
munega totemo itaku nanda
胸口真的很痛啊

人間だからね　
ningen dakara ne
正因為是人類啊

たまには分かり合えなくなって
tamaniwa wakari aenaku natte
偶爾會變得沒辦法理解對方

君を泣かすから　
kimiwo nakasu kara
因為會讓你哭泣

また君を泣かすから
mata kimiwo nakasu kara
又會讓你哭泣啊


でも自信がないんだよね
demo jishin ga nain dayone
但是沒有自信啊

変わりたくないんだよね
kawari takunain dayone
不想要改變啊

君以外会いたくないんだよね
kimi igai aitakunain dayone
不想見除了你之外的人啊

なんて勝手だね
nante katte dane
什麼的真是擅自呢

大体曖昧だったよね
daitai aimai datta yone
大概都是曖昧的

愛の存在証明なんて
aino sonzai shoumei nante
愛情的存在證明什麼的

君がそこに居るのにね　　
kimiga sokoni iru noni ne
明明你就在那裡啊


何百回の夜を過ごしたって得られぬような
nabyakkai no yoru wo sugoshita tte erarenu youna
即使過了好幾百個夜晚也得不出般的

愛してるを並べてみて
aishiteru wo narabete mite
將「我愛你」試著列出來吧

何百回の夜を過ごしたって得られぬような
nanbyakkai no yoru wo sogoshita tte erarenu youna
即使過了好幾百個夜晚也得不出般的

最高のフルコースを頂戴
saikou no furukoーsu wo choudai
請給我最棒的全餐吧


離れないで　傍に居てくれたのは
hanarenai de soba ni itekureta nowa
別離開我啊  會待在我身邊的

結局君一人だったよね
kekkyoku kimi hitori datta yone
果然還是只有你一個人啊

涙のスパイスは君の胸に
namida no supaisu wa kimino mune ni
眼淚的辛辣在你的胸口中

残ってしまうだろうけど
nokotte shimau darou kedo
就會這麼留著的吧


何千回の夜を過ごしたって得られぬような
nanzenkai no yoru wo sugoshita tte erarenu youna
即使過了好幾千個夜晚也得不出般的

愛してるを並べるから
aishiteru wo naraberu kara
將「我愛你」試著列出來吧

何千回の夜を過ごしたって得られぬような
nanzenkai no yoru wo sugoshita tte erarenu youna
即使過了好幾千個夜晚也得不出般的

最高のフルコースを
saikou no furukoーsu wo
最棒的全餐啊


何万回の夜を過ごしたって忘れぬような
namankai no yoru wo sugoshita tte wasurenu youna
即使過了好幾萬個夜晚也無法忘記的

愛してるを並べるから
aishiteru wo naraberu kara
會將「我愛你」排列出來的

何万回の夜を過ごしたって忘れぬような
nanmankai no yoru wo sugoshita tte wasurenu youna
即使過了好幾萬個夜晚也無法忘記的

最高のフルコースを頂戴
saikou no furukoーsu wo choudai
請給我最棒的全餐吧


翻譯：はる☘️`,
    image: "images/1761577758259-232671209.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761577977169",
    title: "天空",
    creators: ["蔡依林"],
    lyricist: ["衛斯理", "小米"],
    composer: ["衛斯理"],
    albums: "野蠻遊戲",
    release_date: "2005-04-25",
    language: "中文",
    genre: "流行",
    lyrics: `聽著自己的心跳 沒有規則地跳躍
我安靜地在思考 並不想被誰打擾
我們曾緊緊擁抱 卻又輕易地放掉
那種感覺很微妙 該怎麼說才好

時間分割成對角 停止你對我的好 瓦解我們的依靠

在你離開之後的天空 我像風箏尋一個夢
雨後的天空 是否有放晴後的面容
我靜靜的望著天空 試著尋找失落的感動
只能用笑容 期待著雨過天晴的彩虹

聽著自己的心跳 沒有規則地跳躍
我安靜地在思考 並不想被誰打擾
我們曾緊緊擁抱 卻又輕易地放掉
那種感覺很微妙 該怎麼說才好

時間分割成對角 停止你對我的好 瓦解我們的依靠

在你離開之後的天空 我像風箏尋一個夢
雨後的天空 是否有放晴後的面容
我靜靜的望著天空 試著尋找失落的感動
只能用笑容 期待著雨過天晴的彩虹

在你離開之後的天空 我像風箏尋一個夢
雨後的天空 是否有放晴後的面容
我靜靜的望著天空 試著尋找失落的感動
只能用笑容 期待著雨過天晴的彩虹

在你離開之後的天空 我像風箏尋一個夢
我靜靜地望著天空 試著尋找失落的感動`,
    image: "images/1761577977167-751466349.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761578643746",
    title: "當你在最需要的時候",
    creators: ["怕胖團"],
    lyricist: ["閃亮", "大寶"],
    composer: ["閃亮", "weeman"],
    albums: "2049",
    release_date: "2019-10-18",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `沒想過 到底會走多久
只聽說 上面的風景不錯
好多次 被旁人的數落
不成功 我可是絕不回頭
我早就決定 要做個偉大的英雄
讓這個世界都記得我
遠方的你 請別想太多
相信我 這條路不會太久
風雨中 我們都看不透
一眨眼 就過了春夏秋冬
我早就決定 要做個偉大的英雄
卻忘了 你一直在等我
當你在最需要的時候
錯過多少你的笑容
當你在最需要的時候
我只顧自己往前走
當你在最需要的時候
沒有陪著你難過
當你在最需要的時候
我讓你一個人承受
當你在最需要的時候
我只顧自己往前走
當你在最需要的時候
沒有陪著你難過
當你在最需要的時候
我讓你一個人承受
你總是一個人等我
卻還是給了我笑容`,
    image: "images/1761578643742-838585755.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761578888654",
    title: "北上列車",
    creators: ["三月三十不眠症"],
    lyricist: ["凱拉", "仲恩"],
    composer: ["軒軒", "陳卓"],
    albums: "北上列車",
    release_date: "2024-05-10",
    language: "中文",
    genre: "流行",
    lyrics: `看著妳燦爛的側臉
青春搖曳直接
在晴朗中找尋自己
風吹不走 我們的世界

行囊滿載了誓言
穿過人群之間
你說會再見何必想念
是我妄想能妥協
落在月台上 最後一抹晚霞
落下迴歸線 等不到明天

一起說過的遠方 其實都還記得
如今真的已經抵達 回頭你卻不見了
匆匆忙忙過站的直達列車 回憶誤點
我還緊握著票根

行かないで

重複著潮濕的季節 沒有你在身邊
雲藏著我留下的淚
我能懂你 離開的原因
最後一次分離 什麼都沒說
奔向各自 與眾不同的夢
一起說過的遠方 其實都還記得
如今真的已經抵達 回頭你卻不見了
匆匆忙忙過站的直達列車 回憶誤點
我依舊緊握著票根

那炙熱的漂泊 你比我更愛我
列車已經啟動 沒回過頭
南方的太陽何時會停止轉動
能追上你的不挽留
一起說過的遠方 其實我還記得
如今真的已經抵達 回頭你卻不見了
匆匆忙忙過站的直達列車 乘到終點
是否能往回飛奔

一起說過的遠方 只剩我還記得
哪怕路途已經分岔 回頭你卻還在那
跌跌撞撞到站的直達列車
一路到這 就為能堅定向前

走了吧`,
    image: "images/1761578888652-844477392.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761622045679",
    title: "星空",
    creators: ["五月天"],
    lyricist: ["阿信"],
    composer: ["石頭"],
    albums: "第二人生 Now Here 明日版",
    release_date: "2011-09-28",
    language: "中文",
    genre: "流行",
    lyrics: `摸不到的顏色 是否叫彩虹
看不到的擁抱 是否叫做微風
一個人 想著一個人 是否就叫寂寞

命運偷走如果 只留下結果
時間偷走初衷 只留下了苦衷
你來過 然後你走後 只留下星空

那一年我們望著星空 有那麼多的 燦爛的夢
以為快樂會永久 像不變星空 陪著我


獵戶 天狼 織女 光年外沉默
回憶 青春 夢想 何時偷偷隕落
我愛過 然後我沉默 人海裡漂流

那一年我們望著星空 未來的未來 從沒想過
當故事失去美夢 美夢失去線索 而我們失去聯絡

這一片無言無語星空 為什麼靜靜 看我淚流
如果你在的時候 會不會伸手 擁抱我

細數繁星閃爍 細數此生奔波
原來 所有 所得 所獲 不如一夜的星空

空氣中的溫柔 回憶你的笑容
彷彿只要伸手 就能觸摸

摸不到的顏色 是否叫彩虹
看不到的擁抱 是否叫做微風
一個人 習慣一個人

這一刻獨自望著星空 從前的從前 從沒變過
寂寞可以是忍受 也可以是享受 享受僅有的擁有

那一年我們望著星空 有那麼多的 燦爛的夢
至少回憶會永久 像不變星空 陪著我

最後只剩下星空 像不變回憶
陪著我`,
    image: "images/1761622045504-80349972.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761622625031",
    title: "我們背對著青春",
    creators: ["輕晨電"],
    lyricist: ["隋玲", "小英"],
    composer: ["小英"],
    albums: "",
    release_date: "2015-07-31",
    language: "中文",
    genre: "",
    lyrics: `如果說這世界已沒有悲傷
如果說這世界已不需要逃亡
如果說這世界已莫以名狀
我想我終將無法歌唱
如果你離開只因看不清前方
如果你留下只因理不清立場
如果你拋下那些堆疊的景象
我想我們也因此成長

da~la~la~
人們不厭的沉溺世界的瘋狂
da~la~la~
共同成就著彼此善變的堅強

如果說這世界仍善於遺忘
如果說這世界還拘泥著夢想
如果說這世界仍吹捧著信仰
我想我終將放棄希望

da~la~la~
人們不厭的沉溺世界的瘋狂
da~la~la~
共同成就著彼此善變的堅強
da~la~la~
人們不厭的迷戀膚淺的嚮往
da~la~la~
共同成就著彼此脆弱的猖狂

da~la~la~

我們持續聽著
屬於這時代的搖滾樂
直到彼此青春
Ah~

我們持續聽著
屬於這時代的搖滾樂
直到彼此青春
Ah~

我們持續聽著
屬於這時代的搖滾樂
直到彼此青春
Ah~

我們持續聽著`,
    image: "images/1761622625030-228330015.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761623043835",
    title: "Fine",
    creators: ["輕晨電"],
    lyricist: ["隋玲", "小英"],
    composer: ["隋玲", "小英"],
    albums: "StreetVoice 冬季選集",
    release_date: "2011-11-14",
    language: "中文",
    genre: "",
    lyrics: `It's fine
Breathing by myself
It's fine
Waving by myself...
It's fine
Breathing by myself
It's fine
Waving by myself...
It's fine
Breathing by myself
It's fine
Waving by myself...
It's fine
Breathing by myself
It's fine
Waving by myself...
It's fine
It's fine
It's fine
It's fine
It's fine
Breathing by myself
It's fine
Waving by myself...
It's fine
Breathing by myself
It's fine
Waving by myself...`,
    image: "images/1761623043750-987530925.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761628950605",
    title: "愛情轉移",
    creators: ["陳奕迅"],
    lyricist: ["林夕"],
    composer: ["Christopher Chak"],
    albums: "認了吧",
    release_date: "2007-04-24",
    language: "中文",
    genre: "流行",
    lyrics: `徘徊過多少櫥窗 住過多少旅館 才會覺得分離也並不冤枉
感情是用來瀏覽 還是用來珍藏 好讓日子天天都過得難忘

熬過了多久患難 濕了多長眼眶 才能知道傷感是愛的遺產
流浪幾張雙人床 換過幾次信仰 才讓戒指義無反顧的交換

把一個人的溫暖 轉移到另一個的胸膛 讓上次犯的錯反省出夢想
每個人都是這樣 享受過提心吊膽 才拒絕做愛情待罪的羔羊

回憶是抓不到的月光握緊就變黑暗 等虛假的背影消失於晴朗
陽光在身上流轉 等所有業障被原諒
愛情不停站 想開往地老天荒 需要多勇敢

燭光照亮了晚餐 照不出個答案 戀愛不是溫馨的請客吃飯
床單上鋪滿花瓣 擁抱讓它成長 太擁擠就開到了別的土壤

感情需要人接班 接近換來期望 期望帶來失望的惡性循環
短暫的總是浪漫 漫長總會不滿 燒完美好青春換一個老伴

把一個人的溫暖 轉移到另一個的胸膛 讓上次犯的錯反省出夢想
每個人都是這樣 享受過提心吊膽 才拒絕做愛情待罪的羔羊

回憶是抓不到的月光握緊就變黑暗 等虛假的背影消失於晴朗
陽光在身上流轉 等所有業障被原諒
愛情不停站 想開往地老天荒 需要多勇敢

把一個人的溫暖 轉移到另一個的胸膛 讓上次犯的錯反省出夢想
每個人都是這樣 享受過提心吊膽 才拒絕做愛情待罪的羔羊

回憶是抓不到的月光握緊就變黑暗 等虛假的背影消失於晴朗
陽光在身上流轉 等所有業障被原諒
愛情不停站 想開往地老天荒 需要多勇敢
你不要失望 蕩氣迴腸是為了 最美的平凡`,
    image: "images/1761628950599-410778311.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761629134824",
    title: "等一個人",
    creators: ["林芯儀"],
    lyricist: ["徐世珍", "吳輝福"],
    composer: ["許勇"],
    albums: "等一個人咖啡",
    release_date: "2014-08-25",
    language: "中文",
    genre: "",
    lyrics: `天空中是否有顆星星守護我
只是我沒有發覺
人群中是否有個肩膀願為我
擋住最寒冷的冬天
誰會溫柔而堅決
帶著未來和我遇見
每個人心裏都有一個 保留著的空位
等一個人出現
擁抱著我的世界
站在愛的面前 所有寂寞防備 一瞬間崩潰
等一個人深陷
在我胸口左邊
一夜之間讓心慌 讓心痛 讓心碎
都成為紀念

誰會溫柔而堅決
帶著未來和我遇見
每個人心裏都有一個 保留著的空位
等一個人出現
擁抱著我的世界
站在愛的面前 所有寂寞防備 一瞬間崩潰
等一個人深陷
在我胸口左邊
一夜之間讓心慌 讓心痛 讓心碎
成為紀念

讓風吹乾我臉上的雨點
就算跌跌撞撞不懂愛的深淺
也要繼續尋找那一份絕對

等一個人成為
我生命中的永遠
幸福多麼迂迴 為何沒有發現 愛就在身邊
等一個人帶回
大雨後的藍天
從今之後每一天 每一月 每一年 都心甘情願

幸福多麼迂迴 為何沒有發現 愛就在身邊
等一個人帶回
大雨後的藍天
從今之後每一天 每一月 每一年 都心甘情願`,
    image: "images/1761629134822-440244393.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761629289987",
    title: "人間螢火",
    creators: ["夏日入侵企画"],
    lyricist: ["夏日入侵企画"],
    composer: ["灰鴻啊"],
    albums: "人间萤火",
    release_date: "2022-06-08",
    language: "中文",
    genre: "",
    lyrics: `還沒想好這封信該如何開始
就讓它順其自然吧
沒人能停止
出發時或許還有點幼稚
來不及回憶
又去了這麼多的城市
就像二零一三年夏天的風
不切實際的夢
追不回的箏
也許還有一點感動
然後又半夢半醒過了好幾年
也没完全和一切和解
又想到一些盲目脆弱和虛偽
醒來之後還要去面對
隨它下墜
或如何入睡
卻被黑暗莫名的安全和溫柔包圍
還有許多種思緒遊蕩
在倒影間的城市中漂浮流淌
昏暗的視線裡
自由生長
就讓所有此刻孤獨微小溫柔的光
陪伴著漫漫長夜被照亮的路
也許會穿越過山谷或是海洋
還是其他有你的地方
或許我只能向前走
把所有遺憾眼淚都留在身後
朋友
明知答案的問題真的不必問出口
不如 就這麼算了
希望這段無從談起的想念
在記憶裡躲過時間
最熟悉的臉
哭還是笑都隨你便
往事不斷浮現
像盆栽需要陽光灰雁需要風浪
像鯨魚需要海洋
像今晚需要月亮
想感謝所有的屬於這一刻
把我們的心連接在一起的此刻
被偷走的這幾年
一切都改變又沒有改變
向飛馳而過的自己拜託
請永遠記得那場雪
就讓所有此刻孤獨微小溫柔的光
陪伴著漫漫長夜被照亮的路
也許會穿越過山谷或是海洋
還是其他有你的地方
上次分別後的一段時間
偶爾也會在凌晨路過那條街
還是沒能早睡的每一天
依然拖延
又重演著日常的一切
那場從未曾出發的旅程
那些最終留在了風中的可能
說起來之前荒唐的人生
遇見你後才終於完整
每當深夜來臨
每當又難過
還有許多焦慮情緒和犯過的錯
你說這段時間多虧有我陪伴
我才要感謝你的拯救和給我力量
瘋狂的渺小的卑微的恐懼的
用力伸手想抓住
卻來不及的
不要為付出真心感到羞愧
就算錯過也別後悔
就讓所有此刻孤獨微小溫柔的光
陪伴著漫漫長夜被照亮的路
也許會穿越過山谷或是海洋
還是其他有你的地方
就讓所有此刻孤獨微小溫柔的光
陪伴著漫漫長夜被照亮的路
也許會穿越過山谷或是海洋
還是其他有你的地方`,
    image: "images/1761629289985-135113624.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761632721143",
    title: "是什麼讓我遇見這樣的你",
    creators: ["白安"],
    lyricist: ["白安"],
    composer: ["白安"],
    albums: "麥田捕手",
    release_date: "2012-12-21",
    language: "中文",
    genre: "流行",
    lyrics: `我是宇宙間的塵埃
漂泊在這茫茫人海
偶然掉入誰的胸懷
多想從此不再離開

我是宇宙間的塵埃
微不足道的一種狀態
偶然成了誰的最愛
多想相信永恆存在

是什麼 讓我遇見這樣的你
是什麼 讓我不再懷疑自己
是什麼 讓我不再害怕失去
在這茫茫人海裡 我不要變得透明

我是宇宙間的塵埃
漂泊在這茫茫人海
若你是我必然的存在
多想從此不再離開

是什麼 讓我遇見這樣的你
是什麼 讓我不再懷疑自己
是什麼 讓我不再害怕失去
在這茫茫人海裡 我不要變得透明

若時間注定要讓你離開
我又該怎麼學會不依賴

是什麼 讓我遇見這樣的你
是什麼 讓我不再懷疑自己
是什麼 讓我不再害怕失去
在這茫茫人海裡 我不要變得透明`,
    image: "images/1761632721139-277432981.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761676584872",
    title: "黑暗的盡頭",
    creators: ["Crispy脆樂團"],
    lyricist: ["盧羿安"],
    composer: ["盧羿安"],
    albums: "黑暗的盡頭",
    release_date: "2020-08-18",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `有沒有一首歌 能夠唱完一生的不捨
還是 會有一句話 能夠說完二十歲的躁動悶熱
有沒有一個人 能夠永遠抱得緊緊的
或是 會有那一天 我們再也不需要永恆

把雙手交給我 把眼淚交給我
讓我在黑暗的盡頭裡和你一起脆弱
別害怕低下頭 我會在你身後
為你打破所有的枷鎖
直到你真的了解自由
是你和我 一起走

有沒有一幅畫 能描繪你濕透的靈魂
或是 會有一首詩 可以讀懂你欲言又止的雙唇
有沒有一盞燈 關上了就看不見傷痕
還是 會有一束光 看見了夢想就會成真

把雙手交給我 把眼淚交給我
讓我在黑暗的盡頭裡和你一起脆弱
別害怕低下頭 我會在你身後
為你打破所有的枷鎖
直到你真的了解自由
是你和我 一起走 一起走 一起走

把雙手交給我 把眼淚交給我
在宇宙的角落一起走到黑暗的盡頭
別害怕低下頭 我會在你身後
就算沒變成永垂不朽
至少有你和我一起走
黑暗的盡頭 是你和我

有沒有一個吻 值得賭上每一分青春
相信 會有一雙手 只要握緊了就覺得不虛此生`,
    image: "images/1761676584782-601570671.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761677117462",
    title: "漂浪之向",
    creators: ["輕晨電"],
    lyricist: ["孟書", "隋玲"],
    composer: ["隋玲", "孟書", "小英"],
    albums: "飄浪之向",
    release_date: "2016-11-07",
    language: "中文",
    genre: "",
    lyrics: `餘光盈盈的燈火後方
讓誰藏起了孤獨和愛
餘光盈盈的燈火後方
是否有艘帶我離去的船

陌生與困惑的地圖
萬裡星辰中找不著
熟悉的蹤跡

陌生與困惑的地圖
萬裡星辰中找不著
熟悉的痕跡

踩著輕快步伐 踏上閃爍之路
伴隨著芬芳啊 無畏迎接
輕撫眼前飄揚 撒上絢麗果實
川流和雲煙啊 散發光芒

踩著輕快步伐 踏上閃爍之路
伴隨著芬芳啊 無畏迎接
輕撫眼前飄揚 撒上絢麗果實
川流和雲煙啊 散發光芒

踩著輕快步伐 踏上閃爍之路
伴隨著芬芳啊 無畏迎接
輕撫眼前飄揚 撒上絢麗果實
川流和雲煙啊 散發光芒`,
    image: "images/1761677117264-305975713.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761764921513",
    title: "台北某個地方",
    creators: ["陳綺貞"],
    lyricist: ["陳綺貞"],
    composer: ["陳綺貞"],
    albums: "沙發海",
    release_date: "2018-12-24",
    language: "中文",
    genre: "流行",
    lyrics: `曬乾你的襯衫 收起你的餐盤
呼吸這個早晨你留下的味道

清晨第一班列車 開往同一個地方
那一次你離開我 就不再回來

沙漠裡的收音機
接收不到你的頻率

有人在嗎 我一個人唱著
有人在嗎 我自問也自答
有人在嗎 明明是我們的家
為何聽不見你的回答

你最愛的角落 便利商店的霓虹
高樓大廈擋住守護我的星座

當愛寫成了小說 開始就決定結果
多年以後見到你將擦身而過

沙漠裡的收音機
接收不到我的訊息

有人在嗎 我一個人唱著
有人在嗎 我自問也自答
有人在嗎 台北的某個地方
為何聽不見你的回答

有人在嗎 我一個人唱著
有人在嗎 我自問也自答
有人在嗎 台北的某個地方
為何聽不見你的回答

心裡的某個地方
再也聽不見你的回答

台北的某個地方
再也聽不見你的回答`,
    image: "images/1761764921481-435253588.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761792692989",
    title: "太聰明",
    creators: ["陳綺貞"],
    lyricist: ["陳綺貞"],
    composer: ["陳綺貞"],
    albums: "吉他手",
    release_date: "2002-07-31",
    language: "中文",
    genre: "流行",
    lyrics: `總以為謎一般難懂的我
在你了解以後 其實也沒什麼
我總是忽冷又忽熱隱藏我的感受
只是怕愛你的心被你看透

猜得沒錯想的太多不會有結果
被你看穿了以後我更無處可躲
我開始後悔不應該太聰明的賣弄
只是怕親手將我的真心葬送

我猜著你的心
要再一次確定
遙遠的距離都是因為太過聰明
要猜著你的心
要再一次確定
混亂的思緒都是因為太想靠近你

猜得沒錯想的太多不會有結果
被你看穿了以後我更無處可躲
我開始後悔不應該太聰明的賣弄
只是怕親手將我的真心葬送

我猜著你的心
要再一次確定
遙遠的距離都是因為太過聰明
要猜著你的心
要再一次確定
混亂的思緒都是因為太想靠近你

猜得沒錯想的太多不會有結果
被你看穿了以後我更無處可躲
我開始後悔 不應該太聰明的賣弄
只是怕親手將我的真心葬.送

只是怕親手將我的真心葬.送
我開始後悔不應該太聰明的賣弄
只是怕親手將我的真心葬送`,
    image: "images/1761792692988-236944570.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761794366951",
    title: "愛愛愛",
    creators: ["方大同"],
    lyricist: ["周耀輝"],
    composer: ["方大同"],
    albums: "愛愛愛",
    release_date: "2006-12-31",
    language: "中文",
    genre: "",
    lyrics: `在 哪裡記載 第一個桃花賊 誰在 哪裡典賣 第一支紫玉釵
我在 這裡見怪更怪 見過電影裡面人家的海 更想去看海
唱過人家的愛 更想找愛

你哭起來 我笑起來 都為了 愛愛愛
有一天翻開辭海找不到愛 花不開 樹不擺 還是更暢快
愛 還是會期待 還是覺得孤單太失敗 我愛故我在

找到愛 幸福的人 肯不肯躲起來 正在 寂寞的人 能不能站起來
我在 這裡陪你無奈 讀過小說裡面人家等待 更習慣等待
唱過人家的愛 更想找愛

你喊出來 我靜下來 都為了 愛愛愛
有一天翻開辭海找不到愛 花不開 樹不擺 還是更暢快
愛 還是會期待 還是覺得孤單太失敗 我愛故我在

揮不出滿天滿地的塵埃 買不起滿街口袋的品牌
你悶起來 我傻起來 可以愛
會不會整個時代只有一個告白 誰不愛過不存在

不明不白 不分好歹 都為了 愛愛愛
有一天翻開辭海找不到愛 花不開 樹不擺 還是更暢快
愛 還是會期待 還是覺得孤單太失敗 我愛故我在`,
    image: "images/1761794366948-567284683.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761794486472",
    title: "月旁月光",
    creators: ["怕胖團"],
    lyricist: ["閃亮"],
    composer: ["閃亮"],
    albums: "2049",
    release_date: "2019-10-18",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `有一顆流星 劃過了天際
偷走了淚滴 滑落在谷底
霎那的美麗 都已經過去
一切的回憶 讓我們忘記
好大的月亮 妳有看到嗎
我一個人在床前看著它
揹上了吉他 大聲地歌唱
你有沒有聽見我的聲音啊
好大的月亮 是妳看到的嗎
我一個人在窗前看著它
在同一個地方 反覆的受傷
月光下的我們已經不一樣
結束吧 我們結束吧
放下所有還沒說的話
結束吧 我們結束吧
我們都忘記玩也會累了
我們都忘記玩也會累了
我們都忘記 玩也會累
都忘記玩也會累
都忘記玩也會累了
我們都忘記玩也會累了
我們都忘記玩也會累了
我們都忘記 玩也會累
都忘記玩也會累
都忘記玩也會累了
我們都忘記玩也會累了
我們都忘記玩也會累了
我們都忘記 玩也會累
都忘記玩也會累
都忘記玩也會累了
好大的月亮 妳有看到嗎
我一個人在窗前看著它
揹上了吉他 大聲地歌唱
你有沒有聽見我的聲音啊
好大的月亮 你還記得嗎
跟著我們一起玩到天亮
什麼時候我們 剩安靜在說話
月光下的我們已經不一樣
結束吧 我們結束吧
放下所有還沒說的話
結束吧 我們結束吧
結束吧 我們結束吧
留下所有已經受的傷
結束吧 我們結束吧`,
    image: "images/1761794486412-361303095.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761794629602",
    title: "要不要跟我出去走一走",
    creators: ["公館青少年 GGteens"],
    lyricist: ["盧彥恩", "廖于任"],
    composer: ["盧彥恩", "廖于任"],
    albums: "我其實一點都不酷",
    release_date: "2024-06-17",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `似曾相識的畫面 又重播
「你在嗎？ Hi 你在嗎？」
「要去哪？ 他不見了！」
追求幸福道路上 的漂泊
沒把握 又退縮 哪裡又出了錯

猜不透
不明白 你看似沈醉 又時而沈默
曖昧中少了些什麼
告訴我 告訴我 你在想什麼
排隊了又選擇回頭
這樣要我 怎麼接受

要不要 跟我出去走一走
但每次你的藉口 都是說
你這次是真的沒空
該怎麼 試著勇敢說出口
好想要你的雙手 接住我
我真的真的寂寞到 無藥可救

又經過初次見面的 路口
「你好嗎？要去哪？」
美好回憶雖然破碎 於終
卻全都 被拼湊 成又一波悸動

會害羞 會臉紅 是我無法直視你的理由
才會沈默不說
告訴我 告訴我 你在想什麼
到底是愛我不愛我
EMO半天還是不懂

要不要 跟我出去走一走
你每次這樣問我 我總說
我這次是真的沒空
好想讓你知道我想什麼
怕是自己想太多 其實我
也真的真的寂寞到 無藥可救

要不要 跟我出去走一走
你想牽的那雙手 就是我
這次 就別再說沒空
終於要 跟你出去走一走
我已經等了好久 好久
這次不再囉嗦牽起你 (我) 的手
以後都不再寂寞 只要跟你走`,
    image: "images/1761794629499-316540195.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761794799113",
    title: "我喜歡你",
    creators: ["芒果醬"],
    lyricist: ["郭佐治"],
    composer: ["郭佐治"],
    albums: "心跳保衛戰",
    release_date: "2023-12-21",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `喔愛 什麼是愛
你看我的眼神怎麼這麼可愛
若是講你的心親像大海
我也會甘願 為了你暈船
喔喔喔愛 什麼是愛
你看我的眼神甘嘸一絲絲愛
真想欲在這個花花世界
帶你去一個 溫暖的所在
Now I just want hold you tight, oh baby don’t cry.
I miss you in this rainy night.
I’ll show you the best in my mind.
Let’s dance in the night.
I will sing a song for you, the love in my eyes.
喔喔喔愛 有你的將來
我對你的感情我講不出來
在這個風風雨雨的世界
你敢會嫌棄 我騎摩托車
喔喔喔愛 有我的未來
我對你的感情我要講出來
在這個風風雨雨的世界
我永遠在這 等你瞭解
喔喔喔愛
喔愛 什麼是愛
你看我的眼神有一絲悲哀
真想欲在這個混亂世界
做你的心中 安身的所在
Now I just want hold you tight, oh baby don’t cry.
I miss you in this rainy night.
I’ll show you the best in my mind.
Let’s dance in the night.
I’ll write a poem for you, the love in my eyes.
喔喔喔愛 有你的將來
我對你的感情我講不出來
在這個風風雨雨的世界
你敢會嫌棄 我騎摩托車
喔喔喔愛 有我的未來
我對你的感情我要講出來
在這個吵吵鬧鬧的時代
請你站在這 在這聽我說
我喜歡你 我喜歡你
我喜歡你 我喜歡你
我喜歡你 我喜歡你
我喜歡你
我喜歡你 我喜歡你
我喜歡你 我喜歡你
我喜歡你 我喜歡你
我喜歡你
喔愛 什麼是愛
我對你的感情甘可以叫作愛
若是有一天你想要瞭解
我永遠在這 我予你時間
喔喔喔愛`,
    image: "images/1761794799048-677661732.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761795056281",
    title: "5:10am",
    creators: ["傻子與白癡"],
    lyricist: ["蔡維澤"],
    composer: ["蔡維澤"],
    albums: "夜長夢少",
    release_date: "2019-08-16",
    language: "中文",
    genre: "流行",
    lyrics: `樹影搖晃 酒鬼們成群遊蕩
街燈夜巷 野狗三三兩兩
星星月亮夜色茫茫跟生活一樣
年輕的人們該去哪
 
過得幸福 總會夢想跌些傷
還沒長大 細數我們兒時扯得謊
一半信誓旦旦的想 一半是夢話
這樣的我們該去哪
 
今天要打哪兒晃
鬧鐘還沒響
不甚急迫的憂傷
一成不變的日子與期望
 
我該是什麼樣
一生這麼長
輾轉後不見天亮
多少夢想被穩當往裏藏
 
酒配幾包煙
閑來又一天
這天氣惹人嫌
那傲氣怎麼收斂 便視而不見
我沒想太遠
見識也太淺
本就不屑從前
故事沒有開頭 自然沒有結尾
 
幾分安然就幾分賤
無所事事的成為 那差不多的誰
不平庸也不特別
我也踅了幾圈 然後回到原點
原則都丟一邊 只談成全
 
面子值幾分錢 沒再管要不要臉
一狗票的成見 撿一個當標籤
放任情緒爛成一堆裝得隨便繼續再演
 
要打哪兒晃
鬧鐘還沒響
不甚急迫的憂傷
一成不變的日子與期望
 
我該是什麼樣
一生這麼長
輾轉後不見天亮
多少夢想被穩當往裏藏`,
    image: "images/1761795056128-152686460.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761795259391",
    title: "擱淺的人",
    creators: ["康士坦的變化球"],
    lyricist: ["康士坦的變化球"],
    composer: ["康士坦的變化球"],
    albums: "擱淺的人",
    release_date: "2016-12-01",
    language: "中文",
    genre: "流行",
    lyrics: `麻痺的人生習慣我討厭的生活
麻痺的人生習慣你自己很爛啊
麻痺的人生習慣痛苦的關係
但是你又習慣和那個人在一起
麻痺的人生習慣每個月都把錢花光
麻痺的人生習慣你自己很賤吶
麻痺的人生習慣我身體的脂肪
我甚至習慣我討厭自己的樣子

他們所有的彷彿美好一切
我的不過就是那些
無力去面對不需要再改變
這全都是因為
我感覺不到痛

擱淺的人早習慣啦
就這樣吧算了啊
懦弱的人別改變啦
就這樣吧算了啊

我重複的說變成了期待的畫面
我重複的說自己都相信了一切

沒關係了我其實習慣討厭的生活
沒關係了我其實習慣自己很爛
沒關係了我其實習慣痛苦的關係
沒關係了我習慣和那個人在一起
沒關係了我習慣每個月把錢花光
沒關係了我其實習慣自己很窮
沒關係了我習慣逃避問題的方式
我甚至習慣我討厭自己的樣子

擱淺的人早習慣啦
就這樣吧算了啊
懦弱的人別改變啦
就這樣吧算了啊

擱淺的人早習慣啦
就這樣吧算了啊
懦弱的人別改變啦
就這樣吧就這樣啊

擱淺的人早習慣啦
就這樣吧算了啊
懦弱的人別改變啦
就這樣吧算了啊`,
    image: "images/1761795259315-522336967.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761878313175",
    title: "風",
    creators: ["芒果醬"],
    lyricist: ["郭佐治"],
    composer: ["郭佐治", "蔡有倫"],
    albums: "風",
    release_date: "2025-10-31",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `喔喔　哎呀哎呀哎呀　哎唷喂呀
我卻沒把話說出口　一顆琥珀
要用多少個夏天來留住螢火蟲

喔哎呀　哎唷喂呀　
我終究是弄丟了你　我的流星
眼看著　風帶你來　風帶你走

（揣啊揣　揣啊揣　揣無你形影）
我欲離開遮　覕去無人的世界
（吹啊吹　吹啊吹　無講一句話　
　吹啊吹　吹啊吹　我的心遮爾痛）
無講一句話　我的心遮爾疼　哈啊

那天　選擇隱藏
想不到風在臉上
是如此滾燙　無聲無瑕

我們只望向　遠方
一波一波的海浪
你的呼吸　如常
輕撫我的胸膛

我們說明天見
但花滿的庭園已是一片荒蕪
每當風來　思念就散塌

風　
抱歉我說不出口　是我的錯
風

喔喔　哎呀哎呀哎呀　哎唷喂呀
我卻沒把話說出口　一座湖泊
要用多少個漣漪來忘了風來過

喔哎呀　哎唷喂呀　
我再無法正眼看你　我的倒影
眼看著　風來風去　人來人走

（揣啊揣　揣啊揣　揣無你形影）
我欲離開遮 覕去無你的世界
（吹啊吹　吹啊吹　無講一句話）
（吹啊吹　吹啊吹　我的心遮爾疼）
心囥一句話　哪會感覺遮爾疼 　哈啊

哪天　終於原諒
臉上　粼粼的波光
對自己說聲　歡迎回家

我們只望向　遠方
一波一波的海浪
你的呼吸　如常
輕撫我的胸膛

我們說明天見
但花滿的庭園已是一片荒蕪
每當風來　思念就散塌

我們只望向　遠方
一波一波的海浪
我的呼吸　永遠
無法描繪出風　和　你的模樣

說完了明天見
就答應彼此　不再掉眼淚
愛是謊言　又如此真實

風　
讓我的餘生成魔　不再回頭
風`,
    image: "images/1761878313165-452628874.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761933498721",
    title: "My Name is Malguem",
    creators: ["QWER"],
    lyricist: ["전소연"],
    composer: ["전소연", "Pop Time", "Daily", "Likey"],
    albums: "Algorithm's Blossom",
    release_date: "2024-09-23",
    language: "韓文",
    genre: "",
    lyrics: `어쩌다 고작 그 마음도 못 참고
怎麼會連這點感情都無法忍住


멍청하게 다 던졌는지
傻傻地就全都脫口而出了呢？


뭔가 들켜 버린 것 같아
似乎有什麼被發現了


표정을 보니 말이야
光從你的表情就能察覺到


나도 티가 나버린 고백에
我也被這昭然若揭的告白


얼마나 놀랐는지 몰라
嚇得不知該如何是好


매일 치는 장난에도 두근댔고
儘管只是日常的玩笑卻也會感到心跳不已


오늘도 몇 번이고 떨렸지만
今天也不知心動了幾次


약속했어 날 안아줘 좀 알아줘
約好了 擁抱我 察覺我的心意吧


이건 꿈에서만 하기야
這些都是只有在夢中才敢說出口的話啊


무심코 던진 니 말에 하루 종일 설레어 
你的無心玩笑能使我整天怦然心動


간직했다 아무도 못 보게 일기장에 적어
將它們寫在日記本中珍藏 不讓任何人知曉 


단단히 잠궜었는데
明明已經牢牢地鎖上了



어쩌다 고작 그 마음도 못 참고
怎麼會連這點感情都無法忍住


멍청하게 다 던졌는지
傻傻地就全都脫口而出了呢？


꾹꾹 참고 또 꼭꼭 숨겨서
拼命地忍住 好好地隱藏在心底


이제까지 잘해 왔잖아
明明到目前為止都做得很好不是嗎？


그러다 고작 울음도 못 참고
再這樣下去 連眼淚也忍不住


괜찮다 말하며 
一邊說著沒事


두 눈은 퉁퉁 붓고 코맹맹이가 되어도 난
雙眼卻愈發腫脹 哽咽透出鼻音的我


내일은 맑음
明天必將放晴



예전처럼 옆에서 밥 먹어도
就算一如既往般地在你身旁吃飯


우연히 눈이 살짝 마주쳐도 (걱정 마)
偶然與你對視（也請不要擔心）


날 안아줘 아니 사랑해줘
擁抱我吧 不 愛上我吧


이건 꿈에서만 하니까
反正也只是在夢中才能得到的回應


무심코 던진 니 말에 하루 종일 설레어 
你的無心之語能使我整天怦然心動


간직했다 아무도 못 보게
為了把他珍藏起來不讓任何人知曉


꼬깃꼬깃 구겨
明明將它撕下揉成團


씹어 다 삼켰었는데
全部吞進肚子裡面了


어쩌다 고작 그 마음도 못 참고
怎麼會連這點感情都無法忍住


멍청하게 다 던졌는지
傻傻地就全都脫口而出了呢？


꾹꾹 참고 또 꼭꼭 숨겨서
拼命地忍住 好好地隱藏在心底


이제까지 잘해 왔잖아
明明到目前為止都做得很好不是嗎？


그러다 고작 울음도 못 참고
再這樣下去 連眼淚也忍不住


괜찮다 말하며 
一邊說著沒事


두 눈은 퉁퉁 붓고 코맹맹이가 되어도 난
雙眼卻愈發腫脹 哽咽透出鼻音的我



사실 나 (Ah)
其實啊 我呢


아주 오래 울 것 같아
可能會傷心很久很久吧


고작 친구도 못 되니까
因為和你已經連朋友都做不成了


툭툭 털고 활짝 웃을 만큼
能手一揮擦去眼淚就開懷大笑什麼的


나는 그리 강하지가 않아
我還沒有那麼堅強


그러다 
接著


고작 사랑이 뭐라고 괜찮다 말하는 날까지
直到能平靜地道出這份感情的點滴為止


꾹꾹 참고 또 일기나 쓰고 있어 나
我會好好地忍住 將它們記錄在日記本裡


내 이름 맑음
我的名字是晴天


中文翻譯：花生什麼素`,
    image: "images/1761933498686-518854895.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761933673763",
    title: "愛呀愛呀愛",
    creators: ["Crispy脆樂團"],
    lyricist: ["盧羿安"],
    composer: ["盧羿安"],
    albums: "願你愛自己，像我愛你一樣",
    release_date: "2025-10-16",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `你的模樣 是什麼樣
生活匆匆忙忙 日子久久長長
愛上的那個人 在不在身旁

你的模樣 是什麼樣
有時候 回頭望 作的夢還沒忘
掉過淚 受過傷 沒關係

是因為 愛呀愛呀 愛呀愛呀
愛呀愛呀 愛
都因為 愛呀愛呀 愛呀愛呀
愛呀愛呀 愛

就算青春 是場賭注
讓我愛你 義無反顧
牽著手 一起唱 一起走 一起笑 一起哭
不辛苦 不辛苦

而你把自己 擱在一旁
該堅強 卻健忘
該輝煌 卻退讓
就算白忙一場 也圓了個謊

你的時間 順理成章
歲月走得猖狂 日子走成年華
來不及 說的話 每一句

都是 愛呀愛 呀愛

就算青春 是場賭注
讓我愛你 義無反顧
牽著手 一起唱 一起走 一起笑 一起哭
不辛苦 不認輸

就算明天 庸庸碌碌
讓我愛你 義無反顧
前方是 你的愛 你的夢 你的痛 你的路
不辛苦 不辛苦 Huu-Huu

願黑暗前方 一片晴朗
就算看不到光 就算一片荒涼
我願意 我願意 一起闖 一起唱

愛呀愛呀 愛呀愛呀
愛呀愛呀 愛
一起唱 愛呀愛呀 愛呀愛呀
愛呀愛呀 愛
願你的舞步 輕盈如光`,
    image: "images/1761933673747-744711433.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761933893259",
    title: "Bitter Sweet",
    creators: ["芒果醬"],
    lyricist: ["郭佐治"],
    composer: ["郭佐治"],
    albums: "新・寶島少年？",
    release_date: "2022-06-30",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `你辭了高薪工作開了夢想的咖啡店
平凡的裝潢設備煮著偉大的信念
但你沒想過柴米油鹽房租和水電
浪漫拿鐵突然間變成苦澀的黑咖啡

Hey！ 那個咖啡少年你不要放棄
你曾經說要做世界第一
就算現實中有太多壓力
你還是要勇敢向前行
Hey！ 那個咖啡少女妳不要忘記
妳心上堅持到底的刺青
就算精疲力盡看著樓梯
妳還是要用力爬上去


日曆一天撕一年用青春容顏交換事業
合作吃虧談判妥協當初的熱情漸漸消退
在這狼藉的爛泥 低頭看雨水放映的流星
走過熱浪大雪的雙膝 還有僅存的一絲勇氣

Hey！ 那個咖啡少年你不要放棄
你曾經說要做世界第一
就算現實中有太多壓力
你還是要勇敢向前行
Hey！ 那個咖啡少女妳不要忘記
妳心上堅持到底的刺青
就算那樓梯有太多情緒讓你窒息
妳還要回家去

啊這是你的夢你毋通放棄呀
就算天頂崩落來地牛也翻身
啊這是你的夢你毋通袂記呀
就算失敗無望嘛愛勇敢承擔

Hey！ 那個吉他少年我不會放棄
你一定會變成搖滾巨星
我知道你每夜偷掉的淚滴
你要相信晨曦會來臨
Hey！ 那個吉他少年我不會忘記
我們一定要做世界第一
是那個雨季哭倒在雨中勇敢的你跟自己的約定
Let’s go！`,
    image: "images/1761933893048-154748335.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761983461265",
    title: "去飛翔",
    creators: ["麋先生"],
    lyricist: ["吳聖皓"],
    composer: ["吳聖皓"],
    albums: "去飛翔",
    release_date: "2025-02-17",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `今天你是否一如往常就柴米油鹽醬醋茶
許類似的願望 又累死了一個願望
今天你是否差點遺忘
要帶點幽默和笑話
生活噪音漸強 也別自顧自地堅強
為你的天空畫一雙翅膀
就試著去飛翔
回程的方向點一盞月亮看看這一路上 多漂亮
一筆一劃一字一句以前以後什麼是你最在意的夢
總有個人為你的喜怒一字不漏
再多說些什麼
就讓我來陪著你的喜新念舊為生命留句到此一遊
所有不確定都跟著我慢慢點頭也不怕回過頭
為你的天空畫一雙翅膀
就試著去飛翔
回程的方向點一盞月亮看看這一路上 多漂亮
一筆一劃一字一句以前以後什麼是你最在意的夢
總有個人為你的喜怒一字不漏
再多說些什麼
就讓我來陪著你的喜新念舊為生命留句到此一遊
所有不確定都跟著我慢慢點頭也不怕回過頭
為你的天空畫一雙翅膀
就試著去飛翔
回程的方向點一盞月亮看看這一路上多漂亮`,
    image: "images/1761983461198-216884814.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761986280375",
    title: "Lemon",
    creators: ["米津玄師"],
    lyricist: ["米津玄師"],
    composer: ["米津玄師"],
    albums: "STRAY SHEEP",
    release_date: "2018-03-14",
    language: "日文",
    genre: "",
    lyrics: `夢ならばどれほどよかったでしょう
yume naraba dorehodo yokatta deshou
如果這一切都只是場夢的話該有多好

未だにあなたのことを夢にみる
imada ni anata no koto wo yume ni miru
時至今日仍會在夢境裡追尋你的身影

忘れた物を取りに帰るように
wasureta mono wo tori ni kaeru youni
像是要轉身取回遺落物似地

古びた思い出の埃を払う
furubita omoide no hokori wo harau
輕輕拂去陳舊記憶上的塵埃


戻らない幸せがあることを
modoranai shiawase ga aru koto wo
世上有著再也回不去的幸福

最後にあなたが教えてくれた
saigo ni anata ga oshiete kureta
是你在最後讓我懂得這件事

言えずに隠してた昏い過去も
iezu ni kakushiteta kurai  kako mo
說不出口而埋藏心底的晦暗曾經

あなたがいなきゃ永遠に昏いまま
anata ga inakya eien ni kurai mama
若沒了你就只能永遠地黯淡無光


きっともうこれ以上　傷つくことなど
kitto mou kore ijyou　kizu tsuku koto nado
深刻體會到肯定不會再有

ありはしないとわかっている
ari wa shinaito wakatte iru
比這還要讓我心碎的經歷


あの日の悲しみさえ　あの日の苦しみさえ
ano hi no kanashimi sae　ano hi no kurushimi sae
那一日的悲傷也好      那一日的苦痛也好

そのすべてを愛してた　あなたとともに
sono subete wo aishiteta　anata to tomoni
這一切我都曾深愛過      連同已離去的你

胸に残り離れない　苦いレモンの匂い
mune ni nokori hanarenai　nigai remon no nioi
殘存於心久久不散的   苦澀檸檬的香氣

雨が降り止むまでは帰れない
ame ga furiyamu made wa kaerenai
我會繼續困在雨中直至放晴

今でもあなたはわたしの光
ima demo anata wa watashi no hikari
如今你也仍然是引領我的光


暗闇であなたの背をなぞった
kurayami de anata no se wo nazotta
我在黑暗中描摹你的背影

その輪郭を鮮明に覚えている
sono rinkaku wo senmei ni oboete iru
記憶中你的輪廓無比鮮明

受け止めきれないものと出会うたび
uke tome kirenai mono to deau tabi
每當湧出承受不住的情感

溢れてやまないのは涙だけ
afurete yamanai no wa namida dake
也僅能任由淚水潰堤而下


何をしていたの　何を見ていたの
nani wo shiteita no　nani wo miteita no
你做了些什麼呢   看見了什麼呢

わたしの知らない横顔で
watashi no shiranai yokogao de
以那張我不再熟悉的側臉


どこかであなたが今　わたしと同じ様な
dokoka de anata ga ima　watashi to onaji youna
不知身處何方的你      若此刻與我同樣地

涙にくれ　淋しさの中にいるなら
namida ni kure　sabishisa no naka ni iru nara
淚如泉湧   深陷於喪失的孤寂之中

わたしのことなどどうか　忘れてください
watashi no koto nado douka　wasurete kudasai
就請你忘了有關我的一切吧

そんなことを心から願うほどに
sonna koto wo kokoro kara negau hodo ni
我是如此強烈地由衷期望

今でもあなたはわたしの光
ima demo anata wa watashi no hikari
如今你也仍然是引領我的光


自分が思うより
jibun ga omou yori
我比自己以為的

恋をしていたあなたに
koi wo shiteita anata ni
還更加深愛著你

あれから思うように
are kara omou youni
自那以來便無法

息ができない
iki ga dekinai
如願地找回平靜


あんなに側にいたのに
anna ni soba ni itanoni
你曾是那麼近在咫尺

まるで嘘みたい
marude uso mitai
那般過往卻有如謊言

とても忘れられない
totemo wasure rarenai
無論如何都忘不了你

それだけが確か
sore dake ga tashika
唯有這點無庸置疑


あの日の悲しみさえ　あの日の苦しみさえ
ano hi no kanashimi sae　ano hi no kurushimi sae
那一日的悲傷也好      那一日的苦痛也好

そのすべてを愛してた　あなたとともに
sono subete wo aishiteta　anata to tomoni
這一切我都曾深愛過      連同已離去的你

胸に残り離れない　苦いレモンの匂い
mune ni nokori hanarenai　nigai remon no nioi
殘存於心久久不散的   苦澀檸檬的香氣

雨が降り止むまでは帰れない
ame ga furiyamu made wa kaerenai
我會繼續困在雨中直至放晴

切り分けた果実の片方の様に
kiri waketa kajitsu no katahou no youni
宛如那切半果實的其中一片

今でもあなたはわたしの光
ima demo anata wa watashi no hikari
如今你也仍然是引領我的光


中文翻譯：竹子

羅馬翻譯：理璃(ルリ)`,
    image: "images/1761986280374-274059455.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1761986639922",
    title: "法國片",
    creators: ["輕晨電"],
    lyricist: ["隋玲", "小英", "以豪"],
    composer: ["隋玲", "小英", "孟書"],
    albums: "法國片",
    release_date: "2015-07-10",
    language: "中文",
    genre: "",
    lyrics: `你迷戀片中高貴衣領
你迷戀片中諷刺揶揄
你迷戀片中迷人香氣
你迷戀片中曖昧言語

我嚮往你的翩然華麗
我貪婪你的誘惑唇形
我沉迷你的固執任性
我蒐集你的控訴神情

你始終只適合活在
三五釐米的焦距
看似傲慢的姿態
卻說著荒謬的獨白
你始終只適合活在
三五釐米的焦距
擅長浪漫的胸懷
是不著邊際的情愛

你嚮往片中曲折戀曲
我沉醉你的呢喃絮語
你迷戀片中弔詭騙局
我貪婪你的撲朔迷離

你始終只適合活在
三五釐米的焦距
看似傲慢的姿態
卻說著荒謬的獨白
你始終只適合活在
三五釐米的焦距
擅長浪漫的胸懷
是不著邊際的情愛`,
    image: "images/1761986639820-329631942.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762012051278",
    title: "離開台北",
    creators: ["TRASH"],
    lyricist: ["阿夜"],
    composer: ["阿夜"],
    albums: "Holy Trip!",
    release_date: "2021-09-24",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `該上路了沒
心還留在那一條街
擁擠的人潮中我遺失了
應該留住的原點

先別說再見
我還沒有收拾好眷戀
後車廂已經超載的委屈
我先讓它消失人間

其實我知道在這分岔點
會讓妳到不同的平行世界
而我也知道每晚的星空
會閃爍起妳最迷人的側臉
原諒我放下這一切離開台北

準備好了沒
人生就是不斷得往前
還來不及說的一聲抱歉
在夢裡和妳相見

最後一根菸
它燒得好像不太甘願
告別迷惘的街流連的夜店
最後還是該說再見

其實我知道在這分岔點
會讓妳到不同的平行世界
而我也知道每晚的星空
會閃爍起妳最迷人的側臉
原諒我放下這一切離開台北

I will never forget
You want me to be happy
Although you're already gone
But I will be fine

其實我知道在這分岔點
會讓妳到不同的平行世界
而我也知道每晚的星空
會閃爍起妳最迷人的側臉
原諒我放下這一切

離開台北`,
    image: "images/1762012051213-476940204.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762012358281",
    title: "天空織成",
    creators: ["胡凱兒"],
    lyricist: ["邱建豪", "謝浩澤"],
    composer: ["邱建豪", "謝浩澤", "梁方文", "林嘉恩"],
    albums: "天空織成",
    release_date: "2025-05-20",
    language: "中文",
    genre: "",
    lyrics: `迎著風 掠過無垠天空
滿載著 我們許下的夢
牽起身邊 你緊握住的雙手
即使脆弱 我依然執著

當世界 如此難以捉摸
誰又能 畫出完整輪廓
身上的傷 是冒險過的光榮
有你陪我 就不覺得痛

如果 終究只停在 如果
迷惑又怎麼遼闊
放手探索 放心去揮霍
我始終在你左右

再往前走 別回頭 只能夠
向著未來不停奔跑 找到自由
也受傷過 失去過 才能夠
用最勇敢的溫柔 造下一個夢

這條路 就算蜿蜒顛簸
也不想 慢下腳步等候
迎向明天 仍閃爍著的眼眸
放下困惑 再放手一搏

如果 就別只停在 如果
把迷惑 走成遼闊
放手探索 放心去揮霍
我依然在你左右

再往前走 別回頭 只能夠
向著未來不停奔跑 找到自由
也受傷過 失去過 才能夠
用最勇敢的溫柔 造下一個夢

別怕寂寞 黑暗中 會有我
陪著你等待 天亮後的出口
再讓蔚藍 的天空 把我們
一路上的沉重 編織成雲朵

再往前走 別回頭 只能夠
向著未來不停奔跑 找到自由
也受傷過 失去過 才能夠
用最勇敢的溫柔 造下一個夢

往前走 別回頭
找到自由
把迷惑 走成遼闊
我在你左右

往前走 別回頭
我在你左右`,
    image: "images/1762012358280-830334780.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762012601179",
    title: "敢有人愛我",
    creators: ["芒果醬"],
    lyricist: ["郭佐治"],
    composer: ["郭佐治"],
    albums: "核核核",
    release_date: "2024-12-30",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `路邊的花
自由自在咧搖
風吹來我的目箍紅
想起你敢有聽著

曾經我期盼的一切
如今攏已經開花
才知影 彼工
佮你鬥陣看煙火

「猶原是我這世人上快樂的時陣」

這世間
敢有人愛我 敢有人會心疼
又騎到淡水海岸
「你永遠遮爾美麗 我遮爾骯髒」
為什麼今夜的雨水 閣落袂停啊

敢有人愛我 敢有人會心疼
月娘也無欲插我
起起落落的海湧 亂我的軟汫
敢講我的一生 只是一場空

這世間
敢有人愛我 敢有人會心疼
又騎到淡水海岸
你永遠遮爾美麗 我遮爾骯髒
為啥物我的目屎 閣落袂停(啊)

規心肝咧振動 全世界攏無聲
只賰我一个人
聲聲句句的海湧 亂我的咒誓
敢講我的一生 只是一蕊

盛開佇天頂的夢
長如夏天 短如煙火`,
    image: "images/1762012600918-687927499.jpeg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762012886364",
    title: "我打工的咖啡廳",
    creators: ["那我懂你意思了"],
    lyricist: ["陳修澤"],
    composer: ["陳修澤"],
    albums: "原諒我不明白你的悲傷",
    release_date: "2012-12-20",
    language: "中文",
    genre: "",
    lyrics: `他總是每天牽著狗到這家咖啡廳
靜靜看著書 炫耀他的狗有多美麗

她總是和不同男人約在這家咖啡廳
打扮的亮麗 訴說著 她滄桑的過去

他們笑著 討論彼此曾經受過的傷
在這短暫的時間裡 他們不覺得痛吧

就像飛蛾在黑暗中跟隨光芒
就像毛蟲在找能結繭的樹
就像貓在垃圾堆中找食物
就像他 不能停止面對孤獨

我知道 這一切最後都會過去
我知道 總有一天都會結束
我知道 我會不可避免的忘記
只希望 我能永遠不會失去

他上班前會順路 買杯不加糖的咖啡
強迫自己 面對每天 工作的忙碌

她買了黑咖啡坐下翻開考試的書
皺著眉試圖要了解 難懂的題目

他們努力的想著 應該要前進的方向
在這短暫的時間裡 他們也許有解答

就像飛蛾在黑暗中跟隨光芒
就像毛蟲在找能結繭的樹
就像貓在垃圾堆中找食物
就像他 不能停止面對孤獨

我知道 這一切最後都會過去
我知道 總有一天都會結束
我知道 我會不可避免的忘記
只希望 我能永遠不會失去


我把希望寄託在這首歌裡
雖然它只擁有平凡的旋律
我仍然用力的用力吶喊著
吶喊一些小小平凡的心情

我知道 這一切最後都會過去
我知道 總有一天都會結束
我知道 我會不可避免的忘記
只希望 我能永遠不會失去

失去你

失去你`,
    image: "images/1762012886323-707996943.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762013045157",
    title: "花海",
    creators: ["周杰倫 Jay Chou"],
    lyricist: ["古小力", "黃淩嘉"],
    composer: ["周杰倫"],
    albums: "魔杰座",
    release_date: "2008-10-15",
    language: "中文",
    genre: "流行",
    lyrics: `靜止了 所有的花開
遙遠了 清晰了愛
天鬱悶 愛卻很喜歡
那時候 我不懂 這叫愛
妳喜歡 站在那窗台
妳好久 都沒再來
彩色的時間染上空白
是妳流的淚暈開

不要妳離開 距離隔不開
思念變成海 在窗外進不來
原諒說太快 愛成了阻礙
手中的風箏放太快回不來
不要妳離開 回憶劃不開
欠妳的寵愛 我在等待重來
天空仍燦爛 它愛著大海
情歌被打敗 愛已不存在

你喜歡 站在那窗台
妳好久 都沒再來
彩色的時間染上空白
是妳流的淚暈開

不要妳離開 距離隔不開
思念變成海 在窗外進不來
原諒說太快 愛成了阻礙
手中的風箏放太快回不來
不要妳離開 回憶劃不開
欠妳的寵愛 我在等待重來
天空仍燦爛 它愛著大海
情歌被打敗 愛已不存在`,
    image: "images/1762013044997-433304002.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762013182196",
    title: "幾分之幾",
    creators: ["盧廣仲"],
    lyricist: ["盧廣仲"],
    composer: ["盧廣仲"],
    albums: "幾分之幾",
    release_date: "2018-02-02",
    language: "中文",
    genre: "",
    lyrics: `記得那天 太陽壓著平原
風慢慢吹 沒有人掉眼淚
一切好美 好到我可以不用說話

金色的側臉 踩著全白球鞋
風繼續吹 世界繼續作業
那麼確定 我知道那就是你

那一天你走進了我的生命
謝謝你成為了我的幾分之幾
閉上眼睛也能看見你
晴朗的南方

就算犯錯 你拿歲月等我
就算停留 還有你和夜空
我算什麼讓你無條件的為我

那一天你走進了我的生命
謝謝你成為了我的幾分之幾
如果我又更完整一點 也是因為你

某一天你離開了我的生命
謝謝你曾經是我的幾分之幾
感覺你貼著我胸口呼吸
在那一個回不去的天明

我的 幾分之幾
你終於還是離開我的生命
留下每天都在變老的我
請記得我曾經 愛過`,
    image: "images/1762013182195-521732613.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762013423344",
    title: "知足",
    creators: ["五月天"],
    lyricist: ["阿信"],
    composer: ["阿信"],
    albums: "知足 just my pride 最真傑作選",
    release_date: "2005-08-26",
    language: "中文",
    genre: "流行",
    lyrics: `怎麼去擁有 一道彩虹
怎麼去擁抱 一夏天的風
天上的星星 笑地上的人
總是不能懂 不能覺得足夠

如果我愛上 你的笑容
要怎麼收藏 要怎麼擁有
如果你快樂 不是為我
會不會放手 其實才是擁有

當一陣風吹來 風箏飛上天空
為了你而祈禱 而祝福 而感動
終於你身影 消失在人海盡頭
才發現 笑著哭 最痛

那天你和我 那個山丘
那樣的唱著 那一年的歌
那樣的回憶 那麼足夠
足夠我天天 都品嚐著寂寞



當一陣風吹來 風箏飛上天空
為了你而祈禱 而祝福 而感動
終於你身影 消失在人海盡頭
才發現 笑著哭 最痛

當一陣風吹來 風箏飛上天空
為了你而祈禱 而祝福 而感動
終於你身影 消失在人海盡頭
才發現 笑著哭 最痛

如果我愛上 你的笑容
要怎麼收藏 要怎麼擁有
如果你快樂 再不是為我
會不會放手 其實才是擁有

知足的快樂 叫我忍受心痛
知足的快樂 叫我忍受心痛`,
    image: "images/1762013423276-130968665.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762013567151",
    title: "你給過我的快樂",
    creators: ["胡凱兒"],
    lyricist: ["林嘉恩", "梁方文", "謝浩澤", "陳廷曜"],
    composer: ["謝浩澤"],
    albums: "天色",
    release_date: "2023-07-26",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `你這次沒有再說
沒有再執著誰對誰錯
是誰先沈默
誤會成自由
才裝作我不難過
在突然想念的時候
你這次沒有回頭
沒有再埋怨我的承諾
都言不由衷
只是為什麼
還貪戀你的溫柔
卻睡不回上一場夢
我是不是真的 放下你了
你是不是也捨不得只是
不再相信我們值得 揮霍我們
我還不能坦承
把你無助的眼神
錯怪成了我們可能
習慣了總會失而復得
猶豫著最後卻都放棄了驗證
我還不能確認
被你佔據才感覺
完整了的那些部分
那些你給過我的快樂
還是不是我的
我還不能坦承
把你遺忘的旅程
錯怪成了你也默認
習慣了總是有人在等
卻被時間拆散了
我還不能確認
繞得更遠卻陷得
更深的那些部分
那些你給過我的快樂
還是不是我的`,
    image: "images/1762013567150-829004817.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762699281203",
    title: "相愛就是說了100次對不起",
    creators: ["Crispy脆樂團"],
    lyricist: ["盧羿安"],
    composer: ["盧羿安"],
    albums: "愛是我們必經的辛苦",
    release_date: "2022-09-19",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `你喜歡什麼都不說
喜歡皺眉頭
說我想太多
沒關係我懂

你喜歡清晨的頂樓
喜歡很自由
想像有一瞬間
什麼煩惱都沒有

好險這個壞掉的世界裡
有你抓緊我

相愛就是說了一百次對不起
長大就是聽了一萬次沒關係
多少的淚水都沒辦法
把我變成你

如果說這一生有一件事最幸運
就是賭中億分之一的機率遇見你
我還是我自己
但是沒關係
因為我愛你

我喜歡和你牽著手
喜歡輕輕相擁
在你耳邊說
It’s us against the world

好險這個壞掉的世界裡
有你抓緊我

相愛就是說了一百次對不起
長大就是聽了一萬次沒關係
多少的淚水都沒辦法
把我變成你

如果說這一生有一件事最幸運
就是賭中億分之一的機率遇見你
我還是我自己
但是沒關係
因為我愛你

對 對 對不起 沒 沒 沒關係

好險 快樂與悲傷的淚水
都和你一起

相愛就是說了一百次對不起
長大就是聽了一萬次沒關係
多少的淚水都沒辦法
把我變成你

如果說這一生有一件事最幸運
就是賭中億分之一的機率遇見你
我還是我自己
但是沒關係
因為我愛你
我愛你`,
    image: "images/1762699281124-293414299.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762699850155",
    title: "旅徒",
    creators: ["Control T"],
    lyricist: ["李妮蓁"],
    composer: ["黃正嘉"],
    albums: "旅徒",
    release_date: "2023-10-14",
    language: "中文",
    genre: "",
    lyrics: `這一路上
且留步行
且慢前行

這一路上
有些保留
有些惋惜

有些人徒留情份
有時候想念不及

我走 走在沒有 盡頭的夜裡
燈火都通明
拼湊成繁星
指引 指引
不知道目的

這一路上
且留步行
且慢前行

這一路上
有些保留
有些惋惜

我還是等著你
放不下的
放進一生屢行

我走 走在沒有 盡頭的夜裡
燈火都通明
拼湊成繁星
指引 指引
不知道目的

我走 走不出來 來時的牽絆
拽著不安
拼湊成遺憾
只因 只因
愛能被證明

旅徒
要虔誠相信`,
    image: "images/1762699849907-395467857.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762699948932",
    title: "海浪",
    creators: ["deca joins"],
    lyricist: ["鄭敬儒"],
    composer: ["鄭敬儒"],
    albums: "Go Slow",
    release_date: "2018-11-14",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `盼著望著 但明天太遠了
我還等待著 被拖延的人生
但我習慣了 生活是沈悶和孤單的總和
我是個悲哀的空殼

我們走著 順著淡水河
趁著夜色 我想吶喊卻寂靜無聲
但我想通了 必須在沈淪和失望間選擇
今晚的風沒有顏色

這就是我的生活
太陽在墜落
海浪在發愁
不停地退後

這就是我的生活
太陽在墜落
海浪在發愁
不停地退後

這就是我的生活
太陽在墜落
海浪在發愁
不停地退後

這就是我的生活
太陽在墜落
海浪在發愁
不停地退後

這就是我的生活`,
    image: "images/1762699948795-550758318.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762700032356",
    title: "希望你回來",
    creators: ["TRASH"],
    lyricist: ["阿夜"],
    composer: ["阿夜"],
    albums: "Never Die",
    release_date: "2019-11-15",
    language: "中文",
    genre: "",
    lyrics: `我知道此刻你也一樣不甘心
放不下心愛的人匆匆離去
為難你的淚水我拼命擦去
才知道我心中你多了不起

看你演的戲聽你愛的歌
就好像你從沒離開過這
怪自己是凡人無能為力
才會如此想你

我只希望你回來
我只希望你回來
說好要看著我實現
那不切實際的諾言怎能不告而別
還沒準備好去面對沒有你的世界

會不會你現在比從前快樂
少了受傷的心和崩壞的軀殼
答應我不必再對自己苛責
因為你早已經是最棒的人

一生風風雨雨坎坎坷坷
連天上的星星也都不捨
還來不及寫出你盼望的那一首情歌

我只希望你回來
我只希望你回來
說好要看著我實現
那不切實際的諾言怎能不告而別
I don't wanna say goodbye
I don't wanna say goodbye
答應你我會更堅強
當個有骨氣的男人不再輕易流淚
只願這一切能發生在和你道別之前

我只希望你回來
我只希望你回來
說好要看著我實現
那不切實際的諾言怎能不告而別
I don't wanna say goodbye
I don't wanna say goodbye
答應你我會更堅強
當個有骨氣的男人不再輕易流淚
只願這一切能發生再和你道別`,
    image: "images/1762700032208-88426351.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762700253792",
    title: "與浪之間",
    creators: ["VH"],
    lyricist: ["林易祺"],
    composer: ["林易祺"],
    albums: "次等秘密",
    release_date: "2017-01-09",
    language: "中文",
    genre: "",
    lyrics: `黑色的瘋狂 佔據了黑色的你
白色的勇氣 親吻著白色的心
一瞬間 看不清 就想抓住你
離開了 又回去 只想擁抱你

看不見你 也看不見自己
看不見你 就看不見自己

與浪之間 承載著秘密
銀色的光 拉著我跳舞
血液在竄 思緒混亂 不停轉彎
誰在呼喊我

與浪之間 說一個故事
害怕的人 尋一個出口
越走越暗 微光一閃 才看見你
我還在

黑色的瘋狂 佔據了黑色的你
白色的勇氣 親吻著白色的心
一瞬間 看不清 就想抓住你
離開了 又回去 只想擁抱你

看不見你 也看不見自己
看不見你 就看不見自己

與浪之間 承載著秘密
銀色的光 拉著我跳舞
血液在竄 思緒混亂 不停轉彎
誰在呼喊我

與浪之間 說一個故事
害怕的人 尋一個出口
越走越暗 微光一閃 才看見你
我還在
我還在

與浪之間 承載著秘密
銀色的光 拉著我跳舞
血液在竄 思緒混亂 不停轉彎
誰在呼喊我

與浪之間 說一個故事
害怕的人 尋一個出口
越走越暗 微光一閃 才看見你
我還在`,
    image: "images/1762700253495-465986601.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762701898317",
    title: "春泥棒",
    creators: ["ヨルシカ"],
    lyricist: ["n-buna"],
    composer: ["n-buna"],
    albums: "創作",
    release_date: "2021-01-09",
    language: "日文",
    genre: "",
    lyrics: `高架橋を抜けたら雲の隙間に青が覗いた
koukakyou wo nuketara kumo no sukima ni ao ga nozoita
穿過高架橋後 藍天自雲際探出身影

最近どうも暑いからただ風が吹くのを待ってた
saikin doumo atsui kara tada kaze ga fuku no wo matteta
最近實在過於炎熱 只能一心盼望風的到來


木陰に座る
kokage ni suwaru
坐在樹蔭乘涼時

何か頬に付く
nanika hoo ni tsuku
忽然察覺臉龐沾上什麼

見上げれば頭上に咲いて散る
miagereba zujou ni saite chiru
抬頭一看 視野裡繁茂春櫻漫天飄舞


はらり、僕らもう息も忘れて
harari bokura mou iki mo wasurete
落櫻翩躚 我們望得人都出了神

瞬きさえ億劫
matataki sae okkuu
就連眨眼瞬間都嫌可惜

さぁ、今日さえ明日過去に変わる
saa kyou sae ashita kako ni kawaru
啊 今天也會在迎來明天後成為過去

ただ風を待つ
tada kaze wo matsu
只能一心靜候風的到來

だから僕らもう声も忘れて
dakara bokura mou koe mo wasurete
所以我們才會再也回憶不起彼此聲音

さよならさえ億劫
sayonara sae okkuu
就連一句再見也不願說

ただ花が降るだけ晴れり
tada hana ga furu dake hareri
只有花逕自散落 徒留晴空

今、春吹雪
ima harufubuki
此刻 春意紛飛如雪


次の日も待ち合わせ
tsugi no hi mo machiawase
隔天也相約碰面

花見の客も少なくなった
hanami no kyaku mo sukunakunatta
只見賞花人潮消退

春の匂いはもう止む
haru no nioi wa mou yamu
春日不再佇足

今年も夏が来るのか
kotoshi mo natsu ga kuru noka
看來夏天就快步入今年


高架橋を抜けたら道の先に君が覗いた
koukakyou wo nuketara michi no saki ni kimi ga nozoita
穿過高架橋後 妳自道路前方探出身影

残りはどれだけかな
nokori wa doredake kana
人生還剩幾次機會呢

どれだけ春に会えるだろう
doredake haru ni aeru darou
還能再與春天相逢幾回呢


川沿いの丘、木陰に座る
kawazoi no oka kokage ni suwaru
漫步沿岸小丘 乘坐樹蔭底下

また昨日と変わらず今日も咲く花に、
mata kinou to kawarazu kyou mo saku hana ni
一如昨天 春花繁茂 今日再度前來相會


僕らもう息も忘れて
bokura mou iki mo wasurete
我們望得人都出了神

瞬きさえ億劫
matataki sae okkuu
就連眨眼瞬間都嫌可惜

花散らせ今吹くこの嵐は
hana chirase ima fuku kono arashi wa
此刻颳起的狂風吹落櫻花

まさに春泥棒
masani harudorobou
正是竊走春意的小偷

風に今日ももう時が流れて
kaze ni kyou mo mou toki ga nagarete
今日依舊 伴隨風吹 時間倏然即逝

立つことさえ億劫
tatsu koto sae okkuu
就連起身離去都嫌可惜

花の隙間に空、散れり
hana no sukima ni sora chireri
漫天春櫻四散 隱約透出晴空

まだ、春吹雪
mada harufubuki
依舊 春意紛飛如雪


今日も会いに行く
kyou mo ai ni iku
今天也赴約前來見妳

木陰に座る
kokage ni suwaru
乘坐在樹蔭下

溜息を吐く
tameiki wo tsuku
只是不禁感嘆

花ももう終わる
hana mo mou owaru
櫻花即將凋零

明日も会いに行く
asu mo ai ni iku
明天依舊會趕來見妳

春がもう終わる
haru ga mou owaru
春日就快落幕

名残るように時間が散っていく
nagoru youni jikan ga chitteyuku
心中留戀依舊 時間逕自零落


愛を歌えば言葉足らず
ai wo utaeba kotoba tarazu
言語不足以歌詠我的愛

踏む韻さえ億劫
fumu in sae okkuu
就連詩詞押韻都嫌多餘

花開いた今を言葉如きが語れるものか
hana hiraita ima wo kotoba gotoki ga katareru monoka
春櫻爛漫的此刻 豈是文字語言得以盡述


はらり、僕らもう声も忘れて
harari bokura mou koe mo wasurete
落櫻翩躚 我們再也回憶不起彼此聲音

瞬きさえ億劫
matataki sae okkuu
卻連眨眼瞬間都覺可惜

花見は僕らだけ
hanami wa bokura dake
徒留我們獨自賞櫻

散るなまだ、春吹雪
chiru na mada harufubuki
縱使惋惜 依舊 春意紛飛如雪


あともう少しだけ
ato mou sukoshi dake
先是花影零落

もう数えられるだけ
mou kazoerareru dake
再來寥寥可數

あと花二つだけ
ato hana futatsu dake
轉眼僅存一對

もう花一つだけ
mou hana hitotsu dake
最後形單影隻


ただ葉が残るだけ、はらり
tada ha ga nokoru dake harari
枝頭綠葉依舊 落櫻翩躚

今、春仕舞い
ima harujimai
春日 就此閉幕


中文翻譯：大棕熊不吃蜂蜜只吃餡パン`,
    image: "images/1762701898208-173188961.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762702917332",
    title: "多遠都要在一起",
    creators: ["鄧紫棋"],
    lyricist: ["鄧紫棋"],
    composer: ["鄧紫棋"],
    albums: "新的心跳",
    release_date: "2015-11-06",
    language: "中文",
    genre: "流行",
    lyrics: `想聽你聽過的音樂 想看你看過的小說
我想收集每一刻 我想看到你眼裡的世界
想到你到過的地方 和你曾渡過的時光
不想錯過每一刻 多希望我一直在你身旁
未來何從何去 你快樂我也就沒關係
對你我最熟悉 你愛自由我卻更愛你

我能習慣遠距離 愛總是身不由己
寧願換個方式至少還能遙遠愛著你
愛能克服遠距離 多遠都要在一起
你已經不再存在我世界裡 請不要離開我的回憶

想你說愛我的語氣 想你望著我的眼睛
不想忘記每一刻 用思念讓我們一直前進
想像你失落的唇印 想像你失約的旅行
想像你離開的一刻 如果我有留下你的勇氣

我能習慣遠距離 愛總是身不由己
寧願換個方式至少還能遙遠愛著你
愛能克服遠距離 多遠都要在一起
我已經不再存在你的心裡 就讓我獨自守著回憶

如果陽光永遠都熾熱 如果彩虹不會掉顏色
你能不能不離開呢
我能習慣遠距離 愛總是身不由己
寧願換個方式至少還能遙遠愛著你
愛能克服遠距離 多遠都要在一起
你已經不再存在我世界裡 請不要離開我的回憶
請不要離開 不要離開 我的回憶`,
    image: "images/1762702917173-481002346.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762706934470",
    title: "迷路在雲端",
    creators: ["蕭煌奇", "A-Lin"],
    lyricist: ["姚若龍"],
    composer: ["朱康"],
    albums: "迷路在雲端",
    release_date: "2019-10-04",
    language: "中文",
    genre: "流行",
    lyrics: `錯過太遠才懷念 那時的平淡
熟悉不過的習慣
簡單卻最療癒的晚餐
樸素卻帶著愛的早安
怎麼當時會覺得無感

自尊是一種孤單 明明寂寞在擴散
不肯卑微要答案
拿不安不滿發動冷戰
就這樣一步一步走散
幸福就成了到不了的對岸

迷路在雲端
才懂什麼是缺憾
追逐閃亮的璀璨 最後只剩下黑暗
一個人太過不滿足太過極端
會不斷遇上遺憾 Wo Oh~

迷路在雲端
才懂所謂的作伴
不是用我的痛苦 綁架你的罪惡感
是擁抱彼此的獨特還有平凡 放棄夢幻

倔強是一種心酸 思念偽裝成釋然
平靜被眼淚背叛
敢純真的人不懂轉彎
敢掏心的人困在淺灘
浪潮都退了空留往事氾濫

迷路在雲端
才懂什麼是缺憾
追逐閃亮的璀璨 最後只剩下黑暗
一個人太過不滿足太過極端
會不斷遇上遺憾 Wo Oh~

迷路在雲端
才懂所謂的作伴
不是用我的痛苦 綁架你的罪惡感
是擁抱彼此的獨特還有平凡 放棄夢幻

迷路在雲端
回憶像星光閃閃
緊握手心 我們曾無聲吶喊
管故事多鼻酸 管命運多偽善
愛讓人強悍

這個世界有多寬 真愛就多難
感情不應該盤算
並不是換到任何港灣
都會有既愛又懂的伴
為我打算`,
    image: "images/1762706934454-938502390.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762707029947",
    title: "再遇見",
    creators: ["蘇打綠"],
    lyricist: ["吳青峰"],
    composer: ["吳青峰"],
    albums: "秋:故事",
    release_date: "2013-09-18",
    language: "中文",
    genre: "流行",
    lyrics: `只一年的情節，像大雨匆匆打擊過的屋檐，
還凌亂的房間，像吉他用力刷錯幾個和弦。
時間過了幾年，我想，我們都忘了彼此的臉。
難道這叫有緣？我沒想過，我們會再遇見……

故事已經，翻了幾頁。

忽然之間，你忽略的、我忽略的所有細節，
當初的猜疑好奇、愛恨痴嗔卻已走遠。
忽然之間，你發現的、我發現的所有改變，
當初的微笑眼淚、喜怒哀樂都已拋在昨天。

那一年的蛻變，像手術拿掉塞住心上的繭，
還疼痛的感覺，像傷口總得需要時間復原。
掌管命運的神，多想問祢是不是打了個盹？
難道這叫緣份？我沒想過，再遇見的時刻……

所有回憶，青絲成雪。

忽然之間！你忽略的、我忽略的所有細節，
當初的猜疑好奇、愛恨痴嗔卻已希微。
忽然之間，你發現的、我發現的所有改變，
當初的微笑眼淚、喜怒哀樂都已雲煙。

而你，在離開我之後，全沒有改變；
而我，在離開你之後，就一直往前。
轉眼之間，你的世界，一步一步越離越遠，
轉身之前，看到你，卻還依稀覺得有點可憐。

忽然之間，你散盡的、我散盡的全都不見，
當初的我的瘋狂、你的背叛像個笑點。
忽然之間，你經歷的、我經歷的所有謊言，
當初的我的退讓，你的虧欠都不起眼。

而你，在離開我之後，還停在原點；
而我，在離開你之後，不斷往前飛。
轉眼之間，我的世界，一步一步越走越遠，
一念之間，想對你傷害我的一切，說聲謝謝⋯⋯

謝謝再遇見。`,
    image: "images/1762707029859-955536425.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762707222597",
    title: "其實",
    creators: ["薛之謙"],
    lyricist: ["薛之謙"],
    composer: ["薛之謙"],
    albums: "意外",
    release_date: "2013-11-11",
    language: "中文",
    genre: "流行",
    lyrics: `不需要借口 愛淡了就放手
我不想聽 你也沒說 平靜的交錯
隨便找個理由 決定了就別回頭
不愛你的人 說什麼都沒用
分開時難過不能說
誰沒誰不能好好過
那天我們走了很久 沒有爭吵過
分開時難過不要說
如果被你一笑而過
還不如讓你選擇想要的生活
分開後我會笑著說
當朋友問你關於我
我都會輕描淡寫彷彿沒愛過
其實我根本沒人說
其實我沒你不能活
其實我給你的愛比你想的多

分開時難過不能說
誰沒誰不能好好過
那天我們走了很久沒有爭吵過
分開時難過不要說
如果被你一笑而過
還不如讓你選擇想要的生活
分開後我會笑著說
當朋友問你關於我
我都會輕描淡寫彷彿沒愛過
其實我根本沒人說
其實我沒你不能活
其實我給你的愛比你想的多
其實我愛你比你想的多得多`,
    image: "images/1762707222554-191833044.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762707442897",
    title: "可惜沒如果",
    creators: ["林俊傑"],
    lyricist: ["林夕"],
    composer: ["林俊傑"],
    albums: "新地球",
    release_date: "2014-12-15",
    language: "中文",
    genre: "流行",
    lyrics: `假如把犯得起的錯 能錯的都錯過
應該還來得及去悔過

假如沒把一切說破
那一場小風波 將一笑帶過

在感情面前 講什麼自我
要得過且過 才好過

全都怪我
不該沉默時沉默 該勇敢時軟弱
如果不是我 誤會自己灑脫 讓我們難過
可當初的你 和現在的我 假如重來過

倘若那天
把該說的話好好說 該體諒的不執著
如果那天我 不受情緒挑撥 你會怎麼做
那麼多如果 可能如果我
可惜沒如果 只剩下結果

如果早點了解 那率性的你
或者晚一點 遇上成熟的我

不過 oh

全都怪我
不該沉默時沉默 該勇敢時軟弱
如果不是我 誤會自己灑脫 讓我們難過
可當初的你 和現在的我 假如重來過

倘若那天
把該說的話好好說 該體諒的不執著
如果那天我 不受情緒挑撥 你會怎麼做
那麼多如果 可能如果我
可惜沒如果 沒有你和我

都怪我
不該沉默時沉默 該勇敢時軟弱
如果不是我 誤會自己灑脫 讓我們難過
可當初的你 和現在的我 假如重來過

倘若那天
把該說的話好好說 該體諒的不執著
如果那天我 不受情緒挑撥 你會怎麼做
那麼多如果 可能如果我
可惜沒如果 只剩下結果
可惜沒如果`,
    image: "images/1762707442857-795478589.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762707828781",
    title: "後來的我們",
    creators: ["五月天"],
    lyricist: ["阿信"],
    composer: ["怪獸"],
    albums: "自傳",
    release_date: "2016-08-20",
    language: "中文",
    genre: "流行",
    lyrics: `然後呢
他們說你的心 似乎痊癒了
也開始有個人 為你守護著
我該心安或是 心痛呢

然後呢
其實我的日子 也還可以呢
除了回憶肆虐 的某些時刻
慶幸還有眼淚 沖淡苦澀

而那些昨日 依然繽紛著 它們都有我 細心收藏著
也許你還記得 也許你都忘了
也不是那麼 重要了

只期待 後來的你 能快樂
那就是 後來的我 最想的
後來的我們 依然走著
只是不再並肩了
朝各自的人生 追尋了

無論是 後來故事 怎麼了
也要讓 後來人生 精彩著
後來的我們 我期待著
淚水中能看到 你真的 自由了

親愛的
回憶我們共同 走過的曲折
是那些帶我們 來到了這一刻
讓珍貴的人生 有失有得

用新的幸福 把遺憾包著 就這麽朝著 未來前進了
有再多的不捨 也要狠心割捨
別回頭看我 親愛的

只期待 後來的你 能快樂
那就是 後來的我 最想的
後來的我們 依然走著
只是不再並肩了
朝各自的人生 追尋了

無論是 後來故事 怎麼了
也要讓 後來人生 精彩著
後來的我們 我期待著
淚水中能看到 你真的 幸福快樂

在某處 另一個你 留下了
在那裏 另一個我 微笑著
另一個我們 還深愛著
代替我們永恒著
如果能這麼想 就夠了

無論是 後來故事 怎麼了
也要讓 後來人生 值得
後來的我們 我期待著
淚水中能看到 你真的 自由了`,
    image: "images/1762707828737-42539470.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762708022891",
    title: "愛人錯過",
    creators: ["告五人"],
    lyricist: ["潘雲安"],
    composer: ["潘雲安"],
    albums: "我肯定在幾百年前就說過愛你",
    release_date: "2019-06-14",
    language: "中文",
    genre: "",
    lyrics: `我肯定在幾百年前就說過愛你
只是你忘了
我也沒記起
我肯定在幾百年前就說過愛你
只是你忘了
我也沒記起
走過 路過 沒遇過
回頭 轉頭 還是錯
你我不曾感受過
相撞在街口 相撞在街口
你媽沒有告訴你
撞到人要說對不起
本來今天好好的
愛人就錯過
愛人就錯過
我 肯定 在幾百年前就說過愛你
只是 你忘了 我也 沒記起
我肯定 在幾百年前 就說過愛你
只是 你忘了 我也沒記起
走過 路過 沒遇過
回頭 轉頭 還是錯
你我不曾感受過
相撞在街口 相撞在街口
你媽沒有告訴你
撞到人要說對不起
本來今天好好的
愛人就錯過 愛人就錯過
走過 路過 沒遇過
回頭 轉頭 還是錯
你我不曾感受過
相撞在街口 相撞在街口
你媽沒有告訴你
撞到人要說對不起
本來今天好好的
愛人就錯過 愛人就錯過
走過 路過 沒遇過
回頭 轉頭 還是錯
你我不曾感受過
相撞在街口 相撞在街口
你媽沒有告訴你
撞到人要說對不起
本來今天好好的
愛人就錯過 愛人就錯過
走過 路過 沒遇過
回頭 轉頭 還是錯
你我不曾感受過
相撞在街口 相撞在街口
你媽沒有告訴你
撞到人要說對不起
本來今天好好的
愛人就錯過 愛人就錯過`,
    image: "images/1762708022891-357546282.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762708147535",
    title: "愚者",
    creators: ["理想混蛋"],
    lyricist: ["邱建豪"],
    composer: ["李建廷", "盧可沛", "邱建豪"],
    albums: "愚者",
    release_date: "2020-05-20",
    language: "中文",
    genre: "",
    lyrics: `旅行的起點不需要形狀
只要心已經開始流浪
他背起行囊 裝進天真理想

手中的地圖沒標示方向
只有與生俱來的渴望
沒想過投降 混蛋一樣地闖

受了傷還不停下 人們笑愚者多傻
但不在乎終點模樣 才能開始得漂亮

在每一個今天的笑容中醒來
跨過昨日眼淚匯集的港灣
傻裡傻氣地在 每一個今天的夢想中醒來
放手所有過去未來 只擁抱此刻的燦爛

旅行的起點不需要形狀
只要心已經開始流浪
他背起行囊 裝進天真理想

手中的地圖沒標示方向
只有與生俱來的渴望
沒想過投降 混蛋一樣地闖

受了傷還不停下 人們笑愚者多傻
但不在乎終點模樣 才能開始得漂亮

在每一個今天的笑容中醒來
跨過昨日眼淚匯集的港灣
傻裡傻氣地在 每一個今天的夢想中醒來
放手所有過去未來 只擁抱此刻的燦爛

在每一個今天的笑容中醒來
跨過昨日眼淚匯集的港灣
傻裡傻氣地在 每一個今天的夢想中醒來
放手所有過去未來 只擁抱此刻的燦爛`,
    image: "images/1762708147475-584469410.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762708486724",
    title: "倔強",
    creators: ["五月天"],
    lyricist: ["阿信"],
    composer: ["阿信"],
    albums: "知足 just my pride 最真傑作選",
    release_date: "2005-08-26",
    language: "中文",
    genre: "流行",
    lyrics: `當 我和世界不一樣 那就讓我不一樣
堅持對我來說 就是以剛克剛
我 如果對自己妥協 如果對自己說謊
即使別人原諒 我也不能原諒

最美的願望 一定最瘋狂
我就是我自己的神 在我活的地方

我和我最後的倔強 握緊雙手絕對不放
下一站是不是天堂 就算失望不能絕望

我和我驕傲的倔強 我在風中大聲的唱
這一次為自己瘋狂 就這一次 我和我的倔強

對 愛我的人別緊張 我的固執很善良
我的手越骯髒 眼神越是發光
你 不在乎我的過往 看到了我的翅膀
你說被火燒過 才能出現鳳凰

逆風的方向 更適合飛翔 我不怕千萬人阻擋
只怕自己投降

我和我最後的倔強 握緊雙手絕對不放
下一站是不是天堂 就算失望不能絕望
我和我驕傲的倔強 我在風中大聲的唱
這一次為自己瘋狂 就這一次 我和我的倔強

我和我最後的倔強 握緊雙手絕對不放
下一站是不是天堂 就算失望不能絕望
我和我驕傲的倔強 我在風中大聲的唱
這一次為自己瘋狂 就這一次 我和我的倔強
就這一次 讓我大聲唱 啦啦啦..
就算失望 不能絕望 啦啦啦啦啦．．．
就這一次 我和我的倔強`,
    image: "images/1762708486680-56749910.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762708856400",
    title: "分手後不要做朋友",
    creators: ["梁文音"],
    lyricist: ["黃婷"],
    composer: ["木蘭號aka陳韋伶"],
    albums: "漫情歌",
    release_date: "2014-01-01",
    language: "中文",
    genre: "流行",
    lyrics: `刪掉你手機的訊息 清空你專屬的抽屜
如果可以的話 多想 從來沒認識過你
置身少了你的空景 何時不再觸景傷情
雨滴和淚滴 總是會混在一起
你愛我 你傷我 不算什麼
反正我 絕不說 我多難過
有你的我 沒有你的我 往後日子都得過
你內疚 你難受 別告訴我
免得我 又搞錯 當作承諾
諒解背後的顫抖 誰關心過
我不堅強 分手後不要做朋友
我不善良 不想看你牽她的手
該怎麼走 就怎麼走
不必那麼努力演灑脫輕鬆
就算寂寞 分手也不要做朋友
就算宇宙 早就安排好這結果
你曾經牢牢地 在我生命裡附著
我要如何去假裝 我沒有愛過
終於不必為你掛心 終於多點愛給自己
好過不好過 都已跟你沒關係
你愛我 你傷我 不算什麼
反正我 絕不說 我多難過
有你的我 沒有你的我 往後日子都得過
你內疚 你難受 別告訴我
免得我 又搞錯 當作承諾
諒解背後的顫抖 誰關心過
我不堅強 分手後不要做朋友
我不善良 不想看你牽她的手
該怎麼走 就怎麼走
不必那麼努力演灑脫輕鬆
就算寂寞 分手也不要做朋友
就算宇宙 早就安排好這結果
你曾經牢牢地 在我生命裡附著
我要如何去假裝 我沒有愛過
我太愛了 分手後做不了朋友
淚流乾了 還洗不掉那些溫柔
不要蹉跎 不要聯絡
就讓我安安靜靜走完以後
我忘不了 我們曾不只是朋友
從今以後 思念再走不到盡頭
你曾經緊緊地 把我擁在你懷中
我要如何去假裝 你沒有愛過`,
    image: "images/1762708856396-817425882.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1762709042456",
    title: "4:00A.M.",
    creators: ["荷爾蒙少年"],
    lyricist: ["詹詠安"],
    composer: ["詹詠安"],
    albums: "Hormone Boys",
    release_date: "2018-01-26",
    language: "中文",
    genre: "",
    lyrics: `拖著 崩潰邊緣的步伐
腦海裡 反覆放映著虛幻的美麗
路燈照亮凌亂的頭髮
照亮堆積心中的慌
突然發現為何還在期待妳的電話

所以我選擇逃避妳炙熱的目光
然後再用力把自己的渴望鎖上
妳發過的每則簡訊
妳給過的每段記憶
到底 我能不能相信

我明白 妳的世界裡太多色彩
不可能注意到我的存在
又有誰能聽見
我靈魂深處的脆弱自卑
都只為妳而傾瀉

所以我選擇逃避妳炙熱的目光
然後再用力把自己的渴望鎖上
妳發過的每則簡訊
妳給過的每段記憶
到底 我能不能相信
我明白 妳的世界裡太多色彩
不可能注意到我的存在
又有誰能聽見
我靈魂深處的脆弱自卑
都只為妳而傾瀉

所以我選擇逃避妳炙熱的目光
然後再用力把自己的渴望鎖上
妳發過的每則簡訊
妳給過的每段記憶
到底
我能不能相信

拖著 崩潰邊緣的步伐
腦海裡 反覆放映著虛幻的美麗
路燈照亮凌亂的頭髮
照亮堆積心中的慌
突然發現為何還在期待妳的電話

「 喂？ 」
「 喂 你在幹嘛？ 」
「 沒有啊 在想事情 睡不著 。 」
「 喔 跟你說喔 這禮拜四我不能跟你出去了 我忘記那天有約了 」
「 喔 好吧 。 」
「 你不可以生我的氣喔 」
「 沒有啊 。」
「 好 那晚安囉 」
「 恩。」

我明白 妳的世界裡太多色彩
不可能注意到我的存在
又有誰能聽見 我靈魂深處的脆弱自卑
都只為妳而傾瀉

只為你而凋謝
凌晨四點
還在跟自己作對`,
    image: "images/1762709042072-464288790.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1763012036493",
    title: "動物世界",
    creators: ["薛之謙"],
    lyricist: ["薛之謙"],
    composer: ["郭頂"],
    albums: "渡 The Crossing",
    release_date: "2017-11-28",
    language: "中文",
    genre: "流行",
    lyrics: `東打一下西戳一下
動物未必需要尖牙
示愛的方法有禮貌或是我管它
要將情人一口吞下
還要顯得溫文爾雅
螳螂委屈的展示舊傷疤
求偶時候一驚一乍
因為害怕時常倒掛
走投無路的情況下捨棄了尾巴
如果不能將它同化就寄生於它
大不了一同腐化
努力進化 笑動物世界都太假
祖先 已磨去爪牙
相愛相殺 一定有更好的辦法
攀比一下 誰先跪下
不再進化 動物世界裡都太傻
為情表現到浮誇
得到了你就該丟下 人性來不及粉刷
所以啊 人總患孤寡

麋鹿本來約在樹下
說好一起浪跡天涯
系上鈴鐺還在往那個方向掙扎
如果有隻豺狼它英勇披上婚紗
同伴笑他讀過童話
別再進化 別讓動物世界太假
我們 該露出爪牙
相愛相殺 別再想更好的辦法
優勝劣汰 自舔傷疤
假裝進化 拼命想和動物有差
玩一出高貴優雅
在人們腐爛的慾望下 獸性來不及抹殺
算了吧 懶得去掙扎
人類用沙 想捏出夢里通天塔
為貪念不惜代價
駕馭著昂貴的木馬 巢穴一層層疊加
最後啊 卻一絲不掛
別害怕 我們都孤寡`,
    image: "images/1763012036487-54685314.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1763044662285",
    title: "小船",
    creators: ["陳綺貞"],
    lyricist: ["陳綺貞"],
    composer: ["陳綺貞"],
    albums: "沙發海",
    release_date: "2018-12-24",
    language: "中文",
    genre: "流行",
    lyrics: `一條小船在天空
決定再航行兩分鐘
兩個光年再回頭
回頭看見你在等我

我們沿著河邊走
一條河從你流向了我
我們什麼話都沒說
看見一條小船經過

屋簷和天空
流星和霓虹
打開窗戶看見獵戶座
憂鬱的雲朵
何處能停留
一條小船想靠岸

我們沿著河邊走
一條河從你流向了我
如果你真的愛上我
就請你愛真正的我

屋簷和天空
流星和霓虹
打開窗戶看見獵戶座
憂鬱的雲朵
何時能停留
一條小船想靠岸

我們沿著河邊走
一條河從你流向了我
如果魔鬼離開了我
天使也不會再停留

如果魔鬼離開了我
天使也不會再停留

如果魔鬼離開了我
天使也不會再停留`,
    image: "images/1763044662267-598176465.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1763044963594",
    title: "旅行的意義",
    creators: ["陳綺貞"],
    lyricist: ["陳綺貞"],
    composer: ["陳綺貞"],
    albums: "華麗的冒險",
    release_date: "2004-03-29",
    language: "中文",
    genre: "流行",
    lyrics: `你看過了許多美景 你看過了許多美女
你迷失在地圖上每一道短暫的光陰
你品嚐了夜的巴黎 你踏過下雪的北京
你熟記書本裡每一句你最愛的真理
卻說不出你愛我的原因 卻說不出你欣賞我哪一種表情
卻說不出在什麼場合我曾讓你動心 說不出 離開的原因
你累計了許多飛行 你用心挑選紀念品
你蒐集了地圖上每一次的風和日麗
你擁抱熱情的島嶼 你埋葬記憶的土耳其
你流連電影裡美麗的不真實的場景
卻說不出你愛我的原因 卻說不出你欣賞我哪一種表情
卻說不出在什麼場合我曾讓你分心 說不出 旅行的意義
你勉強說出你愛我的原因 卻說不出你欣賞我哪一種表情
卻說不出在什麼場合我曾讓你分心 說不出 離開的原因
勉強說出 你為我寄出的每一封信 都是你 離開的原因
你離開我 就是旅行的意義`,
    image: "images/1763044963593-21707126.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1763045094043",
    title: "華生",
    creators: ["陳綺貞"],
    lyricist: ["陳綺貞"],
    composer: ["陳綺貞"],
    albums: "沙發海",
    release_date: "2018-12-24",
    language: "中文",
    genre: "流行",
    lyrics: `不如就把我當作是一個
有那麼一點點偏執的朋友
抽絲剝繭
發現你是如此的特別
好像除了我
沒人能把你看透
你走路總是喜歡走左邊
你寫的字總是歪歪又斜斜
你喝咖啡總是喜歡剩一些些
你最討厭逼別人表態的虛偽

你要去哪裡 我都跟著你
讓我為你淋一場雨
你的愛恨情仇 瀟灑和溫柔
我都不想放過

你的自由就是很久不聯絡
一見了面可以喝整夜的啤酒
我的研究 發現你並不懂應酬
那一定 是因為你也愛著我

你要去哪裡 我都跟著你
上輩子 我一定是拯救了銀河系
你要去哪裡 我都跟著你
全世界最棒的朋友是你

不如就把我當作是一個
有那麼一點點偏執的朋友
抽絲剝繭 發現你是如此的特別
好像除了我
沒人能把你看透

抽絲剝繭
發現你是如此的特別
好像除了我
沒人能把你看透
除了我
沒人能把你看透`,
    image: "images/1763045094017-718153974.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1763045203185",
    title: "魚",
    creators: ["陳綺貞"],
    lyricist: ["陳綺貞"],
    composer: ["陳綺貞"],
    albums: "太陽",
    release_date: "2009-01-22",
    language: "中文",
    genre: "流行",
    lyrics: `我坐在椅子上 看日出復活
我坐在夕陽裡 看城市的衰弱
我摘下一片葉子 讓它代替我
觀察離開後的變化

曾經 狂奔 舞蹈 貪婪的說話
隨著冷的濕的心腐化
帶不走的 丟不掉的 讓大雨侵蝕吧
讓他推向我在邊界奮不顧身掙扎
如果有一個懷抱勇敢不計代價
別讓我飛 將我溫柔豢養

我坐在椅子上 看日出復活
我坐在夕陽裡 看城市的衰弱
我摘下一片葉子 讓它代替我
觀察離開後的變化

曾經 狂奔 舞蹈 貪婪的說話
隨著冷的濕的心腐化
帶不走的留不下的我全都交付他
讓他捧著我在手掌 自由自在揮灑
如果有一個世界渾濁的不像話
原諒我飛 曾經眷戀太陽

帶不走的丟不掉的讓大雨侵蝕吧
讓它推向我在邊界奮不顧身掙扎
如果有一個世界渾濁的不像話
我會瘋狂的愛上

帶不走的留不下的我全都交付他
讓他捧著我在手掌自由自在揮灑
如果有一個懷抱勇敢不計代價
別讓我飛 將我溫柔豢養
原諒我飛 曾經眷戀太陽`,
    image: "images/1763045203077-330888617.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1763045851311",
    title: "月亮",
    creators: ["芒果醬"],
    lyricist: ["郭佐治"],
    composer: ["郭佐治"],
    albums: "核核核",
    release_date: "2024-09-17",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `什麼是光 什麼是希望
希望是我牽著他說「回來吧」

什麼是光 人 為什麼要希望
我的手 再也無法 緊握什麼


啊～啊～啊～


當所有的光都成夜
夜不成眠
我該如何放下一切？

月亮 請救救我吧
人是無法飛翔的白鴿
我渴望著愛 卻弄巧成殺人
我從此再也感覺不到快樂

月亮 Tengil aku
我在太平洋面前祈禱
可惡啊 可惡啊 可惡啊
請救救我吧

啊～啊～啊～

我呆坐在和你分開的月台

啊～啊～啊～

當所有的光都成夜
但 夜不成月
我該如何放下一切？


月亮 請救救我吧
人是無法飛翔的白鴿
我渴望著愛 卻弄巧成殺人
我從此再也感覺不到快樂

月亮 Tengil aku
我在和平車站裡哭了
可惡啊 可惡啊 可惡啊
請救救我吧

你已經離開

月亮 請救救我吧
我是無法飛翔的白鴿
但我的一切 又該怎麼做呢
原來愛讓人這樣的痛呢

月亮 請救救我吧
我在每一個夜裡吶喊
可惡啊 可惡啊 可惡啊

人去了天涯海角
每個他方
心卻永遠留在
故鄉的土跤`,
    image: "images/1763045851197-587538535.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764123371598",
    title: "小步舞曲",
    creators: ["陳綺貞"],
    lyricist: ["陳綺貞"],
    composer: ["陳綺貞"],
    albums: "吉他手",
    release_date: "2002-07-31",
    language: "中文",
    genre: "",
    lyrics: `天空突然下起傾盆大雨 戀人在屋簷下相偎相依
移動我的腳步輕鬆躲雨 人潮擁擠握住濕熱的手心
再也不願想起不快樂的旋律 呼吸這一秒的空氣
還有多少回憶 藏著多少秘密
在我心裡翻來覆去 什麼叫做愛情
還有多少回憶 藏著多少秘密
在你心裡我也許只是你欣賞的風景


夜晚靜靜等著電話響起 時間躺在他去年寄來的信
空蕩的房間我播放著舞曲 旋轉這一秒的孤寂
還有多少回憶 藏著多少秘密
在你心裡我也許是你輕快的遊戲
還有多少回憶 藏著多少秘密
在你心裡我也許只是你緩慢的練習

音樂響起我一個人演出重複的舞曲`,
    image: "images/1764123371597-624828335.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764123451983",
    title: "80%完美的日子",
    creators: ["陳綺貞"],
    lyricist: ["陳綺貞"],
    composer: ["陳綺貞"],
    albums: "華麗的冒險",
    release_date: "2005-09-25",
    language: "中文",
    genre: "",
    lyrics: `我捕捉 精彩的畫面
可是一閉上眼 顏色就褪掉了
我穿上 最舒適的T恤
可是一脫下來 身體都僵硬了

我選擇 我最想要的
可是一個人了 反而笑開了
我丟棄 對我最好的
可是一關上燈 全部都回來了

直到有一天 我徹底昏睡了
我太累了 我放開了
直到有一天 我失去了
太矛盾了 眼淚掉下來了

我捕捉 精彩的畫面
可是一閉上眼 顏色就褪掉了
我穿上 最舒適的T恤
可是一脫下來 身體都僵硬了

我選擇 我最想要的
可是一個人了 反而笑開了
我丟棄 對我最好的
可是一關上燈 全部都回來了

直到有一天 我徹底昏睡了
我太累了 我放開了
直到有一天 我失去了
太狼狽了 眼淚掉下來了

直到有一天 我徹底昏睡了
我太累了 我放開了
直到有一天 我失去了
太矛盾了眼淚掉下來了`,
    image: "images/1764123451981-462094065.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764123537714",
    title: "我喜歡上你時的内心活動",
    creators: ["陳綺貞"],
    lyricist: ["韓寒"],
    composer: ["陳光榮"],
    albums: "喜歡你",
    release_date: "2017-05-16",
    language: "中文",
    genre: "",
    lyrics: `在九月 潮溼的車廂 你看著車窗 窗外它 水管在開花
椅子在異鄉 樹葉有翅膀 上海的街道 雪山在邊上
你靠著車窗 我心臟一旁 我們去哪

你看那 九點鐘方向 日內瓦湖的房子 貴嗎
世界上 七千個地方 我們定居哪

告訴我 答案是什麼 你喜歡去哪 青海或三亞
冰島或希臘 南美不去嗎 沙漠你愛嗎 我問太多了

知道嗎 這裡的雨季只有一兩天
白晝很長 也很短 夜晚有三年

知道嗎今天的消息 說一號公路上 那座橋斷了
我們還去嗎 要不再說呢 會修一年吧 一年能等嗎

你還去嗎
你喜歡嗎 你喜歡嗎`,
    image: "images/1764123537712-141043163.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764123653684",
    title: "煙火",
    creators: ["陳綺貞"],
    lyricist: ["陳綺貞"],
    composer: ["陳綺貞"],
    albums: "太陽",
    release_date: "2009-01-22",
    language: "中文",
    genre: "",
    lyrics: `快告訴我，你還愛我，
用我最後溫柔的請求，
給你我的墮落，給你我隱藏的脆弱，
告訴我你還愛我...

躲在黑暗的角落，讓我徹底的放鬆，
陪我看一場華麗的煙火，
我的愛如此短暫自由，除了你，沒有人真正了解我。

站在城市的頂峰，灰色的雲朵飄過，
我的心隨著你垂直的降落。
做過的夢是一陣漩渦，
淹沒你，淹沒了我。

快告訴我，你還愛我，
用我最後溫柔的請求。
給你我的墮落，給你我隱藏的脆弱，
告訴我，你還愛我...

快告訴我，你還愛我，用我最後溫柔的請求，
對你毫不保留，
等到我的青春剝落的時候，
你還愛我…

快告訴我，你還愛我，
用我最後溫柔的請求。
給你我的墮落，給你我隱藏的脆弱，
告訴我，你還愛我...

快告訴我，你還愛我，
用我最後溫柔的請求。
對你毫不保留，
等到我的青春剝落的時候，
你還愛我…還愛我… 還愛我…

對你毫不保留，
等到我的青春剝落的時候，
你還愛我…
還愛我…
還愛我…

躲在黑暗的角落，讓我徹底的放鬆，
陪我看一場華麗的煙火，
我的愛如此短暫自由，
除了你，
沒有人真正了解我。`,
    image: "images/1764123653682-440040605.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764123715093",
    title: "殘缺的彩虹",
    creators: ["陳綺貞"],
    lyricist: ["陳綺貞"],
    composer: ["陳綺貞"],
    albums: "沙發海",
    release_date: "2018-12-24",
    language: "中文",
    genre: "",
    lyrics: `這一次 我不想要 一個人走
回去的路 總是背對彩虹
沒有你 我是殘缺的彩虹
失去一個最重要的顏色

想要聽你說 你都怎麼過
你現在好嗎 你微笑點頭
想要聽你說 快樂多過憂愁
想要聽你說
卻發現你在騙我

這一次 你陪著我 兩個人走
回去的路 回頭就有彩虹
沒有你 我是殘缺的彩虹
哪裡去找 最重要的顏色

想要聽你說 你都怎麼過
你現在好嗎 你微笑點頭
想要聽你說 快樂多過憂愁
想要聽你說
卻發現你在騙我

想要聽你說 你都怎麼過
你現在好嗎 你微笑點頭
想要聽你說 快樂多過憂愁
想要聽你說
想要聽你說
想要聽你說
你看見的光
是我`,
    image: "images/1764123715091-221047929.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764123776247",
    title: "沙發海",
    creators: ["陳綺貞"],
    lyricist: ["陳綺貞"],
    composer: ["陳綺貞"],
    albums: "沙發海",
    release_date: "2018-12-24",
    language: "中文",
    genre: "",
    lyrics: `深夜獨自坐在沙發上
讓遙控器親吻電視螢幕
世界盃足球即將開打
我一個人享用舒服的禁區

清晨獨自坐在沙發上
一杯咖啡加上一顆蛋
時間退回到了航海時代
一路向前就能回到出發的地方
在沙發海 沙發海
在沙發海
漂流

到了下午我還坐在這裡
不如把沙發睡成一片汪洋
醒來看見月亮依舊追問太陽
吉普賽人擁有不追問的靈魂
只能在沙發海 沙發海
我們的海
漂流

還好你 留下了
使用孤獨的說明書
可是你 帶走了
躲開寂寞的指南針

在沙發海 沙發海
在沙發海
等你來救我
等你來救我
等你來
救我`,
    image: "images/1764123776245-853132078.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764123836592",
    title: "偶然與巧合",
    creators: ["陳綺貞"],
    lyricist: ["陳綺貞"],
    composer: ["陳綺貞"],
    albums: "偶然與巧合",
    release_date: "2014-12-15",
    language: "中文",
    genre: "",
    lyrics: `偶然與巧合之間
我們的選擇會不會
改變了世界 改變某一個人
讓歷史重演 眼看忘了告別的蝴蝶
正努力在飛 當作不知道
星星和燭火 誰會先熄滅
若美麗的一切 總是看起來遙遠
親愛的 別悲傷 幸福不在他方

寂靜與喧嘩之間
發出的聲音會不會
改變了世界 改變某一個人
來不及察覺 海浪已離開了海岸線
離開千萬遍 當作不知道
貝殼和沙灘 總緊緊擁抱
若我們的告別 總是在挑戰時間
親愛的 別悲傷 怪我的愛漫長

努力在飛 當作不知道
星星和燭火 誰會先熄滅
若美麗的一切 總是看起來遙遠
親愛的 別悲傷 幸福不在他方`,
    image: "images/1764123836590-324687445.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764123901459",
    title: "長夜",
    creators: ["芒果醬"],
    lyricist: ["郭佐治"],
    composer: ["郭佐治"],
    albums: "心跳保衛戰",
    release_date: "2023-12-21",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `白色的你 一身防護衣
隔絕了病菌也隔絕了你和白雲
多想給你 鮮花與草原
多想帶你離開深不見底的長夜

啦啦啦 啦啦啦 啦啦啦

當黑夜又來襲 你勇敢的揚起 紅白色的大旗
讓我們用全力 用並肩的呼喊 給你鼓勵
３２１

ＧＯ！
失去星空的夜裡 你閃亮的勇氣
讓人願意繼續相信
漫漫的長夜裡 你就是陽明山上的星星
看著你 就能繼續前進
3 2 1
ＧＯ！
失去星空的夜裡 你忍住不哭泣
孤單讓人感到窒息
我深愛的島嶼 因為你才能自由的呼吸
有了你 希望才能延續

失去星空的夜裡 你善良的勇氣
讓人願意繼續相信
漫漫的長夜裡
你就是陽明山上的星星
看著你 就能繼續前進
3 2 1
G O !
失去星空的夜裡 你忍住不哭泣
孤單讓人感到窒息
我深愛的島嶼 因為你才能自由的呼吸
有了你 希望才能延續
長夜會過去`,
    image: "images/1764123901457-264932727.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764123973009",
    title: "夏夜晚風",
    creators: ["芒果醬"],
    lyricist: ["郭佐治"],
    composer: ["郭佐治"],
    albums: "新・寶島少年？",
    release_date: "2022-06-30",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `夏夜晚風輕輕吹 又到了離別的季節
織女星上的喜鵲 都叫我別再留戀
妳是山裡的百合花 那香味讓我好暈眩
夏夜的晚風輕輕吹 我也該向過去道別

但怎麼看到月亮 我終究還是想到妳
突如其來的心悸 打亂了我的夏季
然而這驚慌的瞬間 風輕輕吹動了湖面
而我在回憶裡面 失去了知覺

夏夜晚風 吹得我心好痛
怎麼我的溫柔 錯過了妳的寂寞
夏夜晚風 吹的我心好痛
痛的我不知所措 而我也無處可躲

如果回到那年 我和妳還能夠見面
我們都拿出勇氣 能不能改變一切
然而這巨大的幻覺 將我拽回到從前
而我在回憶裡面 失去了知覺

夏夜晚風 吹得我心好痛
怎麼我的溫柔 錯過了妳的寂寞
夏夜晚風 吹的我心好痛
痛的我不知所措 而我也無處可躲

夏夜晚風 吹得我心好痛
怎麼我的溫柔 變成了我犯的錯
夏夜晚風 吹得我心好痛
痛的墜入了湖泊 而我也不再迷惑

啦啦~啦~啦~
啦啦~啦~啦~
啦啦~啦~啦~
啦啦~啦~啦~
啦啦~啦~啦~
啦啦~啦~啦~
啦啦~啦~啦~
啦啦~啦~啦~
啦啦啦啦~啦啦啦啦啦~
啦啦啦啦啦啦~~啦啦啦啦啦啦~~
啦啦啦啦~啦啦啦啦啦啦~~
啦啦啦啦啦啦啦~啦啦啦啦啦啦啦~~啦啦~~~~~`,
    image: "images/1764123973007-72126747.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764124132825",
    title: "だから僕は音楽を辞めた",
    creators: ["ヨルシカ"],
    lyricist: ["n-buna"],
    composer: ["n-buna"],
    albums: "だから僕は音楽を辞めた",
    release_date: "2019-04-10",
    language: "日文",
    genre: "",
    lyrics: `考えたってわからないし
kangae tatte wa ka ra na i shi
即使思考過後我也不明白

青空の下、君を待った
ao zora no shita, kimi wo matta
我在青空之下、等待著你

風が吹いた正午、昼下がりを抜け出す想像
kaze ga fuita syougo, hiru sagari wo nuke dasu souzou
微風吹拂的正午、擺脫過午的想像

ねぇ、これからどうなるんだろうね
nee, ko re ka ra do u na ru n da ro u ne
吶、從今以後會變得怎麼樣呢

進め方教わらないんだよ
susume kata osowarana i n da yo
我不會教你前進的方法

君の目を見た　何も言えず僕は歩いた
kimi no me wo mita     nani mo ie zu boku wa aruita
看著你的眼睛　沉默不語的我邁出了步伐


考えたってわからないし
kangae tatte wa ka ra na i shi
即使思考過後也不明白

青春なんてつまらないし
seisyun na n te tsu ma ra na i shi
青春什麼的十分無趣

辞めた筈のピアノ、机を弾く癖が抜けない
yame ta hazu no piano, tsukue wo hiku kuse ga nuke na i
本來應該放棄的鋼琴、我無法改正彈桌子的習慣

ねぇ、将来何してるだろうね
nee, syourai nani shi te ru da ro u ne
吶、你在未來做什麼呢

音楽はしてないといいね
ongaku wa shi te na i to i i ne
如果沒有做音樂的話就好了

困らないでよ
komarana i de yo
不要感到困惑啊


心の中に一つ線を引いても
kokoro no naka ni hitotsu sen wo hiite mo
即使在心裡拉著一條線

どうしても消えなかった　今更なんだから
do u shi te mo kie na katta     ima sara na n da ka ra
事到如今　無論怎麼做都不會消失了啊

なぁ、もう思い出すな
naa, mo u omoi dasu na
喂、不要再想起了啊


間違ってるんだよ
machigatte ru n da yo
我搞錯了啊

わかってないよ、あんたら人間も
wa katte na i yo, a n ta ra ningen mo
我也沒有明白啊、你們也是人類啊

本当も愛も世界も苦しさも人生もどうでもいいよ
hontou mo ai mo sekai mo kurushi sa mo jinsei mo do u de mo i i yo
真相、愛情、世界、痛苦、人生都無所謂了

正しいかどうか知りたいのだって防衛本能だ
tadashi i ka do u ka shiri ta i no datte bouei honnou da
想要知道正確之類的事物不過只是防衛本能啊

考えたんだ　あんたのせいだ
kangae ta n da     a n ta no se i da
在我思考過後　發現這是你的錯啊


考えたってわからないが、本当に年老いたくないんだ
kangae tatte wa ka ra na i ga, hontou ni toshi oi ta ku na i n da
雖然思考過後我也不明白、但我其實不想老去啊

いつか死んだらって思うだけで胸が空っぽになるんだ
i tsu ka shinda ratte omou da ke de mune ga karappo ni na ru n da
光是只要想著總有一天將會死去後　我的內心就會變得空虛

将来何してるだろうって
syourai nani shi te ru da ro utte
「你在未來做什麼呢」

大人になったらわかったよ
otona ni natta ra wa katta yo
只要長大成人之後就會明白啊

何もしてないさ
nani mo shi te na i sa
我根本一事無成啊


幸せな顔した人が憎いのはどう割り切ったらいいんだ
shiawase na kao shi ta hito ga nikui no wa do u wari kitta ra i i n da
一臉幸福的人十分可憎　我該怎麼理解這些情感才好呢

満たされない頭の奥の化け物みたいな劣等感
mitasare na i atama no oku no bake mono mi ta i na rettou kan
不被滿足的腦袋深處存在著像怪物一樣的自卑感


間違ってないよ
machigatte na i yo
我並沒有搞錯啊

なぁ、何だかんだあんたら人間だ
naa, nan da ka n da a n ta ra ningen da
喂、無論怎麼說你們都是人類啊

愛も救いも優しさも根拠がないなんて気味が悪いよ
ai mo sukui mo yasashi sa mo konkyo ga na i na n te kimi ga warui yo
愛情、救贖、溫柔都沒有證據什麼的真是可怕啊

ラブソングなんかが痛いのだって防衛本能だ
rabu songu na n ka ga itai no datte bouei honnou da
情歌會令人難受也是防衛本能

どうでもいいか　あんたのせいだ
do u de mo i i ka     a na ta no se i da
怎麼樣都行嗎　這是你的錯啊


考えたってわからないし
kangae tatte wa ka ra na i shi
即使思考過後我也不明白

生きてるだけでも苦しいし
iki te ru da ke de mo kurushi i shi
光是活著就很痛苦啊

音楽とか儲からないし
ongaku to ka moukarana i shi
音樂並沒有什麼賺頭

歌詞とか適当でもいいよ
kashi to ka tekitou de mo i i yo
歌詞隨便寫寫就好

どうでもいいんだ
do u de mo i i n da
無所謂了啊


間違ってないだろ
machigatte na i da ro
我並沒有搞錯吧

間違ってないよな
machigatte na i yo na
我並沒有搞錯對吧


間違ってるんだよ　わかってるんだ
machigatte ru n da yo     wa katte ru n da
我搞錯了啊　我明白啊

あんたら人間も
a n ta ra ningen mo
你們也是人類啊

本当も愛も救いも優しさも人生もどうでもいいんだ
hontou mo ai mo sukui mo yasashi sa mo jinsei mo do u de mo i i n da
真相、愛情、世界、痛苦、人生都無所謂了

正しい答えが言えないのだって防衛本能だ
tadashi i kotae ga ie na i no datte bouei honnou da
說不出正確答案是防衛本能啊

どうでもいいや　あんたのせいだ
do u de mo i i ya     a n ta no se i da
在我思考過後　發現這是你的錯啊


僕だって信念があった
boku datte shinnen ga atta
即使是我也有信念

今じゃ塵みたいな想いだ
ima jya gomi mi ta i na omoi da
現在是如塵一般的想法

何度でも君を書いた
nando de mo kimi wo kaita
無論幾次我都會寫下你

売れることこそがどうでもよかったんだ
ure ru ko to ko so ga do u de mo yo katta n da
正是因為暢銷所以才覺得無所謂

本当だ　本当なんだ　昔はそうだった
hontou da     hontou na n da     mukashi wa so u datta
真的啊　這是真的啊　以前就是這樣


だから僕は音楽を辞めた
da ka ra boku wa ongaku wo yame ta
所以我放棄了音樂


中文翻譯：月勳`,
    image: "images/1764124132823-734639517.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764124202584",
    title: "Angelina",
    creators: ["甜約翰"],
    lyricist: ["吳浚瑋"],
    composer: ["石裕獎"],
    albums: "Dear",
    release_date: "2017-12-15",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `空盪的街道 不存在的喧鬧
杳無人煙 剩下寧靜環繞
Around me, you could be, you could be.
理智線勾勒 出日常的軌道
抹去煩惱 也不會有低潮
Around me, you could be, you could be.

曾經有個誰 打破這道牆
隱隱約約 很模糊的印象
Around me, you could be, you could be.
無意識之間 才存在的想望
胸口壓著 又是誰的重量
Around me, you could be, you could be.

Angelina
Angelina
Angelina

Angelina
Angelina
Angelina

也許我根本不在意 也許偶爾會想起你
也許宇宙裡 某一顆星星誕生 然後死去

Angelina
Angelina
Angelina

Angelina
Angelina
Angelina`,
    image: "images/1764124202574-765151790.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764124293882",
    title: "刻在我心底的名字",
    creators: ["盧廣仲"],
    lyricist: ["許媛婷", "佳旺", "陳文華"],
    composer: ["許媛婷", "佳旺", "陳文華"],
    albums: "刻在我心底的名字",
    release_date: "2020-08-25",
    language: "中文",
    genre: "",
    lyrics: `Oublie-le（忘記你）
好幾次我告訴我自己
越想努力趕上光的影
越無法抽離 而已

Je t'aimais（我愛你）
刻骨銘心只有我自己
好不容易交出真心的勇氣
你沉默的回應 是善意

刻在我心底的名字
忘記了時間這回事
於是謊言說了一次就一輩子
曾頑固跟世界對峙
覺得連呼吸都是奢侈
如果有下次 我會再愛一次

刻在我心底的名字
你藏在塵封的位置
要不是這樣我怎麼過一輩子
我住在霓虹的城市
握著飛向天堂的地址
你可以翱翔 可是我只能停滯

尋找你 茫茫人海卻又想起你
好不容易離開思念的軌跡
回憶將我聯繫 到過去

刻在我心底的名字
忘記了時間這回事
既然決定愛上一次就一輩子
希望讓這世界靜止
想念才不會變得奢侈
如果有下次 我會再愛一次

刻在我心底的名字
你藏在塵封的位置
要不是這樣我怎麼過一輩子
我住在想你的城市
握著飛向天空的鑰匙
你繼續翱翔 還有我為你堅持

刻在我心底的名字
忘記了時間這回事
既然決定愛上一次就一輩子
希望讓這世界靜止
想念才不會變得奢侈
如果有下次 我會再愛一次`,
    image: "images/1764124293880-619302378.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764124390215",
    title: "一個人默默的酷",
    creators: ["公館青少年 GGteens", "就以斯"],
    lyricist: ["盧彥恩", "廖于任", "詹佳穎"],
    composer: ["盧彥恩", "廖于任", "詹佳穎"],
    albums: "我其實一點都不酷",
    release_date: "2024-06-17",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `大家都說 覺得我不錯
成熟又帶 有一點幽默
唯一缺點 是沒牽過你的手

打扮潮流 從來沒落後
目光焦點 全都停在我
要攻佔你 我想不需要多久

但我 不是你的菜
希望你能明白
還很多人在排
Baby, do you wanna be mine?

怎麼辦 我想破腦袋
耍酷 帶點浪漫 忍受你的派
怎麼辦 I’ll think about why
每則限時動態 只為了讓你看
想到呼吸都很困難
要有多酷 才能讓你喜歡

把 你 寫 進 我的歌裡
這要求 是否太俗氣 是否不講理
但我就任性

想寫出一首 完美的情歌
那 一首能夠 打動你的情歌
不知道是我們的緣分不夠
或我太無能 想到就頭疼

在 腦海裡 打轉
希望你能明白
還很多人在排
Baby, do you wanna be mine?

怎 麼 辦 我想破腦袋
耍酷 帶點浪漫 忍受你的派
怎 麼 辦 I’ll think about why
每則 限時動態 只為了讓你看
想到呼吸都很困難
要有多酷 才能讓你喜歡

怎麼辦 我想破腦袋
耍酷 帶點浪漫 忍受你的派
怎麼辦 I’ll think about why
每則限時動態 只為了讓你看
想到呼吸都很困難
要有多酷 才能讓你喜歡

我壓抑不住 對你的依賴
還需要多酷才能讓你喜歡`,
    image: "images/1764124390212-885504574.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764124459585",
    title: "原來你跟每個人都說著一樣的話",
    creators: ["怕胖團"],
    lyricist: ["閃亮"],
    composer: ["閃亮"],
    albums: "原來你跟每個人都說著一樣的話",
    release_date: "2023-04-18",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `原來你跟每個人都說著一樣的話
我不過是每天被你複製貼上的對象
不難想像你最變態的表情
也一定都一樣 也一定都一樣
你約我 又不來 喔沒有關係
再約我 又不來 你回家小心
你太忙 你好累 我全都相信
因為他也一樣收到一樣的訊息
我實在搞不清楚我們什麼關係
雖然當初說你要怎樣我不介意
曾經的我們飛向宇宙浩瀚無垠
如今我卻變成了你丟掉的玩具
原來你對每個人都說著一樣的話
我不過是每天被你複製貼上的對象
不難想像你最變態的表情
也一定都一樣 也一定都一樣
原來你跟每個人都說著一樣的謊
不想拆穿你的話就陪著你繼續裝
無法想像我現在仍然會對你癡狂
沒有關係 我今天剛好也不行
請回家小心 三寶很多多多注意
我全都相信 下次你一定不會忘記
但為什麼我兄弟收到一樣的訊息
我實在搞不清楚我們什麼關係
雖然當初說你要怎樣我不介意
曾經的我們飛向宇宙浩瀚無垠
如今我卻變成了你丟掉的玩具
原來你跟每個人都說著一樣的話
我不過是每天被你複製貼上的對象
不難想像你最變態的表情
也一定都一樣
我後悔當初沒說出我的真心
跟你發生的一切都放在心裡
曾經的我們都受到太多委屈
如今的我們都變成一灘爛泥
原來你跟每個人都說著一樣的話
我不過是每天被你複製貼上的對象
不難想像你最變態的表情
也一定都一樣 也一定都一樣
原來你跟每個人都說著一樣的謊
不想拆穿你的話就陪著你繼續裝
無法想像我現在仍然會對你癡狂`,
    image: "images/1764124459583-38353498.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764124519585",
    title: "很幼稚嗎？",
    creators: ["那我懂你意思了"],
    lyricist: ["陳修澤"],
    composer: ["陳修澤"],
    albums: "原諒我不明白你的悲傷",
    release_date: "2012-12-20",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `那些我曾經明白的夢想
那些我還不能了解的話
你知道嗎
你知道嗎

說你說的話
模仿你的憂傷
想著這時候你又會怎麼做 怎麼想

讀你讀的書
夢想你的夢想
還不懂昨天有什麼好牽掛

我知道 我是我你終究是你
我知道 只是還沒那麼堅強

那些我曾經明白的夢想
那些我還不能了解的話
你知道嗎
你知道嗎

而我還在你離開的地方
唱著我還不能了解的話
你知道吧
你知道吧

而我也只能這麼做了
走吧

嘿 太奸詐了吧
這就叫做成熟嗎
烙印在心裡的又該怎麼承受它

我知道 我是我你終究是你
我知道 只是還沒那麼堅強

那些我曾經明白的夢想
那些我還不能了解的話
你知道嗎
你知道嗎

而我還在你離開的地方
唱著我還不能了解的話
你知道吧
你知道吧

痛苦總會過去的吧？
美好真的會留下嗎？
我不知道 我不知道
是不是總有一天

那些我曾經明白的夢想
那些我還不能了解的話
你知道嗎
你知道嗎

而我還在你離開的地方
唱著我還不能了解的話
你知道吧
你知道吧

那些我曾經明白的夢想
那些我還不能了解的話
你知道嗎
你知道嗎

而我還在你離開的地方
唱著我還不能了解的話
你知道吧
你知道吧

而我也只能這麼做了
走吧`,
    image: "images/1764124519583-932369950.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764124586215",
    title: "原諒我不明白你的悲傷",
    creators: ["那我懂你意思了"],
    lyricist: ["陳修澤"],
    composer: ["陳修澤"],
    albums: "原諒我不明白你的悲傷",
    release_date: "2012-12-20",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `你還記得嗎
你還記得嗎
而我也不想再多說那美麗的瘋狂

你還記得嗎
你還記得嗎
其實我也有些害怕知道你的近況

怎麼這世界好像越來越陌生了
我知道我不該停下腳步
對你 記得我承諾過

又過了多少不起眼的日子
又吃了多少食之無味的晚餐
而寂寞的冬天仍下著雨
夜晚的城市也依舊孤單

也不是非要懷念什麼吧
只是遺失的歲月有一些感傷
那些還來不及說再見的
會再見吧

怎麼這世界好像越來越陌生了
我知道我不該停下腳步
對你 記得我承諾過

又過了多少不起眼的日子
又吃了多少食之無味的晚餐
而寂寞的冬天仍下著雨
夜晚的城市也依舊孤單

也不是非要懷念什麼吧
只是遺失的歲月有一些感傷
那些還來不及說再見的
原諒我不明白你的悲傷

我知道感傷這樣就夠了
還需要一些面對明天的力量
那些還來不及說再見的
會再見吧

我知道我不該停下腳步
對你 記得我承諾過`,
    image: "images/1764124586214-148354144.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764124654763",
    title: "再見電影院",
    creators: ["芒果醬"],
    lyricist: ["郭佐治"],
    composer: ["郭佐治"],
    albums: "心跳保衛戰",
    release_date: "2023-12-21",
    language: "中文",
    genre: "",
    lyrics: `十二月那天 我跟妳作伙看電影
飲料 爆米花 四樓十四廳
看到 眼淚流 才知影我們都是演員
我們來 做一齣 好戲予他們看
電影 看完了 我們欲行
我牽妳的手 妳沓沓仔講 妳無法度行
電影 還要繼續演 妳說妳留在那
我欲繼續行 我欲繼續行去哪裡啊
要怎麼走
怎會沒人來救我 怎會沒人來喊卡
電影 還要繼續演 妳永遠留在那
我現在在這 伴著月娘的思念
思念妳啊
最美麗的電影 跟我最愛的人
さようなら

暫停的形狀 是相愛過的兩個人
也是 一座橋 分開妳和我
電影 播完了 我們就要回家啦
妳牽我的手 啊原來是夢 攏是一場空
電影 還要繼續演 妳說妳留在那
我欲繼續行 我欲繼續行去哪裡啊
要怎麼走
怎會沒人來救我 怎會沒人來喊卡
電影 還要繼續演 妳永遠留在那
我現在在這 伴著月娘的思念
思念妳啊
最美麗的電影 跟我最愛的人
さようなら
さようなら
さようなら
さようなら

是為什麼我現在在這
我沒想過妳會離開我
離開我
我還沒準備好 要怎樣對妳說
さようなら
さようなら
さようなら
さようなら
さようなら`,
    image: "images/1764124654760-549050841.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764124722344",
    title: "孤單滷三塊",
    creators: ["芒果醬"],
    lyricist: ["郭佐治"],
    composer: ["郭佐治"],
    albums: "心跳保衛戰",
    release_date: "2023-12-21",
    language: "中文",
    genre: "",
    lyrics: `是冬天的味道
我們一起笑著
該說聲晚安了
但明天的味道
被粗心打翻了
怎麼就這樣了
一個人吃著 最愛的滷三塊
而你呢 怎麼丟下我了
給你的愛 你的心 和你的靈魂
都在這裡 被孤單攪拌著
是冬天的味道
我們一起笑著
該說聲晚安了
但明天的味道
被粗心打翻了
怎麼就這樣了
都是我都是我
一個人吃著 最愛的滷三塊
而你呢 怎麼丟下我了
給你的愛 你的心 和你的靈魂
都在這裡 被孤單攪拌著
一個人吃著 最愛的滷三塊
而你呢 怎麼丟下我了
給你的愛 你的心 和你的靈魂
都在這裡 被孤單攪拌著`,
    image: "images/1764124722328-742728483.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764124851263",
    title: "打上花火",
    creators: ["DAOKO", "米津玄師"],
    lyricist: ["米津玄師"],
    composer: ["米津玄師"],
    albums: "打上花火",
    release_date: "2017-08-16",
    language: "日文",
    genre: "",
    lyrics: `あの日見渡した渚を　今も思い出すんだ
ano hi miwatashita nagisa wo　ima mo omoidasun da
那日眺望過的海岸　如今仍能憶起

砂の上に刻んだ言葉　君の後ろ姿
suna no ue ni kizanda kotoba　kimi no ushiro sugata
沙灘上刻劃下的文字　你的背影


寄り返す波が　足元をよぎり何かを攫う
yori kaesu nami ga　ashimoto wo yogiri nanikawo sarau
浪花往返　沖過腳邊帶走了些什麼

夕凪の中　日暮れだけが通り過ぎて行く
yuunagi no naka　higure dake ga toori sugite yuku
風平浪靜之中　日暮獨自溜走


パッと光って咲いた　花火を見ていた
patto hikatte saita　hanabi wo miteita
啪一聲綻放光芒　我們看著煙花

きっとまだ　終わらない夏が
kitto mada　owaranai natsu ga
還未結束的夏天　一定會將

曖昧な心を　解かして繋いだ
aimai na kokoro wo　tokashite tsunaida
曖昧的心　融化後相繫一起

この夜が　続いて欲しかった
kono yoru ga　tsuzuite hoshikatta
多希望　這個夜晚繼續下去



「あと何度君と同じ花火を見られるかな」って
ato nando kimi to onaji hanabi wo mirareru kanatte
「還能再與你共賞幾次同樣的煙花呢」

笑う顔に何ができるだろうか
warau kao ni nani ga dekiru darouka
為那笑臉我又能做些什麼


傷つくこと　喜ぶこと　繰り返す波と情動
kizutsuku koto　yorokobu koto　kurikaesu nami to joudou
受傷 喜悅 浪來浪去與情動

焦燥　最終列車の音
shousou　saishuu ressha no oto
焦躁 末班列車的聲音


何度でも　言葉にして君を呼ぶよ
nando demo　kotoba ni shite kimi wo yobuyo
無論幾次 我都會化作話語呼喚你

波間を選び　もう一度
namima wo erabi　mou ichido
待浪退時 再一次

もう二度と悲しまずに済むように
mou nidoto  kanashi mazu ni  sumuyou ni
是為了讓悲傷不再繼續就此而終


はっと息を飲めば　消えちゃいそうな光が
hatto iki wo nomeba　kiechai souna hikari ga
深深倒吸一口氣 那即將消失的光芒

きっとまだ　胸に住んでいた
kitto mada　mune ni sundeita
一定仍會 久留在胸中

手を伸ばせば触れた　あったかい未来は
te wo nobaseba fureta　attakai mirai wa
只要伸出手便能觸碰 那溫暖的未來

ひそかに二人を見ていた
hisoka ni futari wo miteita
正暗中窺伺著我倆



パッと花火が
patto hanabi ga
啪一聲煙花

夜に咲いた
yoru ni saita
於夜裡綻放

夜に咲いて
yoru ni saite
夜裡綻放後

静かに消えた
shizuka ni kieta
悄悄消失無蹤

離さないで
hanasa naide
別讓我走

もう少しだけ
mou sukoshi dake
再一下下就好

もう少しだけ
mou sukoshi dake
再一下下就好

このままで
kono mama de
維持現在這樣



あの日見渡した渚を　今も思い出すんだ
ano hi miwatashita nagisa wo　ima mo omoidasun da
那日眺望過的海岸　如今仍能憶起

砂の上に刻んだ言葉　君の後ろ姿
suna no ue ni kizanda kotoba　kimi no ushiro sugata
沙灘上刻劃下的文字　你的背影


パッと光って咲いた　花火を見ていた
patto hikatte saita　hanabi wo miteita
啪一聲綻放光芒　我們看著煙花

きっとまだ　終わらない夏が
kitto mada　owaranai natsu ga
還未結束的夏天　一定會將

曖昧な心を　解かして繋いだ
aimai na kokoro wo　tokashite tsunaida
曖昧的心　融化後相繫一起

この夜が　続いて欲しかった
kono yoru ga　tsuzuite hoshikatta
多希望　這個夜晚繼續下去


中文翻譯：Alice／箱庭博物館

羅馬翻譯：理璃(ルリ)`,
    image: "images/1764124851260-120977661.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764124962271",
    title: "ピースサイン - Peace Sign",
    creators: ["米津玄師"],
    lyricist: ["米津玄師"],
    composer: ["米津玄師"],
    albums: "ピースサイン - Peace Sign",
    release_date: "2017-06-21",
    language: "日文",
    genre: "",
    lyrics: `いつか僕らの上をスレスレに　通り過ぎていったあの飛行機を
i tsu ka boku ra no ue wo sure sure ni     toori sugi te itta a no hikouki wo
某日低空飛過　我們頭頂的那架飛機

不思議なくらいに憶えてる　意味もないのに　なぜか
fushigi na ku ra i ni oboe te ru     imi mo na i no ni     na ze ka
我們竟奇妙地一直記在心底　明明毫無意義　為什麼呢

不甲斐なくて泣いた日の夜に　ただ強くなりたいと願ってた
fugainaku te naita hi no yoru ni     ta da tsuyoku na ri ta i to negatte ta
窩囊哭泣的夜裡　一心祈禱能變得更堅強

そのために必要な勇気を　探し求めていた
so no ta me ni hitsuyou na yuuki wo     sagashi motome te i ta
為此我們追尋著　不可或缺的勇氣


残酷な運命が定まってるとして
zankoku na unmei ga sadamatte ru to shi te
即使殘酷的命運已注定無法改變

それがいつの日か僕の前に現れるとして
so re ga i tsu no hi ka boku no mae ni araware ru to shi te
即使那總有一天會降臨在我的面前

ただ一瞬　この一瞬　息ができるなら
ta da issyun     ko no issyun     iki ga de ki ru na ra
但只要一瞬　就這一瞬　還能呼吸

どうでもいいと思えた　その心を
do u de mo i i to omoe ta     so no kokoro wo
這顆心　便覺得怎樣都無所謂


もう一度　遠くへ行け遠くへ行けと　僕の中で誰かが歌う
mo u ichido     tooku he ike tooku he ike to     boku no naka de dare ka ga utau
再一次　往遠方前進往遠方前進　在我之中的某個誰如此高歌

どうしようもないほど熱烈に
do u shi yo u mo na i ho do netsuretsu ni
熱烈地無法自拔

いつだって目を腫らした君が二度と　悲しまないように笑える
i tsu datte me wo harashi ta kimi ga nido to     kanashi ma na i yo u ni warae ru
無論何時　只為讓哭腫雙眼的你　不再悲傷　我會展露笑容

そんなヒーローになるための歌
so n na hi-ro- ni na ru ta me no uta
這是為了成為那樣的英雄而生的歌


さらば掲げろピースサイン
sa ra ba kakage ro pi-su sain
再會了　高舉勝利手勢

転がっていくストーリーを
korogatte i ku suto-ri- wo
讓我們的故事繼續轉動


守りたいだなんて言えるほど　君が弱くはないのわかってた
mamori ta i da na n te ie ru ho do     kimi ga yowaku wa na i no wa katte ta
我不會說我想要保護你　因為我知道你並沒有那麼脆弱

それ以上に僕は弱くてさ　君が大事だったんだ
so re ijyou ni boku wa yowaku te sa     kimi ga daiji datta n da
而比起你我更加軟弱　是因為你對我來說很重要啊

「独りで生きていくんだ」なんてさ　口をついて叫んだあの日から
"hitori de iki te i ku n da" na n te sa     kuchi wo tsu i te sakenda a no hi ka ra
「要一個人活下去」　曾經將這句話掛在嘴邊的我

変わっていく僕を笑えばいい　独りが怖い僕を
kawatte i ku boku wo warae ba i i     hitori ga kowai boku wo
如今正逐漸改變　就笑吧　嘲笑變得害怕一個人的我


蹴飛ばして噛み付いて息もできなくて
ketobashi te kami tsuite iki mo de ki na ku te
用力踢遠用力咬緊　就快要不能呼吸

騒ぐ頭と腹の奥がくしゃくしゃになったって
sawagu atama to hara no oku ga ku sya ku sya ni nattatte
哪怕吵雜的腦袋和體內深處　亂成一團

衒いも外連も消えてしまうくらいに
terai mo keren mo kie te shi ma u ku ra i ni
連裝模作樣和騙人花招都要消失般

今は触っていたいんだ　君の心に
ima wa sawatte i ta i n da     kimi no kokoro ni
我現在就想碰到　你的心


僕たちは　きっといつか遠く離れた太陽にすら手が届いて
boku ta chi wa     kitto i tsu ka tooku hanare ta taiyou ni su ra te ga todoite
我們　一定總有一天連遠在天邊的太陽　都能伸手觸及

夜明け前を手に入れて笑おう
yoake mae wo te ni ire te waraou
讓我們抓緊破曉並相視而笑吧

そうやって青く燃える色に染まり　おぼろげな街の向こうへ
so u yatte aoku moe ru iro ni somari     o bo ro ge na machi no mukou he
就這樣染上燒得青藍的顏色　往朦朧的城鎮出發

手をつないで走っていけるはずだ
te wo tsu na i de hashitte i ke ru ha zu da
我相信我們能牽著手向那奔去


君と未来を盗み描く　捻りのないストーリーを
kimi to mirai wo nusumi egaku     hineri no na i suto-ri- wo
與你一起去偷偷描繪未來　描繪那平凡無奇的故事


かさぶただれけ荒くれた日々が　削り削られ擦り切れた今が
ka sa bu ta da re ke araku re ta hibi ga     kezuri kezurare suri kire ta ima ga
遍體鱗傷粗暴胡來的那些日子　削減被削減而殘破不堪的現在

君の言葉でよみがえる　鮮やかにも現れていく
kimi no kotoba de yo mi ga e ru     azayaka ni mo araware te i ku
都因你說的話再次甦醒　逐漸鮮明地　浮現眼前

さなぎのままで眠る魂を　食べかけのまま捨てたあの夢を
sa na gi no ma ma de nemuru tamashii wo     tabe ka ke no ma ma sute ta a no yume wo
作繭自縛沉睡的靈魂　淺嚐幾口便捨棄的那個夢想

もう一度取り戻せ
mo u ichido tori modose
讓我們再次去搶奪回來吧


もう一度　遠くへ行け遠くへ行けと　僕の中で誰かが歌う
mo u ichido     tooku he ike tooku he ike to     boku no naka de dare ka ga utau
再一次　往遠方前進往遠方前進　在我之中的某個誰如此高歌

どうしようもないほど熱烈に
do u shi yo u mo na i ho do netsuretsu ni
熱烈地無法自拔

いつだって目を腫らした君が二度と　悲しまないように笑える
i tsu datte me wo harashi ta kimi ga nido to     kanashi ma na i yo u ni warae ru
無論何時　只為讓哭腫雙眼的你　不再悲傷　我會展露笑容

そんなヒーローになるための歌
so n na hi-ro- ni na ru ta me no uta
這是為了成為那樣的英雄而生的歌


さらば掲げろピースサイン　転がってくストーリーを
sa ra ba kakage ro pi-su sain     korogatte ku suto-ri- wo
再會了　高舉勝利手勢　讓我們的故事繼續轉動

君と未来を盗み描く　捻りのないストーリーを
kimi to mirai wo nusumi egaku     hineri no na i suto-ri- wo
與你一起去偷偷描繪未來　描繪那平凡無奇的故事

中文翻譯：Alice／箱庭博物館`,
    image: "images/1764124962269-464327554.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764156495968",
    title: "Viva La Vida",
    creators: ["Coldplay"],
    lyricist: ["Berryman", "Buckland", "Champion", "Martin"],
    composer: ["Berryman", "Buckland", "Champion", "Martin"],
    albums: "Viva La Vida Or Death And All His Friends",
    release_date: "2008-06-12",
    language: "英文",
    genre: "",
    lyrics: `I used to rule the world
Seas would rise when I gave the word
Now in the morning, I sleep alone
Sweep the streets I used to own
I used to roll the dice
Feel the fear in my enemy's eyes
Listen as the crowd would sing
Now the old king is dead, long live the king
One minute, I held the key
Next the walls were closed on me
And I discovered that my castles stand
Upon pillars of salt and pillars of sand
I hear Jerusalem bells a-ringin'
Roman Cavalry choirs are singin'
Be my mirror, my sword and shield
My missionaries in a foreign field
For some reason, I can't explain
Once you'd gone, there was never, never an honest word
And that was when I ruled the world
It was a wicked and wild wind
Blew down the doors to let me in
Shattered windows and the sound of drums
People couldn't believe what I'd become
Revolutionaries wait
For my head on a silver plate
Just a puppet on a lonely string
Aw, who would ever wanna be king?
I hear Jerusalem bells a-ringin'
Roman Cavalry choirs are singing
Be my mirror, my sword and shield
My missionaries in a foreign field
For some reason, I can't explain
I know Saint Peter won't call my name
Never an honest word
But that was when I ruled the world
Oh-oh-oh, oh-oh, oh
Oh-oh-oh, oh-oh, oh
Oh-oh-oh, oh-oh, oh
Oh-oh-oh, oh-oh, oh
Oh-oh-oh, oh-oh, oh
I hear Jerusalem bells a-ringin'
Roman Cavalry choirs are singin'
Be my mirror, my sword and shield
My missionaries in a foreign field
For some reason I can't explain
I know Saint Peter won't call my name
Never an honest word
But that was when I ruled the world`,
    image: "images/1764156495487-167623963.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764176205400",
    title: "沙漏",
    creators: ["陳綺貞"],
    lyricist: ["陳綺貞"],
    composer: ["陳綺貞"],
    albums: "時間的歌",
    release_date: "2013-12-06",
    language: "中文",
    genre: "",
    lyrics: `我用沙子蓋一座城堡 為什麼浪一來就不見了
我用沙子畫一幅畫 為什麼風一吹就不見了

我把沙子全都關起來 為什麼時間不為我留下
昨天的沙灘還在那 昨天的腳印去哪裡了

他們說 生命像一粒沙
如果生命她會說話
她會說 謝謝你愛她
像大海愛著浪花


我讓沙子全都睡著了 數著他們我也睡著了
在夢裡我看見他們 一閃一閃還為我亮著

他們說 生命像一粒沙
如果生命她會說話
她會說謝謝你愛她
像大海愛著浪花

他們說 生命像一粒沙
如果生命她會說話
她會說 謝謝你愛她
像大海愛著浪花

他們說 生命像一粒沙 如果生命她會說話
她會說 謝謝你愛我
像大海愛著浪花 像大海愛著浪花

我用沙子蓋一座城堡 為什麼浪一來就不見了
昨天的沙灘還在那 昨天的腳印去哪裡了`,
    image: "images/1764176205074-777963343.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764176379417",
    title: "揹上悲傷北上",
    creators: ["Crispy脆樂團"],
    lyricist: ["盧羿安"],
    composer: ["盧羿安"],
    albums: "愛是我們必經的辛苦",
    release_date: "2022-09-19",
    language: "中文",
    genre: "獨立音樂",
    lyrics: `時間在身上的壓痕
讓我們成了有皺摺的大人
期待終究還是擦身
日子卻自顧自地在發生

涼掉的 飯菜 配著涼掉的心
倒掉 青春 也倒掉了你
潮濕的 空氣 一樣潮濕的身體

你揹上悲傷北上 在該受傷的時候 受傷
不管靈魂變成什麼形狀 你還是你啊
你揹上悲傷北上 在該愛上的時候 愛上
不管笑容變成什麼模樣 你還是你啊

告訴自己這樣也好
偶爾吃頓飯人擠人拍照
你愛的人一切都好
那就好 那就好

你還在用力 對抗這個世界
不問對錯 或公不公平
你還在那裡 你一直都在那裡

你揹上悲傷北上 在該堅強的時候 堅強
不管靈魂變成什麼形狀 你還是你啊
你揹上悲傷北上 在該遺忘的時候 遺忘
不管笑容變成什麼模樣 你還是你啊

你揹上悲傷北上
你揹上悲傷北上
你揹上悲傷北上
你揹上悲傷北上
最後剩下幾個傻的願望
都留給你啊`,
    image: "images/1764176379091-772496982.jpg",
    original_artist: [],
    rating: ""
  },
  {
    id: "song1764176591656",
    title: "被動",
    creators: ["伍佰"],
    lyricist: ["潘麗玉"],
    composer: ["吳俊霖"],
    albums: "愛你伍佰年",
    release_date: "2004-05-27",
    language: "中文",
    genre: "",
    lyrics: `我可以很久不和你聯絡 任日子一天天這麼過
讓自己忙碌可以當作藉口 逃避想念你的種種軟弱

我可以學會對你很冷漠 為何學不會將愛沒收
面對你是對我最大的折磨 這些年始終沒有對你說

愛你越久我越被動 只因你的愛居無定所
是你讓我的心慢慢退縮 退到你看不見的角落

愛你越久我越被動 只因我的愛不再為你揮霍
是我讓我的心失去自由 卻再也沒有勇氣放縱

李韋

我可以很久不和你聯絡 任日子一天天這麼過
讓自己忙碌可以當作藉口 逃避想念你的種種軟弱

我可以學會對你很冷漠 為何學不會將愛沒收
面對你是對我最大的折磨 這些年始終沒有對你說

愛你越久我越被動 只因你的愛居無定所
是你讓我的心慢慢退縮 退到你看不見的角落

愛你越久我越被動 只因我的愛不再為你揮霍
是我讓我的心失去自由 卻再也沒有勇氣放縱

愛你越久我越被動 只因你的愛居無定所
是你讓我的心慢慢退縮 退到你看不見的角落

愛你越久我越被動 只因我的愛不再為你揮霍
是我讓我的心失去自由 卻再也沒有勇氣放縱
沒有勇氣放縱`,
    image: "images/1764176591328-105700147.jpg",
    original_artist: [],
    rating: ""
  }
];

// 詩詞資料
const poems = [
  {
    id: "poem1761567655144",
    title: "Interstellar",
    creators: ["Cooper"],
    lyrics:
      "We used to look up at the sky and wonder at our place in the stars, now we just look down and worry about our place in the dirt.",
    image: "",
    language: "英文",
    translation: ""
  },
  {
    id: "poem1764125023278",
    title: "月亮",
    creators: ["陳綺貞"],
    lyrics:
      "作品是指向月亮的手指\r\n希望大家能夠好好地感受月亮\r\n無需過多在意這根手指",
    image: "",
    language: "白話文",
    translation: ""
  },
  {
    id: "poem1764145161407",
    title: "斐德若篇",
    creators: ["蘇格拉底", "柏拉圖"],
    lyrics:
      "可是也並非沒有在長羽翼上努力過，他們的靈魂也離開了肉體。這對於他們的愛情的迷狂不算是一個小報酬，因為按照規律，凡是提過腳預備走登天大路的人們，就不至於要走陰間黑路，他們就要手牽著手前行，過著光明而愉快的生活，到了應長羽翼的時候，他們還是長羽翼，為了他們的愛情的緣故。",
    image: "",
    language: "白話文",
    translation: ""
  },
  {
    id: "poem1764153480003",
    title: "La La Land",
    creators: ["Mia"],
    lyrics:
      "My aunt used to live in Paris \r\nI remember, she used to come home and she would tell us\r\nThese stories about being abroad And I remember, she told us that she jumped\r\ninto the river once. Barefoot\r\n\r\nShe smiled...\r\n\r\nLeapt without looking \r\nAnd tumbled into the Seine \r\nThe water was freezing \r\nShe spent a month the sneezing \r\nBut said she would do it again\r\n\r\nHere's to the ones who dream\r\nFoolish as they may seem \r\nHere's to the hearts that ache \r\nHere's to the mess we make\r\n\r\nShe captured a feeling \r\nSky with no ceiling \r\nThe sunset inside a frame\r\n\r\nShe lived in her liquor \r\nAnd died with a flicker \r\nI'll always remember the flame\r\n\r\nHere's to the ones who dream \r\nFoolish as they may seem \r\nHere's to the hearts that ache \r\nHere's to the mess we make\r\n\r\nShe told me:\r\n\"A bit of madness is key\r\nTo give us new colors to see\r\nWho knows where it will lead us? \r\nAnd that's why they need us\"\r\n\r\nSo bring on the rebels \r\nThe ripples from pebbles \r\nThe painters, and poets, and plays\r\n\r\nAnd here's to the fools who dream \r\nCrazy as they may seem \r\nHere's to the hearts that break \r\nHere's to the mess we make\r\n\r\nI trace it all back to then \r\nHer, and the snow, and the Seine \r\nSmiling through it \r\nShe said she'd do it again",
    image: "",
    language: "英文",
    translation:
      "我姑姑以前住過巴黎\r\n我記得她會回家告訴我們\r\n身在國外的各種事情\r\n\r\n我記得\r\n她說她有次跳進塞納河\r\n光著腳\r\n微笑著\r\n看也沒看就往下一跳\r\n落入了………塞納河中\r\n河水寒微骨，她傷風感冒整個月\r\n卻說她會再一次躍身其中\r\n敬那些做夢的人，哪怕他們有點傻\r\n敬那些痛著的心，敬我們製造的混亂\r\n\r\n她捕捉到一種感覺\r\n高不見頂的蒼穹\r\n畫框中的夕陽\r\n她泡在酒精裡\r\n一點一滴死去\r\n我將永遠記得那份熱情\r\n敬那些做夢的人\r\n哪怕他們有點傻\r\n敬那些痛著的心\r\n敬我們製造的混亂\r\n\r\n她告訴我\r\n正是那一絲絲瘋狂\r\n讓我們看見新的色彩\r\n誰知道它將帶我們前往何方\r\n因此世界才需要我們\r\n所以讓叛逆者上場吧\r\n那些石頭激起的漣漪\r\n畫家、詩人和劇作\r\n敬那些做夢的傻瓜\r\n哪怕他們顯得瘋狂\r\n敬那些破碎的心\r\n敬那些我們製造的混亂\r\n\r\n我的初衷全都來自於\r\n她、雪與塞納河\r\n始終帶著微笑\r\n她說她會再一次\r\n躍身其中"
  }
];

const favorites = [
  {
    id: "fav1761406730335",
    lyrics: `年少的我們 不懂遺忘 是最美的悲傷`,
    note: "",
    songId: "song1761403952320",
    songTitle: "年少的我們永遠輕狂",
    songCreators: "Crispy脆樂團",
    createdAt: "2025-10-25T15:38:50.335Z"
  },
  {
    id: "fav1761406976963",
    lyrics: `為何相愛的人 沒有相愛的勇氣`,
    note: "",
    songId: "song1761405050233",
    songTitle: "團長",
    songCreators: "芒果醬",
    createdAt: "2025-10-25T15:42:56.964Z"
  },
  {
    id: "fav1761411167179",
    lyrics: `不必花多餘的⼒氣感受`,
    note: "",
    songId: "song1761410948394",
    songTitle: "安平之光",
    songCreators: "イルカポリス 海豚刑警",
    createdAt: "2025-10-25T16:52:47.179Z"
  },
  {
    id: "fav1761411214837",
    lyrics: `世界不再以比較級的⽅式運作`,
    note: "",
    songId: "song1761410948394",
    songTitle: "安平之光",
    songCreators: "イルカポリス 海豚刑警",
    createdAt: "2025-10-25T16:53:34.837Z"
  },
  {
    id: "fav1761567676321",
    lyrics: `We used to look up at the sky and wonder at our place in the stars, now we just look down and worry about our place in the dirt.`,
    note: "",
    songId: "poem1761567655144",
    songTitle: "Interstellar",
    songCreators: "Cooper",
    createdAt: "2025-10-27T12:21:16.321Z"
  },
  {
    id: "fav1761574210310",
    lyrics: `我開口卻只能吐出沉默`,
    note: "",
    songId: "song1761565779906",
    songTitle: "偷偷愛",
    songCreators: "美秀集團",
    createdAt: "2025-10-27T14:10:10.310Z"
  },
  {
    id: "fav1761575584701",
    lyrics: `把 愛 勇氣 希望 都賣了
能換來多少錢`,
    note: "",
    songId: "song1761575536931",
    songTitle: "小紫aka給我錢",
    songCreators: "芒果醬",
    createdAt: "2025-10-27T14:33:04.701Z"
  },
  {
    id: "fav1761576697340",
    lyrics: `daladada`,
    note: "",
    songId: "song1761576678292",
    songTitle: "留給你的我從未",
    songCreators: "甜約翰",
    createdAt: "2025-10-27T14:51:37.340Z"
  },
  {
    id: "fav1761579383807",
    lyrics: `歲月 眨眼就過了 
瞬間 就那樣默默的`,
    note: "",
    songId: "song1761577478386",
    songTitle: "才二十三",
    songCreators: "方大同",
    createdAt: "2025-10-27T15:36:23.807Z"
  },
  {
    id: "fav1761623937284",
    lyrics: `你說 哭吧 想哭啊
就讓眼淚變成大海啊`,
    note: "",
    songId: "song1761576538306",
    songTitle: "大海",
    songCreators: "南西肯恩",
    createdAt: "2025-10-28T03:58:57.284Z"
  },
  {
    id: "fav1761629161090",
    lyrics: `帶著未來和我遇見`,
    note: "",
    songId: "song1761629134824",
    songTitle: "等一個人",
    songCreators: "林芯儀",
    createdAt: "2025-10-28T05:26:01.090Z"
  },
  {
    id: "fav1761629412992",
    lyrics: `向飛馳而過的自己拜託
請永遠記得那場雪`,
    note: "",
    songId: "song1761629289987",
    songTitle: "人間螢火",
    songCreators: "夏日入侵企画",
    createdAt: "2025-10-28T05:30:12.992Z"
  },
  {
    id: "fav1761795395218",
    lyrics: `當時間不再向前
停靠在那年秋天`,
    note: "",
    songId: "song1761577583216",
    songTitle: "停靠",
    songCreators: "胡凱兒",
    createdAt: "2025-10-30T03:36:35.218Z"
  },
  {
    id: "fav1761929990799",
    lyrics: `臉上  粼粼的波光`,
    note: "",
    songId: "song1761878313175",
    songTitle: "風",
    songCreators: "芒果醬",
    createdAt: "2025-10-31T16:59:50.799Z"
  },
  {
    id: "fav1762014565902",
    lyrics: `要用多少個漣漪來忘了風來過`,
    note: "",
    songId: "song1761878313175",
    songTitle: "風",
    songCreators: "芒果醬",
    createdAt: "2025-11-01T16:29:25.902Z"
  },
  {
    id: "fav1762014583283",
    lyrics: `我們一定要做世界第一`,
    note: "",
    songId: "song1761933893259",
    songTitle: "Bitter Sweet",
    songCreators: "芒果醬",
    createdAt: "2025-11-01T16:29:43.283Z"
  },
  {
    id: "fav1762707263597",
    lyrics: `彷彿沒愛過`,
    note: "",
    songId: "song1762707222597",
    songTitle: "其實",
    songCreators: "薛之謙",
    createdAt: "2025-11-09T16:54:23.597Z"
  },
  {
    id: "fav1762707900330",
    lyrics: `另一個我們還深愛著 代替我們永恒著
如果能這麼想 就夠了`,
    note: "",
    songId: "song1762707828781",
    songTitle: "後來的我們",
    songCreators: "五月天",
    createdAt: "2025-11-09T17:05:00.330Z"
  },
  {
    id: "fav1763012515463",
    lyrics: `人類用沙 想捏出夢里通天塔
為貪念不惜代價`,
    note: "",
    songId: "song1763012036493",
    songTitle: "動物世界",
    songCreators: "薛之謙",
    createdAt: "2025-11-13T05:41:55.463Z"
  },
  {
    id: "fav1764125053575",
    lyrics: `帶不走的 丟不掉的 
讓大雨侵蝕吧`,
    note: "",
    songId: "song1763045203185",
    songTitle: "魚",
    songCreators: "陳綺貞",
    createdAt: "2025-11-26T02:44:13.575Z"
  },
  {
    id: "fav1764125078638",
    lyrics: `也不是非要懷念什麼吧
只是遺失的歲月有一些感傷`,
    note: "",
    songId: "song1764124586215",
    songTitle: "原諒我不明白你的悲傷",
    songCreators: "那我懂你意思了",
    createdAt: "2025-11-26T02:44:38.638Z"
  },
  {
    id: "fav1764145221423",
    lyrics: `凡是提過腳預備走登天大路的人們
就不至於要走陰間黑路`,
    note: "",
    songId: "poem1764145161407",
    songTitle: "斐德若篇",
    songCreators: "蘇格拉底, 柏拉圖",
    createdAt: "2025-11-26T08:20:21.423Z"
  }
];

// 渲染歌曲列表
function renderSongs() {
  const songGrid = document.getElementById("songGrid");
  if (!songGrid) return;

  const sortByElement = document.getElementById("songSort");
  const sortOrderElement = document.getElementById("sortOrder");
  const sortBy = sortByElement ? sortByElement.value : "dateAdded";
  const sortOrder = sortOrderElement ? sortOrderElement.value : "desc"; // desc=遞減, asc=遞增

  let sortedSongs = [...songs];

  switch (sortBy) {
    case "dateAdded":
      // 按加入日期排序（ID中的時間戳）
      sortedSongs.sort((a, b) => {
        const timeA = parseInt(a.id.replace("song", "")) || 0;
        const timeB = parseInt(b.id.replace("song", "")) || 0;
        return sortOrder === "desc" ? timeB - timeA : timeA - timeB;
      });
      console.log(
        `✅ 按加入日期${sortOrder === "desc" ? "遞減" : "遞增"}排序完成`
      );
      break;
    case "releaseDate":
      // 按發行日期排序 - 統一使用 release_date 欄位
      sortedSongs.sort((a, b) => {
        // 🔴 只使用 release_date 欄位，格式為 YYYY-MM-DD
        const dateA = new Date(a.release_date || "1900-01-01");
        const dateB = new Date(b.release_date || "1900-01-01");

        // 檢查日期是否有效
        if (isNaN(dateA.getTime())) {
          console.warn(
            `無效的發行日期 A: ${a.release_date} (歌曲: ${a.title})`
          );
          dateA.setFullYear(1900, 0, 1);
        }
        if (isNaN(dateB.getTime())) {
          console.warn(
            `無效的發行日期 B: ${b.release_date} (歌曲: ${b.title})`
          );
          dateB.setFullYear(1900, 0, 1);
        }

        // 根據排序方向返回結果
        return sortOrder === "desc"
          ? dateB.getTime() - dateA.getTime()
          : dateA.getTime() - dateB.getTime();
      });

      console.log(
        `✅ 按發行日期${sortOrder === "desc" ? "遞減" : "遞增"}排序完成`
      );
      break;

    case "alphabet":
      // 按字母排序
      sortedSongs.sort((a, b) => {
        const result = a.title.localeCompare(b.title, "zh-TW");
        return sortOrder === "desc" ? -result : result;
      });
      console.log(`✅ 按字母${sortOrder === "desc" ? "遞減" : "遞增"}排序完成`);
      break;

    default:
      console.log("✅ 使用預設排序");
  }

  songGrid.innerHTML = sortedSongs
    .map((song) => {
      const creators = song.creators ? song.creators.join(", ") : "";
      const lyricist = song.lyricist ? song.lyricist.join(", ") : "";
      const composer =
        song.composer && song.composer.length > 0
          ? song.composer.join(", ")
          : "";
      const albums = song.albums || "";

      return `
                <div class="song-card" onclick="showSongDetail('${
                  song.id
                }', 'song')">
                    <img src="${song.image || "images/gray.jpg"}" alt="${
        song.title
      }" />
                    <div class="song-card-content">
                        <div class="song-info">
                            <h3>${song.title}</h3>
                            <p class="creator">${creators}</p>
                            ${
                              albums
                                ? `<p class="album mobile-show">${albums}</p>`
                                : ""
                            }
                        </div>
                        
                        <div class="song-meta desktop-only">
                            ${
                              lyricist
                                ? `<div class="meta-item"><span class="meta-label">作詞：</span>${lyricist}</div>`
                                : ""
                            }
                            ${
                              composer
                                ? `<div class="meta-item"><span class="meta-label">作曲：</span>${composer}</div>`
                                : ""
                            }
                            ${
                              albums
                                ? `<div class="meta-item"><span class="meta-label">專輯：</span>${albums}</div>`
                                : ""
                            }
                        </div>
                        
                        <div class="song-tags">
                            ${
                              song.language
                                ? `<span class="tag tag--language">${song.language}</span>`
                                : ""
                            }
                            ${
                              song.genre
                                ? `<span class="tag tag--genre">${song.genre}</span>`
                                : ""
                            }
                        </div>
                    </div>
                    <div class="song-card-arrow">→</div>
                </div>
            `;
    })
    .join("");

  console.log(
    `✅ 已渲染 ${sortedSongs.length} 首歌曲，排序: ${sortBy} ${sortOrder}`
  );
}

// 渲染詩詞列表
function renderPoems() {
  const poemGrid = document.getElementById("poemGrid");
  poemGrid.innerHTML = poems
    .map(
      (poem) => `
        <div class="song-card" onclick="showSongDetail('${poem.id}', 'poem')">
          <img src="${poems.image || "images/gray.jpg"}" alt="${poem.title}">
          <div class="song-card-content">
            <h3>${poem.title}</h3>
            <p>${poem.creators ? poem.creators.join(", ") : poem.artist}</p>
          </div>
        </div>
      `
    )
    .join("");
}

// 顯示歌曲/詩詞詳情
function showSongDetail(id, type) {
  const data = type === "song" ? songs : poems;
  const item = data.find((s) => s.id === id);
  if (!item) return;

  const songDetail = document.getElementById("songDetail");
  songDetail.innerHTML = `
    <div class="song-detail">
      <a href="#${
        type === "song" ? "songs" : "poems"
      }" class="back-btn" onclick="goBack('${
    type === "song" ? "songs" : "poems"
  }')">← 返回</a>
      <div class="song-detail-header">
        ${item.image ? `<img src="${item.image}" alt="${item.title}">` : ""}
        <h1>${item.title}</h1>
        <p class="artist">${item.creators ? item.creators.join(", ") : ""}</p>
      </div>
      <a href="#" class="favorite-link" onclick="openFavoriteModal('${
        item.id
      }', '${item.title.replace(/'/g, "\\'")}', '${
    item.creators ? item.creators.join(", ").replace(/'/g, "\\'") : ""
  }'); return false;">
  收藏歌詞
</a>
      ${generateSongMeta(item)} 
      <div class="lyrics">${item.lyrics}</div>

       <!-- 🔴 新增刪除按鈕 (只在歌曲頁面顯示) -->
      ${
        type === "song"
          ? `
          <button class="delete-song-btn" onclick="deleteSong('${
            item.id
          }', '${item.title.replace(/'/g, "\\'")}'); return false;">
              刪除歌曲
          </button>
      `
          : ""
      }
    </div>
  `;
  // 切換到詳情頁面
  showPage("songDetail");

  // 顯示前後導航按鈕
  updateNavigationButtons(id, type);
}

// 更新導航按鈕
function updateNavigationButtons(currentId, type) {
  const data = type === "song" ? songs : poems;
  const currentIndex = data.findIndex((s) => s.id === currentId);
  const prevBtn = document.getElementById("prevPostBtn");
  const nextBtn = document.getElementById("nextPostBtn");

  if (currentIndex > 0) {
    prevBtn.style.display = "flex";
    prevBtn.onclick = () => showSongDetail(data[currentIndex - 1].id, type);
  } else {
    prevBtn.style.display = "none";
  }

  if (currentIndex < data.length - 1) {
    nextBtn.style.display = "flex";
    nextBtn.onclick = () => showSongDetail(data[currentIndex + 1].id, type);
  } else {
    nextBtn.style.display = "none";
  }
}

// 返回列表頁面
function goBack(page) {
  showPage(page);
  document.getElementById("prevPostBtn").style.display = "none";
  document.getElementById("nextPostBtn").style.display = "none";
}

// 顯示指定頁面
function showPage(pageId) {
  document.querySelectorAll(".page").forEach((page) => {
    page.classList.remove("active");
  });
  document.getElementById(pageId).classList.add("active");

  // 更新導航連結的 active 狀態
  document.querySelectorAll(".nav-link").forEach((link) => {
    link.classList.remove("active");
    if (link.dataset.page === pageId) {
      link.classList.add("active");
    }
  });

  // 隱藏箭頭按鈕（如果不是詳情頁面）- 加入檢查避免錯誤
  if (pageId !== "songDetail") {
    const prevBtn = document.getElementById("prevPostBtn");
    const nextBtn = document.getElementById("nextPostBtn");
    if (prevBtn) prevBtn.style.display = "none";
    if (nextBtn) nextBtn.style.display = "none";
  }

  // 關閉選單和遮罩
  const nav = document.getElementById("nav");
  const overlay = document.getElementById("overlay");
  if (nav) nav.classList.remove("active");
  if (overlay) overlay.classList.remove("active");
}

// 導航連結點擊事件
document.querySelectorAll(".nav-link").forEach((link) => {
  link.addEventListener("click", (e) => {
    e.preventDefault();
    const page = link.dataset.page;
    showPage(page);

    // 關閉手機版選單
    if (window.innerWidth <= 768) {
      document.getElementById("nav").classList.remove("active");
    }
  });
});

// 手機版選單切換
document.getElementById("menuBtn").addEventListener("click", () => {
  document.getElementById("nav").classList.toggle("active");
});

// 初始化
renderSongs();
renderPoems();

function toggleMenu() {
  const nav = document.getElementById("nav");
  const overlay = document.getElementById("overlay");

  if (nav) nav.classList.toggle("active");
  if (overlay) overlay.classList.toggle("active");
}
function makeCard(item, onClick) {
  const creators = getCreatorsText(item);
  const lyricist = item.lyricist ? item.lyricist.join(", ") : "";
  const composer =
    item.composer && item.composer.length > 0 ? item.composer.join(", ") : "";
  const albums = item.albums || "";

  return `
        <div class="song-card" onclick="${onClick}">
            <img src="${item.image || ""}" alt="${item.title}">
            <div class="song-card-content">
                <div class="song-info">
                    <h3>${item.title}</h3>
                    <p class="creator">${creators}</p>
                    ${
                      albums ? `<p class="album mobile-show">${albums}</p>` : ""
                    }
                </div>
                <div class="song-meta desktop-only">
                    ${
                      lyricist
                        ? `<div class="meta-item"><span class="meta-label">作詞:</span> ${lyricist}</div>`
                        : ""
                    }
                    ${
                      composer
                        ? `<div class="meta-item"><span class="meta-label">作曲:</span> ${composer}</div>`
                        : ""
                    }
                    ${
                      albums
                        ? `<div class="meta-item"><span class="meta-label">專輯:</span> ${albums}</div>`
                        : ""
                    }
                </div>
                <div class="song-card-arrow">→</div>
            </div>
        </div>
    `;
}

// 圖片預覽功能
document.getElementById("songImage")?.addEventListener("change", function (e) {
  const file = e.target.files[0];
  const preview = document.getElementById("imagePreview");

  if (file) {
    const reader = new FileReader();
    reader.onload = function (e) {
      preview.innerHTML = `<img src="${e.target.result}" alt="預覽圖" style="max-width: 200px; border-radius: 8px; margin-top: 10px;">`;
    };
    reader.readAsDataURL(file);
  } else {
    preview.innerHTML = "";
  }
});

// 處理表單提交
document
  .getElementById("uploadForm")
  ?.addEventListener("submit", async function (e) {
    e.preventDefault();

    const statusDiv = document.getElementById("uploadStatus");
    const formData = new FormData(this);

    // 顯示上傳中狀態
    statusDiv.innerHTML =
      '<p style="color: var(--color-primary);">上傳中...</p>';
    statusDiv.className = "upload-status active";

    try {
      const response = await fetch("/api/upload-song", {
        method: "POST",
        body: formData
      });

      const result = await response.json();

      if (response.ok) {
        statusDiv.innerHTML = `<p style="color: var(--color-success);">✅ ${result.message}</p>`;
        this.reset();
        document.getElementById("imagePreview").innerHTML = "";

        // 3秒後重新整理歌曲列表
        setTimeout(() => {
          window.location.reload();
        }, 2000);
      } else {
        statusDiv.innerHTML = `<p style="color: var(--color-error);">❌ ${result.error}</p>`;
      }
    } catch (error) {
      statusDiv.innerHTML = `<p style="color: var(--color-error);">❌ 連線錯誤：${error.message}</p>`;
    }
  });

// ===== 首頁功能 =====

// 渲染首頁統計資訊
function renderHomeStats() {
  const statSongs = document.getElementById("statSongs");
  const statArtists = document.getElementById("statArtists");
  const statPoems = document.getElementById("statPoems");

  if (statSongs) statSongs.textContent = songs.filter((s) => s && s.id).length;
  if (statPoems) statPoems.textContent = poems.filter((p) => p && p.id).length;

  const artists = getArtists();
  if (statArtists) statArtists.textContent = artists.length;
}

// 渲染首頁熱門歌手（前6位）
function renderHomeArtists() {
  const homeArtistGrid = document.getElementById("homeArtistGrid");
  if (!homeArtistGrid) return;

  let artists = getArtists();
  artists.sort((a, b) => b.count - a.count);
  const topArtists = artists.slice(0, 6);

  homeArtistGrid.innerHTML = topArtists
    .map((artist) => {
      const initial = artist.name.charAt(0);
      return `
      <div class="artist-card" onclick="showArtistDetail('${artist.name.replace(
        /'/g,
        "\\'"
      )}')">
        <div class="artist-card-avatar">${initial}</div>
        <div class="artist-card-name">${artist.name}</div>
        <div class="artist-card-count">${artist.count} 首</div>
      </div>
    `;
    })
    .join("");
}

// 渲染首頁最新歌曲（前4首）
function renderHomeSongs() {
  const homeSongGrid = document.getElementById("homeSongGrid");
  if (!homeSongGrid) return;

  const validSongs = songs.filter((s) => s && s.id);
  const latestSongs = validSongs.slice(-4).reverse();

  homeSongGrid.innerHTML = latestSongs
    .map((song) => {
      const creators = song.creators ? song.creators.join(", ") : "";
      const albums = song.albums || "";

      return `
      <div class="song-card" onclick="showSongDetail('${song.id}', 'song')">
        <img src="${song.image}" alt="${song.title}">
        <div class="song-card-content">
          <div class="song-info">
            <h3>${song.title}</h3>
            <p class="creator">${creators}</p>
            ${albums ? `<p class="album mobile-show">${albums}</p>` : ""}
          </div>
          <div class="song-card-arrow">→</div>
        </div>
      </div>
    `;
    })
    .join("");
}

// 渲染首頁最新詩詞（前4首）
function renderHomePoems() {
  const homePoemGrid = document.getElementById("homePoemGrid");
  if (!homePoemGrid) return;

  const validPoems = poems.filter((p) => p && p.id);
  const latestPoems = validPoems.slice(-4).reverse();

  homePoemGrid.innerHTML = latestPoems
    .map((poem) => {
      const creators = poem.creators ? poem.creators.join(", ") : "";

      return `
      <div class="song-card" onclick="showSongDetail('${poem.id}', 'poem')">
        <img src="${poems.image || "images/gray.jpg"}" alt="${poem.title}">
        <div class="song-card-content">
          <div class="song-info">
            <h3>${poem.title}</h3>
            <p class="creator">${creators}</p>
          </div>
          <div class="song-card-arrow">→</div>
        </div>
      </div>
    `;
    })
    .join("");
}

// 渲染整個首頁
function renderHomePage() {
  renderHomeStats();
  renderHomeRecentFavorites(); // 🔴 新增這行
  renderHomeArtists();
  renderHomeSongs();
  renderHomePoems();
}

document.addEventListener("DOMContentLoaded", function () {
  // 渲染首頁
  renderHomePage();

  // 渲染歌手清單
  renderHomeArtists();

  // 渲染歌曲列表
  renderHomeSongs();

  // 渲染詩詞列表
  renderHomePoems();

  // 渲染收藏句子列表
  renderFavorites();

  renderHomeRecentFavorites(); // 🔴 新增這行

  const songSortSelect = document.getElementById("songSort");
  const sortOrderSelect = document.getElementById("sortOrder");

  if (songSortSelect) {
    songSortSelect.addEventListener("change", function () {
      console.log("🔄 排序方式變更為:", this.value);
      renderSongs();
    });
  }

  // 🔴 新增：排序順序監聽器
  if (sortOrderSelect) {
    sortOrderSelect.addEventListener("change", function () {
      console.log("🔄 排序順序變更為:", this.value);
      renderSongs();
    });
  }
  // 初始渲染歌曲
  renderSongs();
});

// ===== 歌手清單功能 =====

// 提取所有歌手及其歌曲數量
function getArtists() {
  const artistMap = new Map();

  songs.forEach((song) => {
    if (!song || !song.creators) return;

    song.creators.forEach((creator) => {
      const name = creator.trim();
      if (name) {
        if (!artistMap.has(name)) {
          artistMap.set(name, {
            name: name,
            count: 0,
            songs: []
          });
        }
        const artist = artistMap.get(name);
        artist.count++;
        artist.songs.push(song);
      }
    });
  });

  return Array.from(artistMap.values());
}

// 渲染歌手清單
function renderArtists() {
  const artistGrid = document.getElementById("artistGrid");
  if (!artistGrid) return;

  let artists = getArtists();

  // 取得排序方式
  const sortBy = document.getElementById("artistSort")?.value || "count";

  if (sortBy === "count") {
    artists.sort((a, b) => b.count - a.count);
  } else {
    artists.sort((a, b) => a.name.localeCompare(b.name, "zh-TW"));
  }

  artistGrid.innerHTML = artists
    .map((artist) => {
      // 取得歌手名字的第一個字作為頭像
      const initial = artist.name.charAt(0);

      return `
      <div class="artist-card" onclick="showArtistDetail('${artist.name.replace(
        /'/g,
        "\\'"
      )}')">
        <div class="artist-card-avatar">${initial}</div>
        <div class="artist-card-name">${artist.name}</div>
        <div class="artist-card-count">${artist.count} 首歌曲</div>
      </div>
    `;
    })
    .join("");
}

// 顯示單一歌手的詳細資訊
function showArtistDetail(artistName) {
  const artists = getArtists();
  const artist = artists.find((a) => a.name === artistName);

  if (!artist) return;

  // 更新標題
  document.getElementById("artistName").textContent = artist.name;
  document.getElementById(
    "artistSongCount"
  ).textContent = `共 ${artist.count} 首歌曲`;

  // 渲染該歌手的所有歌曲
  const artistSongGrid = document.getElementById("artistSongGrid");
  artistSongGrid.innerHTML = artist.songs
    .filter((song) => song && song.id)
    .map((song) => {
      const creators = song.creators ? song.creators.join(", ") : "";
      const lyricist = song.lyricist ? song.lyricist.join(", ") : "";
      const composer =
        song.composer && song.composer.length > 0
          ? song.composer.join(", ")
          : "";
      const albums = song.albums || "";

      return `
        <div class="song-card" onclick="showSongDetail('${song.id}', 'song')">
          <img src="${song.image || "images/gray.jpg"}" alt="${song.title}">
          <div class="song-card-content">
            <div class="song-info">
              <h3>${song.title}</h3>
              <p class="creator">${creators}</p>
              ${albums ? `<p class="album mobile-show">${albums}</p>` : ""}
            </div>
            <div class="song-meta desktop-only">
              ${
                lyricist
                  ? `<div class="meta-item"><span class="meta-label">作詞:</span> ${lyricist}</div>`
                  : ""
              }
              ${
                composer
                  ? `<div class="meta-item"><span class="meta-label">作曲:</span> ${composer}</div>`
                  : ""
              }
              ${
                albums
                  ? `<div class="meta-item"><span class="meta-label">專輯:</span> ${albums}</div>`
                  : ""
              }
            </div>
            <div class="song-card-arrow">→</div>
          </div>
        </div>
      `;
    })
    .join("");

  showPage("artistDetail");
}

// 監聽排序變更
document
  .getElementById("artistSort")
  ?.addEventListener("change", renderArtists);

// 在頁面載入時渲染歌手清單
document.addEventListener("DOMContentLoaded", function () {
  // ... 其他初始化程式碼

  // 渲染歌手清單
  renderArtists();
});

// ===== 收藏歌詞功能 =====

// 儲存收藏的歌詞（使用變數，不用 localStorage）
let favoriteLyrics = [];

// 打開收藏表單
function openFavoriteModal(songId, songTitle, songCreators) {
  document.getElementById("favoriteSongId").value = songId;
  document.getElementById("favoriteSongTitle").value = songTitle;
  document.getElementById("favoriteSongCreators").value = songCreators;
  document.getElementById("favoriteLyrics").value = "";
  document.getElementById("favoriteNote").value = "";
  document.getElementById("favoriteModal").classList.add("active");
}

// 關閉收藏表單
function closeFavoriteModal() {
  document.getElementById("favoriteModal").classList.remove("active");
}

// 儲存收藏
async function saveFavorite() {
  const lyrics = document.getElementById("favoriteLyrics").value.trim();
  const note = document.getElementById("favoriteNote").value.trim();
  const songId = document.getElementById("favoriteSongId").value;
  const songTitle = document.getElementById("favoriteSongTitle").value;
  const songCreators = document.getElementById("favoriteSongCreators").value;

  if (!lyrics) {
    alert("請輸入歌詞片段");
    return;
  }

  try {
    // 發送到伺服器
    const response = await fetch("/api/add-favorite", {
      method: "POST",
      headers: { "Content-Type": "application/json" },
      body: JSON.stringify({
        lyrics: lyrics,
        note: note,
        songId: songId,
        songTitle: songTitle,
        songCreators: songCreators
      })
    });

    const result = await response.json();

    if (response.ok) {
      closeFavoriteModal();
      alert("✅ " + result.message);

      // 2秒後重新整理以載入新資料
      setTimeout(() => {
        window.location.reload(true);
      }, 1000);
    } else {
      alert("❌ " + result.error);
    }
  } catch (error) {
    console.error("收藏失敗:", error);
    alert("❌ 收藏失敗，請確認伺服器正在運行");
  }
}

// 刪除收藏
async function deleteFavorite(id) {
  if (!confirm("確定要刪除這個收藏嗎？")) return;

  try {
    const response = await fetch("/api/delete-favorite", {
      method: "POST",
      headers: { "Content-Type": "application/json" },
      body: JSON.stringify({ id: id })
    });

    const result = await response.json();

    if (response.ok) {
      alert("✅ " + result.message);
      setTimeout(() => {
        window.location.reload(true);
      }, 500);
    } else {
      alert("❌ " + result.error);
    }
  } catch (error) {
    console.error("刪除失敗:", error);
    alert("❌ 刪除失敗");
  }
}

// 渲染收藏列表
function renderFavorites() {
  const favoriteGrid = document.getElementById("favoriteGrid");
  const emptyState = document.getElementById("emptyFavorites");

  if (!favoriteGrid) return;

  // 從 main.js 的 favorites 陣列讀取
  if (favorites.length === 0) {
    favoriteGrid.style.display = "none";
    if (emptyState) emptyState.style.display = "block";
    return;
  }

  favoriteGrid.style.display = "grid";
  if (emptyState) emptyState.style.display = "none";

  favoriteGrid.innerHTML = favorites
    .slice()
    .reverse()
    .map(
      (fav) => `
      <div class="favorite-card">
        <button class="favorite-delete" onclick="deleteFavorite('${
          fav.id
        }')">×</button>
        <div class="favorite-lyrics">${fav.lyrics}</div>
        ${fav.note ? `<div class="favorite-note">${fav.note}</div>` : ""}
        <div class="favorite-source">
          <strong>${fav.songTitle}</strong> - ${fav.songCreators}
        </div>
      </div>
    `
    )
    .join("");
}

// 修改 showSongDetail 函式，加入收藏按鈕
// 在 songDetail.innerHTML 中的 .song-detail-header 後面加入按鈕

// 生成歌曲詳細資訊區塊
function generateSongMeta(item) {
  const metaItems = [];

  // 作詞
  if (item.lyricist && item.lyricist.length > 0) {
    metaItems.push({
      label: "作詞",
      value: Array.isArray(item.lyricist)
        ? item.lyricist.join(", ")
        : item.lyricist
    });
  }

  // 作曲
  if (item.composer && item.composer.length > 0) {
    metaItems.push({
      label: "作曲",
      value: Array.isArray(item.composer)
        ? item.composer.join(", ")
        : item.composer
    });
  }

  if (item.original_artist && item.original_artist.length > 0) {
    metaItems.push({
      label: "原唱",
      value: Array.isArray(item.original_artist)
        ? item.original_artist.join(", ")
        : item.original_artist
    });
  }

  // 專輯
  if (item.albums) {
    metaItems.push({
      label: "專輯",
      value: item.albums
    });
  }

  // 發行日期
  if (item.release_date) {
    metaItems.push({
      label: "發行日期",
      value: item.release_date
    });
  }

  // 語言
  if (item.language) {
    metaItems.push({
      label: "語言",
      value: item.language
    });
  }

  // 風格
  if (item.genre) {
    metaItems.push({
      label: "風格",
      value: item.genre
    });
  }

  // 如果沒有任何資訊，回傳空字串
  if (metaItems.length === 0) {
    return "";
  }

  // 生成 HTML
  return `
    <div class="song-detail-meta">
      ${metaItems
        .map(
          (meta) => `
        <div class="meta-row">
          <span class="meta-label">${meta.label}:</span>
          <span class="meta-value">${meta.value}</span>
        </div>
      `
        )
        .join("")}
    </div>
  `;

  // 🔴 詩詞相關欄位
  if (item.dynasty) {
    metaItems.push({
      label: "朝代",
      value: item.dynasty
    });
  }

  if (item.poem_type) {
    metaItems.push({
      label: "類型",
      value: item.poem_type
    });
  }

  if (item.author_info) {
    metaItems.push({
      label: "作者簡介",
      value: item.author_info
    });
  }

  if (item.background) {
    metaItems.push({
      label: "創作背景",
      value: item.background
    });
  }

  if (item.translation) {
    metaItems.push({
      label: "翻譯",
      value: item.translation
    });
  }

  if (item.annotation) {
    metaItems.push({
      label: "註釋",
      value: item.annotation
    });
  }

  // 通用欄位
  if (item.albums) {
    metaItems.push({
      label: "專輯",
      value: item.albums
    });
  }

  if (item.release_date) {
    metaItems.push({
      label: "發行日期",
      value: item.release_date
    });
  }

  if (item.language) {
    metaItems.push({
      label: "語言",
      value: item.language
    });
  }

  if (item.genre) {
    metaItems.push({
      label: "風格",
      value: item.genre
    });
  }

  if (item.rating) {
    const ratingNum = parseInt(item.rating) || 0;
    let stars = "";
    for (let i = 1; i <= 5; i++) {
      if (i <= ratingNum) {
        stars += "⭐";
      } else {
        stars += "☆";
      }
    }
    metaItems.push({
      label: "評分",
      value: `${stars} (${ratingNum}/5)`
    });
  }

  if (metaItems.length === 0) return "";

  return `
        <div class="song-detail-meta">
            ${metaItems
              .map(
                (meta) => `
                <div class="meta-row">
                    <span class="meta-label">${meta.label}：</span>
                    <span class="meta-value">${meta.value}</span>
                </div>
            `
              )
              .join("")}
        </div>
    `;
}

// 全域變數
let panelVisible = false;

// 切換面板顯示/隱藏
function togglePanel() {
  const panel = document.getElementById("import-export-panel");
  const toggleBtn = document.getElementById("toggle-panel-btn");

  if (panelVisible) {
    panel.style.display = "none";
    toggleBtn.style.display = "block";
    panelVisible = false;
  } else {
    panel.style.display = "block";
    toggleBtn.style.display = "none";
    panelVisible = true;
  }
}

// 顯示狀態訊息
function showStatus(message, type = "info") {
  const statusDiv = document.getElementById("operation-status");
  statusDiv.style.display = "block";
  statusDiv.textContent = message;

  // 設定顏色
  switch (type) {
    case "success":
      statusDiv.style.background = "#d4edda";
      statusDiv.style.color = "#155724";
      statusDiv.style.border = "1px solid #c3e6cb";
      break;
    case "error":
      statusDiv.style.background = "#f8d7da";
      statusDiv.style.color = "#721c24";
      statusDiv.style.border = "1px solid #f5c6cb";
      break;
    case "warning":
      statusDiv.style.background = "#fff3cd";
      statusDiv.style.color = "#856404";
      statusDiv.style.border = "1px solid #ffeaa7";
      break;
    default:
      statusDiv.style.background = "#d1ecf1";
      statusDiv.style.color = "#0c5460";
      statusDiv.style.border = "1px solid #bee5eb";
  }

  // 自動隱藏
  setTimeout(() => {
    statusDiv.style.display = "none";
  }, 5000);
}

// 查看本地資料
async function viewLocalData() {
  showStatus("🔍 正在讀取本地資料...", "info");

  try {
    const response = await fetch("/api/debug/data");
    const data = await response.json();

    if (data.success) {
      console.log("📊 本地資料詳情:", data);

      const summaryText = `本地資料統計：
📀 歌曲數量：${data.summary.totalSongs} 首
⭐ 收藏數量：${data.summary.totalFavorites} 個
🎵 最新歌曲：${data.summary.lastSong}
💖 最新收藏：${data.summary.lastFavorite}

詳細資料已輸出到瀏覽器控制台 (按F12查看)`;

      alert(summaryText);
      showStatus(
        `✅ 資料讀取完成：${data.summary.totalSongs}首歌曲`,
        "success"
      );
    } else {
      throw new Error(data.error);
    }
  } catch (error) {
    console.error("❌ 讀取本地資料失敗:", error);
    alert("讀取資料失敗：" + error.message);
    showStatus("❌ 讀取失敗", "error");
  }
}

// 匯出本地資料
function exportLocalData() {
  showStatus("📥 正在準備匯出...", "info");

  try {
    // 建立下載連結
    const link = document.createElement("a");
    link.href = "/api/export/songs";
    link.download = `songs-export-${new Date()
      .toISOString()
      .slice(0, 10)}.json`;

    // 觸發下載
    document.body.appendChild(link);
    link.click();
    document.body.removeChild(link);

    showStatus("✅ 匯出檔案已下載", "success");

    console.log("📥 匯出操作已執行，檔案下載中...");
  } catch (error) {
    console.error("❌ 匯出失敗:", error);
    alert("匯出失敗：" + error.message);
    showStatus("❌ 匯出失敗", "error");
  }
}

// 處理匯入檔案
function handleImportFile() {
  const fileInput = document.getElementById("importFileInput");
  const file = fileInput.files[0];

  if (!file) {
    showStatus("⚠️ 請選擇檔案", "warning");
    return;
  }

  // 檢查檔案類型
  if (!file.name.toLowerCase().endsWith(".json")) {
    alert("請選擇 JSON 格式的檔案");
    showStatus("❌ 檔案格式錯誤", "error");
    return;
  }

  // 檢查檔案大小 (限制 10MB)
  if (file.size > 10 * 1024 * 1024) {
    alert("檔案太大，請選擇小於 10MB 的檔案");
    showStatus("❌ 檔案過大", "error");
    return;
  }

  showStatus(`📤 正在讀取檔案：${file.name}`, "info");
  console.log(
    "📤 選擇的檔案:",
    file.name,
    `${(file.size / 1024).toFixed(2)} KB`
  );

  const reader = new FileReader();

  reader.onload = async function (e) {
    try {
      showStatus("🔄 正在解析 JSON 資料...", "info");

      // 解析 JSON
      const importData = JSON.parse(e.target.result);
      console.log("📊 解析的資料結構:", {
        hasExportTime: !!importData.exportTime,
        hasSongs: !!importData.songs,
        hasFavorites: !!importData.favorites,
        songsCount: importData.songs ? importData.songs.length : 0,
        favoritesCount: importData.favorites ? importData.favorites.length : 0,
        isArray: Array.isArray(importData)
      });

      // 驗證資料格式
      let songsCount = 0;
      let favoritesCount = 0;

      if (importData.songs && Array.isArray(importData.songs)) {
        songsCount = importData.songs.length;
      } else if (Array.isArray(importData)) {
        songsCount = importData.length;
      }

      if (importData.favorites && Array.isArray(importData.favorites)) {
        favoritesCount = importData.favorites.length;
      }

      if (songsCount === 0 && favoritesCount === 0) {
        throw new Error("檔案中沒有找到可匯入的歌曲或收藏資料");
      }

      // 確認匯入
      const confirmMsg = `準備匯入：
📀 歌曲：${songsCount} 首
⭐ 收藏：${favoritesCount} 個

是否確認匯入？重複的項目會自動跳過。`;

      if (!confirm(confirmMsg)) {
        showStatus("⚠️ 匯入已取消", "warning");
        return;
      }

      showStatus("🚀 正在匯入資料，請稍候...", "info");

      // 發送匯入請求
      const response = await fetch("/api/import/songs", {
        method: "POST",
        headers: {
          "Content-Type": "application/json"
        },
        body: JSON.stringify(importData)
      });

      const result = await response.json();
      console.log("📥 匯入結果:", result);

      if (result.success) {
        let successMsg = result.message;

        if (result.errors && result.errors.length > 0) {
          successMsg += `\n\n⚠️ 部分項目有問題：\n${result.errors
            .slice(0, 3)
            .join("\n")}`;
          if (result.errors.length > 3) {
            successMsg += `\n... 還有 ${result.errors.length - 3} 個錯誤`;
          }
          console.warn("匯入時的錯誤:", result.errors);
        }

        alert(successMsg);
        showStatus(`✅ 匯入成功：${result.imported.songs}首歌曲`, "success");

        // 重新載入頁面以顯示新資料
        setTimeout(() => {
          location.reload();
        }, 1500);
      } else {
        throw new Error(result.error);
      }

      // 清空檔案輸入
      fileInput.value = "";
    } catch (parseError) {
      console.error("❌ 處理檔案失敗:", parseError);
      let errorMsg = "檔案處理失敗：" + parseError.message;

      if (parseError.name === "SyntaxError") {
        errorMsg =
          "檔案格式錯誤：這不是一個有效的 JSON 檔案。請檢查檔案內容是否正確。";
      }

      alert(errorMsg);
      showStatus("❌ 檔案處理失敗", "error");

      // 清空檔案輸入
      fileInput.value = "";
    }
  };

  reader.onerror = function (error) {
    console.error("❌ 讀取檔案失敗:", error);
    alert("讀取檔案失敗，請重試");
    showStatus("❌ 讀取檔案失敗", "error");
    fileInput.value = "";
  };

  // 開始讀取檔案
  reader.readAsText(file, "UTF-8");
}

// 頁面載入完成後的初始化
document.addEventListener("DOMContentLoaded", function () {
  const panel = document.getElementById("import-export-panel");
  const toggleBtn = document.getElementById("toggle-panel-btn");

  if (panel && toggleBtn) {
    // 強制設定初始狀態：面板隱藏，按鈕顯示
    panel.style.display = "none";
    toggleBtn.style.display = "block";
    panelVisible = false; // 確保狀態變數正確

    console.log("🎯 資料管理功能已載入 (面板預設隱藏)");
  }
});

// ===== 刪除歌曲函數 =====
async function deleteSong(id, title) {
  // 雙重確認
  const confirmDelete = confirm(
    `⚠️ 確定要刪除歌曲「${title}」嗎？\n\n此操作將同時刪除：\n• 歌曲本身\n• 相關圖片檔案\n• 所有相關的收藏句子\n\n此操作無法復原！`
  );

  if (!confirmDelete) {
    return;
  }

  // 第二次確認
  const finalConfirm = confirm(`🚨 最後確認：真的要永久刪除「${title}」嗎？`);

  if (!finalConfirm) {
    return;
  }

  try {
    console.log("🗑️ 準備刪除歌曲:", id);

    const response = await fetch("/api/delete-song", {
      method: "POST",
      headers: {
        "Content-Type": "application/json"
      },
      body: JSON.stringify({ id: id })
    });

    const result = await response.json();

    if (response.ok) {
      alert("✅ " + result.message);

      // 返回歌曲列表
      showPage("songs");

      // 重新載入頁面以更新資料
      setTimeout(() => {
        window.location.reload();
      }, 500);
    } else {
      alert("❌ 刪除失敗：" + result.error);
    }
  } catch (error) {
    console.error("❌ 刪除歌曲失敗:", error);
    alert("❌ 刪除失敗：" + error.message);
  }
}

// ===== 渲染首頁最新收藏 =====
function renderHomeRecentFavorites() {
  const homeRecentFavorites = document.getElementById("homeRecentFavorites");
  if (!homeRecentFavorites) return;

  // 獲取最新的 4 個收藏，按時間倒序
  const recentFavorites = [...favorites]
    .sort((a, b) => new Date(b.createdAt) - new Date(a.createdAt))
    .slice(0, 3);

  if (recentFavorites.length === 0) {
    homeRecentFavorites.innerHTML = `
            <div class="empty-favorites-home">
                <p>還沒有收藏任何句子</p>
                <a href="#songs" onclick="showPage('songs'); return false;" class="browse-songs-btn">
                    瀏覽歌曲並收藏句子 →
                </a>
            </div>
        `;
    return;
  }

  homeRecentFavorites.innerHTML = recentFavorites
    .map((fav) => {
      // 截取歌詞，最多顯示 80 字符
      const truncatedLyrics =
        fav.lyrics.length > 80
          ? fav.lyrics.substring(0, 80) + "..."
          : fav.lyrics;

      // 格式化時間為相對時間
      const timeAgo = getTimeAgo(fav.createdAt);

      return `
                <div class="favorite-card-mini" onclick="showFavoriteDetail('${
                  fav.id
                }')">
                    <div class="favorite-lyrics-mini">
                        "${truncatedLyrics}"
                    </div>
                    <div class="favorite-meta-mini">
                        <div class="favorite-song-info">
                            <strong>${fav.songTitle}</strong>
                            ${fav.songCreators ? ` - ${fav.songCreators}` : ""}
                        </div>
                        <div class="favorite-time">
                            ${timeAgo}
                        </div>
                    </div>
                    ${
                      fav.note
                        ? `<div class="favorite-note-mini">💭 ${fav.note}</div>`
                        : ""
                    }
                </div>
            `;
    })
    .join("");
}

// ===== 時間轉換輔助函數 =====
function getTimeAgo(dateString) {
  const now = new Date();
  const past = new Date(dateString);
  const diffMs = now - past;
  const diffMins = Math.floor(diffMs / (1000 * 60));
  const diffHours = Math.floor(diffMs / (1000 * 60 * 60));
  const diffDays = Math.floor(diffMs / (1000 * 60 * 60 * 24));

  if (diffMins < 1) return "剛剛";
  if (diffMins < 60) return `${diffMins} 分鐘前`;
  if (diffHours < 24) return `${diffHours} 小時前`;
  if (diffDays < 30) return `${diffDays} 天前`;

  return past.toLocaleDateString("zh-TW", {
    month: "long",
    day: "numeric"
  });
}

// ===== 顯示收藏詳細資訊 =====
function showFavoriteDetail(favoriteId) {
  const favorite = favorites.find((f) => f.id === favoriteId);
  if (!favorite) return;

  // 找到相關的歌曲
  const relatedSong = songs.find((s) => s.id === favorite.songId);

  if (relatedSong) {
    // 如果找到相關歌曲，跳轉到歌曲詳細頁面
    showSongDetail(relatedSong.id, "song");
  } else {
    // 如果沒找到相關歌曲，跳轉到收藏頁面
    showPage("favorites");
  }
}

// ===== 詩詞圖片預覽 =====
document.getElementById("poemImage")?.addEventListener("change", function (e) {
  const file = e.target.files[0];
  const preview = document.getElementById("poemImagePreview");

  if (file) {
    const reader = new FileReader();
    reader.onload = function (e) {
      preview.innerHTML = `<img src="${e.target.result}" alt="預覽圖片" style="max-width: 200px; border-radius: 8px; margin-top: 10px;">`;
    };
    reader.readAsDataURL(file);
  } else {
    preview.innerHTML = "";
  }
});

// ===== 詩詞上傳表單處理 =====
document
  .getElementById("uploadPoemForm")
  ?.addEventListener("submit", async function (e) {
    e.preventDefault();

    const statusDiv = document.getElementById("uploadPoemStatus");
    const formData = new FormData(this);

    // 確保所有欄位都有被添加到 FormData
    console.log("📊 詩詞表單資料:");
    for (let [key, value] of formData.entries()) {
      console.log(`${key}: ${value}`);
    }

    statusDiv.innerHTML = `<p style="color: var(--color-primary);">⏳ 正在上傳文章...</p>`;
    statusDiv.className = "upload-status active";

    try {
      const response = await fetch("/api/upload-poem", {
        method: "POST",
        body: formData
      });

      const result = await response.json();

      if (response.ok) {
        statusDiv.innerHTML = `<p style="color: var(--color-success);">${result.message}</p>`;
        this.reset();
        document.getElementById("poemImagePreview").innerHTML = "";

        // 重新整理頁面以顯示新詩詞
        setTimeout(() => {
          window.location.reload();
        }, 2000);
      } else {
        statusDiv.innerHTML = `<p style="color: var(--color-error);">${result.error}</p>`;
      }
    } catch (error) {
      statusDiv.innerHTML = `<p style="color: var(--color-error);">網路錯誤：${error.message}</p>`;
    }
  });
